{"vllm": 0, "code": 1, "conduct": 2, "our": 3, "pledge": 4, "we": 5, "members": 6, "contributors": 7, "leaders": 8, "make": 9, "participation": 10, "community": 11, "harassment": 12, "free": 13, "experience": 14, "everyone": 15, "regardless": 16, "age": 17, "body": 18, "size": 19, "visible": 20, "invisible": 21, "disability": 22, "ethnicity": 23, "sex": 24, "characteristics": 25, "gender": 26, "identity": 27, "expression": 28, "level": 29, "education": 30, "socioeconomic": 31, "status": 32, "nationality": 33, "personal": 34, "appearance": 35, "race": 36, "caste": 37, "color": 38, "religion": 39, "sexual": 40, "orientation": 41, "act": 42, "interact": 43, "ways": 44, "contribute": 45, "open": 46, "welcoming": 47, "diverse": 48, "inclusive": 49, "healthy": 50, "standards": 51, "examples": 52, "behavior": 53, "contributes": 54, "positive": 55, "environment": 56, "include": 57, "demonstrating": 58, "empathy": 59, "kindness": 60, "toward": 61, "other": 62, "people": 63, "being": 64, "respectful": 65, "differing": 66, "opinions": 67, "viewpoints": 68, "experiences": 69, "giving": 70, "gracefully": 71, "accepting": 72, "constructive": 73, "feedback": 74, "responsibility": 75, "apologizing": 76, "those": 77, "affected": 78, "mistakes": 79, "learning": 80, "from": 81, "focusing": 82, "what": 83, "best": 84, "just": 85, "us": 86, "individuals": 87, "overall": 88, "unacceptable": 89, "use": 90, "sexualized": 91, "language": 92, "imagery": 93, "attention": 94, "advances": 95, "any": 96, "kind": 97, "trolling": 98, "insulting": 99, "derogatory": 100, "comments": 101, "political": 102, "attacks": 103, "public": 104, "private": 105, "publishing": 106, "others": 107, "information": 108, "physical": 109, "email": 110, "address": 111, "without": 112, "explicit": 113, "permission": 114, "which": 115, "could": 116, "reasonably": 117, "considered": 118, "inappropriate": 119, "professional": 120, "setting": 121, "enforcement": 122, "responsibilities": 123, "responsible": 124, "clarifying": 125, "enforcing": 126, "acceptable": 127, "take": 128, "appropriate": 129, "fair": 130, "corrective": 131, "action": 132, "response": 133, "deem": 134, "threatening": 135, "offensive": 136, "harmful": 137, "have": 138, "right": 139, "remove": 140, "edit": 141, "reject": 142, "commits": 143, "wiki": 144, "edits": 145, "issues": 146, "contributions": 147, "aligned": 148, "communicate": 149, "reasons": 150, "moderation": 151, "decisions": 152, "when": 153, "scope": 154, "applies": 155, "within": 156, "all": 157, "spaces": 158, "also": 159, "individual": 160, "officially": 161, "representing": 162, "using": 163, "official": 164, "posting": 165, "via": 166, "social": 167, "media": 168, "account": 169, "acting": 170, "appointed": 171, "representative": 172, "online": 173, "offline": 174, "irl": 175, "event": 176, "instances": 177, "abusive": 178, "harassing": 179, "otherwise": 180, "may": 181, "reported": 182, "channel": 183, "slack": 184, "https": 185, "ai": 186, "complaints": 187, "reviewed": 188, "investigated": 189, "promptly": 190, "fairly": 191, "obligated": 192, "respect": 193, "privacy": 194, "security": 195, "reporter": 196, "incident": 197, "guidelines": 198, "follow": 199, "impact": 200, "determining": 201, "consequences": 202, "violation": 203, "correction": 204, "deemed": 205, "unprofessional": 206, "unwelcome": 207, "consequence": 208, "written": 209, "warning": 210, "providing": 211, "clarity": 212, "around": 213, "nature": 214, "explanation": 215, "why": 216, "apology": 217, "requested": 218, "through": 219, "single": 220, "series": 221, "actions": 222, "continued": 223, "interaction": 224, "involved": 225, "including": 226, "unsolicited": 227, "specified": 228, "period": 229, "time": 230, "includes": 231, "avoiding": 232, "interactions": 233, "well": 234, "external": 235, "channels": 236, "like": 237, "violating": 238, "terms": 239, "lead": 240, "temporary": 241, "permanent": 242, "ban": 243, "serious": 244, "sustained": 245, "sort": 246, "communication": 247, "allowed": 248, "during": 249, "pattern": 250, "aggression": 251, "disparagement": 252, "classes": 253, "attribution": 254, "adapted": 255, "contributor": 256, "covenant": 257, "www": 258, "org": 259, "version": 260, "available": 261, "v2": 262, "code_of_conduct": 263, "html": 264, "were": 265, "inspired": 266, "mozilla": 267, "ladder": 268, "github": 269, "com": 270, "inclusion": 271, "answers": 272, "common": 273, "questions": 274, "about": 275, "see": 276, "faq": 277, "translations": 278, "contributing": 279, "you": 280, "find": 281, "docs": 282, "en": 283, "latest": 284, "markdownlint": 285, "disable": 286, "md001": 287, "md041": 288, "align": 289, "center": 290, "picture": 291, "source": 292, "prefers": 293, "scheme": 294, "dark": 295, "srcset": 296, "raw": 297, "githubusercontent": 298, "project": 299, "main": 300, "assets": 301, "logos": 302, "logo": 303, "text": 304, "png": 305, "img": 306, "alt": 307, "src": 308, "light": 309, "width": 310, "55": 311, "h3": 312, "easy": 313, "fast": 314, "cheap": 315, "llm": 316, "serving": 317, "href": 318, "documentation": 319, "blog": 320, "arxiv": 321, "abs": 322, "2309": 323, "06180": 324, "paper": 325, "vllm_project": 326, "twitter": 327, "discuss": 328, "user": 329, "forum": 330, "developer": 331, "news": 332, "2025": 333, "08": 334, "hosted": 335, "beijing": 336, "meetup": 337, "mp": 338, "weixin": 339, "qq": 340, "dgkwg1wfpwgo2jcdtqqhxa": 341, "large": 342, "scale": 343, "deployment": 344, "please": 345, "slides": 346, "here": 347, "drive": 348, "google": 349, "folders": 350, "1pid6nsflu43dzri0eatcpgxsazdvbbqf": 351, "recording": 352, "chaspark": 353, "live": 354, "1166916873711665152": 355, "05": 356, "nyc": 357, "lu": 358, "ma": 359, "c1rqyf1f": 360, "presentation": 361, "1_q_aw_iomjwuimf1s1ym": 362, "zhjxz8cuel0ijvaquoybea": 363, "usp": 364, "sharing": 365, "now": 366, "under": 367, "pytorch": 368, "foundation": 369, "announcement": 370, "welcomes": 371, "01": 372, "excited": 373, "announce": 374, "alpha": 375, "release": 376, "v1": 377, "major": 378, "architectural": 379, "upgrade": 380, "7x": 381, "speedup": 382, "clean": 383, "optimized": 384, "execution": 385, "loop": 386, "zero": 387, "overhead": 388, "prefix": 389, "caching": 390, "enhanced": 391, "multimodal": 392, "support": 393, "more": 394, "check": 395, "out": 396, "post": 397, "27": 398, "details": 399, "summary": 400, "previous": 401, "04": 402, "asia": 403, "day": 404, "sginnovate": 405, "limited": 406, "availability": 407, "morning": 408, "evening": 409, "slots": 410, "remaining": 411, "inaugural": 412, "team": 413, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 414, "03": 415, "ollama": 416, "inference": 417, "night": 418, "16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u": 419, "first": 420, "china": 421, "n77gibl2coratqhtveazfg": 422, "1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq": 423, "east": 424, "coast": 425, "7mu4k4xx": 426, "1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs": 427, "slide": 428, "id": 429, "g31441846c39_0_0": 430, "02": 431, "ninth": 432, "h7g3kuj9": 433, "meta": 434, "1jzc_pzvxrvnsfvcw": 435, "v4cfxb6pn7zz2cyp_flwo05aqg": 436, "amd": 437, "file": 438, "1zk5qejiktmlq2eqcxqzlljax3m9s7nwn": 439, "view": 440, "posted": 441, "eighth": 442, "zep56hui": 443, "cloud": 444, "1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4": 445, "1h24phewanyrl11xy5dxubvrc9f9kkjix": 446, "2024": 447, "12": 448, "joins": 449, "ecosystem": 450, "11": 451, "seventh": 452, "h0qvrajz": 453, "wi": 454, "th": 455, "snowflake": 456, "1e3cxqbv3jsfgp30swyvs3em_tw": 457, "ghohj9pajgk6kr54": 458, "1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a": 459, "10": 460, "created": 461, "coordinating": 462, "discussing": 463, "features": 464, "feel": 465, "join": 466, "ray": 467, "summit": 468, "held": 469, "special": 470, "track": 471, "opening": 472, "talk": 473, "1b_kqxphbtra_mdf": 474, "tr6i8rwdou5qotznceg2mkzxehm": 475, "learn": 476, "talks": 477, "youtube": 478, "playlist": 479, "list": 480, "plztswpqnepxl6aqwifuwuimlpfrvpksjr": 481, "users": 482, "09": 483, "sixth": 484, "87q3nvnh": 485, "nvidia": 486, "1wrlgwytqfaotd5wcgspnhoaw3nq0e": 487, "9wqyp7ny93xrs": 488, "07": 489, "fifth": 490, "lp0gyjqr": 491, "aws": 492, "1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y": 493, "partnership": 494, "supports": 495, "llama": 496, "fp8": 497, "quantization": 498, "pipeline": 499, "parallelism": 500, "23": 501, "llama31": 502, "06": 503, "fourth": 504, "agivllm": 505, "cloudflare": 506, "bentoml": 507, "1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4": 508, "third": 509, "robloxandvllmmeetup2024": 510, "splashthat": 511, "roblox": 512, "1a": 513, "47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem": 514, "second": 515, "ygxbpzhl": 516, "ibm": 517, "12mi2skabnuw5rbwxdyy": 518, "hthth4imsnceoq10jdqbxga": 519, "2023": 520, "a16z": 521, "1ql": 522, "xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s": 523, "would": 524, "express": 525, "sincere": 526, "gratitude": 527, "andreessen": 528, "horowitz": 529, "30": 530, "supporting": 531, "generous": 532, "grant": 533, "development": 534, "research": 535, "released": 536, "fastchat": 537, "integration": 538, "has": 539, "powered": 540, "lmsys": 541, "vicuna": 542, "chatbot": 543, "arena": 544, "chat": 545, "since": 546, "mid": 547, "april": 548, "library": 549, "originally": 550, "developed": 551, "sky": 552, "computing": 553, "lab": 554, "cs": 555, "berkeley": 556, "edu": 557, "uc": 558, "evolved": 559, "driven": 560, "both": 561, "academia": 562, "industry": 563, "state": 564, "art": 565, "throughput": 566, "efficient": 567, "management": 568, "key": 569, "value": 570, "memory": 571, "pagedattention": 572, "20": 573, "continuous": 574, "batching": 575, "incoming": 576, "requests": 577, "model": 578, "cuda": 579, "hip": 580, "graph": 581, "quantizations": 582, "gptq": 583, "2210": 584, "17323": 585, "awq": 586, "2306": 587, "00978": 588, "autoround": 589, "05516": 590, "int4": 591, "int8": 592, "kernels": 593, "flashattention": 594, "flashinfer": 595, "speculative": 596, "decoding": 597, "chunked": 598, "prefill": 599, "flexible": 600, "seamless": 601, "popular": 602, "hugging": 603, "face": 604, "models": 605, "high": 606, "various": 607, "algorithms": 608, "parallel": 609, "sampling": 610, "beam": 611, "search": 612, "tensor": 613, "data": 614, "expert": 615, "distributed": 616, "streaming": 617, "outputs": 618, "openai": 619, "compatible": 620, "api": 621, "server": 622, "gpus": 623, "cpus": 624, "intel": 625, "powerpc": 626, "tpu": 627, "neuron": 628, "multi": 629, "lora": 630, "seamlessly": 631, "most": 632, "huggingface": 633, "transformer": 634, "llms": 635, "mixture": 636, "mixtral": 637, "deepseek": 638, "v3": 639, "embedding": 640, "e5": 641, "mistral": 642, "modal": 643, "llava": 644, "full": 645, "supported": 646, "supported_models": 647, "getting": 648, "started": 649, "install": 650, "pip": 651, "getting_started": 652, "installation": 653, "gpu": 654, "index": 655, "build": 656, "wheel": 657, "bash": 658, "visit": 659, "quickstart": 660, "welcome": 661, "collaborations": 662, "how": 663, "get": 664, "sponsors": 665, "compute": 666, "resources": 667, "testing": 668, "following": 669, "organizations": 670, "thank": 671, "your": 672, "note": 673, "them": 674, "alphabetical": 675, "order": 676, "keep": 677, "consistent": 678, "md": 679, "cash": 680, "donations": 681, "dropbox": 682, "sequoia": 683, "capital": 684, "skywork": 685, "zhenfund": 686, "alibaba": 687, "anyscale": 688, "crusoe": 689, "databricks": 690, "deepinfra": 691, "lambda": 692, "nebius": 693, "novita": 694, "replicate": 695, "runpod": 696, "trainy": 697, "san": 698, "diego": 699, "sponsor": 700, "fundraising": 701, "venue": 702, "opencollective": 703, "plan": 704, "fund": 705, "maintenance": 706, "adoption": 707, "citation": 708, "cite": 709, "bibtex": 710, "inproceedings": 711, "kwon2023efficient": 712, "title": 713, "author": 714, "woosuk": 715, "kwon": 716, "zhuohan": 717, "li": 718, "siyuan": 719, "zhuang": 720, "ying": 721, "sheng": 722, "lianmin": 723, "zheng": 724, "cody": 725, "hao": 726, "yu": 727, "joseph": 728, "gonzalez": 729, "zhang": 730, "ion": 731, "stoica": 732, "booktitle": 733, "proceedings": 734, "acm": 735, "sigops": 736, "29th": 737, "symposium": 738, "operating": 739, "systems": 740, "principles": 741, "year": 742, "contact": 743, "start": 744, "technical": 745, "feature": 746, "fellow": 747, "disclosures": 748, "advisories": 749, "partnerships": 750, "lists": 751, "mailto": 752, "end": 753, "kit": 754, "wish": 755, "refer": 756, "repo": 757, "releasing": 758, "releases": 759, "offer": 760, "reliable": 761, "base": 762, "packaged": 763, "binary": 764, "format": 765, "can": 766, "conveniently": 767, "accessed": 768, "pypi": 769, "serve": 770, "milestones": 771, "newly": 772, "improvements": 773, "upcoming": 774, "changes": 775, "affect": 776, "potential": 777, "breaking": 778, "versioning": 779, "uses": 780, "shifted": 781, "where": 782, "new": 783, "patch": 784, "every": 785, "weeks": 786, "contain": 787, "bug": 788, "fixes": 789, "opposed": 790, "semver": 791, "contains": 792, "only": 793, "backwards": 794, "critical": 795, "need": 796, "made": 797, "post1": 798, "_major_": 799, "milestone": 800, "incompatible": 801, "similar": 802, "_minor_": 803, "_patch_": 804, "_post1_": 805, "_patch": 806, "1_": 807, "either": 808, "implicit": 809, "cadence": 810, "bi": 811, "weekly": 812, "basis": 813, "days": 814, "after": 815, "same": 816, "branch": 817, "future": 818, "dates": 819, "below": 820, "tentative": 821, "optional": 822, "date": 823, "versions": 824, "jan": 825, "feb": 826, "mar": 827, "apr": 828, "jun": 829, "jul": 830, "13": 831, "aug": 832, "14": 833, "15": 834, "sep": 835, "16": 836, "17": 837, "oct": 838, "18": 839, "19": 840, "nov": 841, "21": 842, "dec": 843, "22": 844, "each": 845, "built": 846, "dedicated": 847, "cut": 848, "performed": 849, "before": 850, "previously": 851, "reused": 852, "builds": 853, "triggered": 854, "push": 855, "rc": 856, "tag": 857, "vx": 858, "rc1": 859, "enables": 860, "test": 861, "multiple": 862, "rcs": 863, "final": 864, "does": 865, "trigger": 866, "used": 867, "notes": 868, "monitor": 869, "reverts": 870, "apply": 871, "cherry": 872, "pick": 873, "criteria": 874, "approach": 875, "finalizing": 876, "clear": 877, "picks": 878, "process": 879, "land": 880, "pr": 881, "typically": 882, "ensure": 883, "sufficient": 884, "complete": 885, "thorough": 886, "round": 887, "stable": 888, "regression": 889, "functional": 890, "performance": 891, "against": 892, "recent": 893, "severe": 894, "issue": 895, "silent": 896, "incorrectness": 897, "compatibility": 898, "crashes": 899, "deadlocks": 900, "leaks": 901, "introduced": 902, "specific": 903, "change": 904, "identifiers": 905, "ci": 906, "work": 907, "prs": 908, "merged": 909, "trunk": 910, "exception": 911, "manual": 912, "validations": 913, "e2e": 914, "validation": 915, "perform": 916, "regressions": 917, "benchmark": 918, "workflow": 919, "workflows": 920, "yml": 921, "current": 922, "coverage": 923, "llama3": 924, "llama4": 925, "hardware": 926, "h100": 927, "mi300x": 928, "_note": 929, "based": 930, "availability_": 931, "step": 932, "access": 933, "request": 934, "write": 935, "repository": 936, "run": 937, "review": 938, "setup": 939, "familiarize": 940, "yourself": 941, "configurations": 942, "tree": 943, "benchmarks": 944, "rocm": 945, "navigate": 946, "configure": 947, "set": 948, "v0": 949, "commit": 950, "hash": 951, "results": 952, "once": 953, "completes": 954, "dashboard": 955, "hud": 956, "reponame": 957, "2fvllm": 958, "corresponding": 959, "comparison": 960, "compare": 961, "verify": 962, "occurred": 963, "example": 964, "vs": 965, "starttime": 966, "thu": 967, "2c": 968, "2017": 969, "20apr": 970, "202025": 971, "2021": 972, "3a43": 973, "3a50": 974, "20gmt": 975, "stoptime": 976, "wed": 977, "2016": 978, "20jul": 979, "granularity": 980, "week": 981, "lbranch": 982, "lcommit": 983, "b6553be1bc75f046b00046a4ad7576364d03c835": 984, "rbranch": 985, "rcommit": 986, "a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f": 987, "benchmarkname": 988, "modelname": 989, "20models": 990, "backendname": 991, "20backends": 992, "modename": 993, "20modes": 994, "dtypename": 995, "20dtype": 996, "devicename": 997, "20devices": 998, "archname": 999, "20platforms": 1000, "policy": 1001, "reporting": 1002, "report": 1003, "privately": 1004, "vulnerability": 1005, "submission": 1006, "form": 1007, "triage": 1008, "reports": 1009, "triaged": 1010, "vulnerability_management": 1011, "threat": 1012, "guide": 1013, "usage": 1014, "assumptions": 1015, "recommendations": 1016, "blob": 1017, "securely": 1018, "severity": 1019, "determine": 1020, "risk": 1021, "taking": 1022, "dealing": 1023, "past": 1024, "defaults": 1025, "cases": 1026, "categories": 1027, "vulnerabilities": 1028, "allow": 1029, "remote": 1030, "attackers": 1031, "execute": 1032, "arbitrary": 1033, "control": 1034, "system": 1035, "significantly": 1036, "compromise": 1037, "confidentiality": 1038, "integrity": 1039, "privileges": 1040, "needed": 1041, "network": 1042, "deserialization": 1043, "exploit": 1044, "chains": 1045, "generally": 1046, "rated": 1047, "cvss": 1048, "flaws": 1049, "elevated": 1050, "rce": 1051, "contexts": 1052, "significant": 1053, "loss": 1054, "require": 1055, "advanced": 1056, "conditions": 1057, "some": 1058, "trust": 1059, "modes": 1060, "node": 1061, "privileged": 1062, "required": 1063, "scores": 1064, "between": 1065, "moderate": 1066, "cause": 1067, "denial": 1068, "service": 1069, "partial": 1070, "disruption": 1071, "do": 1072, "breach": 1073, "rating": 1074, "low": 1075, "minor": 1076, "informational": 1077, "logging": 1078, "errors": 1079, "non": 1080, "exploitable": 1081, "weaknesses": 1082, "local": 1083, "privilege": 1084, "negligible": 1085, "side": 1086, "collisions": 1087, "often": 1088, "less": 1089, "than": 1090, "prenotification": 1091, "certain": 1092, "prenotify": 1093, "vendors": 1094, "ship": 1095, "purpose": 1096, "coordinated": 1097, "notification": 1098, "adding": 1099, "contacts": 1100, "advisory": 1101, "few": 1102, "added": 1103, "group": 1104, "send": 1105, "copying": 1106, "vendor": 1107, "analyzed": 1108, "case": 1109, "withdraw": 1110, "receiving": 1111, "prenotifications": 1112, "membership": 1113, "refinements": 1114, "who": 1115, "included": 1116, "fill": 1117, "description": 1118, "ensuring": 1119, "checklist": 1120, "items": 1121, "bottom": 1122, "been": 1123, "result": 1124, "update": 1125, "essential": 1126, "elements": 1127, "effective": 1128, "fix": 1129, "link": 1130, "existing": 1131, "resolve": 1132, "command": 1133, "pasting": 1134, "necessary": 1135, "updating": 1136, "submitting": 1137, "read": 1138, "anything": 1139, "line": 1140, "removed": 1141, "hide": 1142, "navigation": 1143, "toc": 1144, "figure": 1145, "markdown": 1146, "span": 1147, "class": 1148, "60": 1149, "style": 1150, "strong": 1151, "script": 1152, "async": 1153, "defer": 1154, "buttons": 1155, "io": 1156, "js": 1157, "button": 1158, "show": 1159, "count": 1160, "true": 1161, "aria": 1162, "label": 1163, "star": 1164, "subscription": 1165, "icon": 1166, "octicon": 1167, "eye": 1168, "watch": 1169, "fork": 1170, "forked": 1171, "depends": 1172, "type": 1173, "looking": 1174, "recommend": 1175, "starting": 1176, "applications": 1177, "roadmap": 1178, "gaudi": 1179, "accelerators": 1180, "power": 1181, "trainium": 1182, "inferentia": 1183, "announcing": 1184, "intro": 1185, "sosp": 1186, "23x": 1187, "while": 1188, "reducing": 1189, "p50": 1190, "latency": 1191, "cade": 1192, "daniel": 1193, "et": 1194, "al": 1195, "meetups": 1196, "resolver": 1197, "plugins": 1198, "directory": 1199, "general": 1200, "dynamically": 1201, "discovering": 1202, "loading": 1203, "adapters": 1204, "loraresolver": 1205, "plugin": 1206, "framework": 1207, "vllm_allow_runtime_lora_updating": 1208, "must": 1209, "vllm_plugins": 1210, "desired": 1211, "lora_filesystem_resolver": 1212, "installed": 1213, "default": 1214, "vllm_plugin_lora_cache_dir": 1215, "receives": 1216, "adapter": 1217, "foobar": 1218, "doesn": 1219, "currently": 1220, "recognize": 1221, "look": 1222, "subdirectory": 1223, "containing": 1224, "exists": 1225, "load": 1226, "normal": 1227, "kv": 1228, "cache": 1229, "transfer": 1230, "folder": 1231, "implements": 1232, "across": 1233, "usecase": 1234, "disaggregated": 1235, "prefilling": 1236, "abstractions": 1237, "three": 1238, "layer": 1239, "pipe": 1240, "fifo": 1241, "torch": 1242, "transmission": 1243, "apis": 1244, "send_tensor": 1245, "recv_tensor": 1246, "lookup": 1247, "buffer": 1248, "caches": 1249, "tokens": 1250, "hidden": 1251, "states": 1252, "insert": 1253, "drop_select": 1254, "sql": 1255, "semantics": 1256, "connector": 1257, "connects": 1258, "send_kv_caches_and_hidden_states": 1259, "recv_kv_caches_and_hidden_states": 1260, "itself": 1261, "enough": 1262, "worker": 1263, "different": 1264, "compared": 1265, "decode": 1266, "say": 1267, "qps": 1268, "really": 1269, "handle": 1270, "naturally": 1271, "handled": 1272, "so": 1273, "provide": 1274, "help": 1275, "translate": 1276, "bypassible": 1277, "skip": 1278, "already": 1279, "redis": 1280, "rdma": 1281, "database": 1282, "want": 1283, "adjust": 1284, "flow": 1285, "receive": 1286, "bypass": 1287, "directly": 1288, "implement": 1289, "bear": 1290, "mind": 1291, "input": 1292, "constantly": 1293, "changing": 1294, "implementation": 1295, "likely": 1296, "broken": 1297, "updates": 1298, "online_serving": 1299, "disaggregated_prefill": 1300, "sh": 1301, "diagram": 1302, "disagg_prefill_workflow": 1303, "jpg": 1304, "cluster": 1305, "described": 1306, "http": 1307, "2412": 1308, "19437": 1309, "way": 1310, "deploy": 1311, "sparse": 1312, "moe": 1313, "many": 1314, "experts": 1315, "however": 1316, "requires": 1317, "components": 1318, "beyond": 1319, "python": 1320, "package": 1321, "driver": 1322, "impossible": 1323, "bundle": 1324, "break": 1325, "down": 1326, "requirements": 1327, "steps": 1328, "libraries": 1329, "pplx": 1330, "ppl": 1331, "deepep": 1332, "dependencies": 1333, "nvshmem": 1334, "enable": 1335, "ibgda": 1336, "root": 1337, "done": 1338, "host": 1339, "machine": 1340, "scripts": 1341, "accept": 1342, "positional": 1343, "argument": 1344, "workspace": 1345, "path": 1346, "staging": 1347, "defaulting": 1348, "pwd": 1349, "ep_kernels_workspace": 1350, "hopper": 1351, "torch_cuda_arch_list": 1352, "install_python_libraries": 1353, "blackwell": 1354, "additional": 1355, "sudo": 1356, "configure_system_drivers": 1357, "reboot": 1358, "gputrc2graph": 1359, "py": 1360, "processes": 1361, "nsight": 1362, "nsys": 1363, "trace": 1364, "files": 1365, "rep": 1366, "tracing": 1367, "enabled": 1368, "generates": 1369, "kernel": 1370, "summaries": 1371, "visualizations": 1372, "useful": 1373, "profiling": 1374, "analyzing": 1375, "profile": 1376, "output": 1377, "arguments": 1378, "in_file": 1379, "metadata": 1380, "entry": 1381, "should": 1382, "engine": 1383, "elapsed_nonprofiled_sec": 1384, "name": 1385, "gpt": 1386, "oss": 1387, "ds": 1388, "wall": 1389, "clock": 1390, "runtime": 1391, "seconds": 1392, "specify": 1393, "elapsed": 1394, "inflate": 1395, "actual": 1396, "entries": 1397, "provided": 1398, "separated": 1399, "out_dir": 1400, "generated": 1401, "csv": 1402, "saved": 1403, "chart": 1404, "visualization": 1405, "nsys_cmd": 1406, "assumes": 1407, "sure": 1408, "pandas": 1409, "engines": 1410, "string": 1411, "python3": 1412, "analyze": 1413, "cycles": 1414, "collect": 1415, "config": 1416, "run1": 1417, "exec": 1418, "delay": 1419, "duration": 1420, "120b": 1421, "collecting": 1422, "profiles": 1423, "aren": 1424, "captured": 1425, "till": 1426, "come": 1427, "up": 1428, "generation": 1429, "starts": 1430, "generating": 1431, "again": 1432, "total": 1433, "calculate": 1434, "cpu": 1435, "analysis": 1436, "306": 1437, "produce": 1438, "categorizes": 1439, "names": 1440, "stacked": 1441, "bar": 1442, "shows": 1443, "mapped": 1444, "number": 1445, "due": 1446, "substages": 1447, "consist": 1448, "moe_gemm": 1449, "gemm": 1450, "biggest": 1451, "category": 1452, "148": 1453, "followed": 1454, "attn": 1455, "lets": 1456, "prioritize": 1457, "focus": 1458, "optimizations": 1459, "images": 1460, "appended": 1461, "table": 1462, "underneath": 1463, "processing": 1464, "tools": 1465, "html_tbl": 1466, "mapping": 1467, "suppose": 1468, "improving": 1469, "triton": 1470, "consumer": 1471, "74": 1472, "sec": 1473, "perhaps": 1474, "hasn": 1475, "next": 1476, "dive": 1477, "compose": 1478, "image": 1479, "triton_poi_fused__to_copy_add_addmm_cat_": 1480, "csv1": 1481, "something": 1482, "100": 1483, "run2": 1484, "102": 1485, "stack": 1486, "charts": 1487, "remain": 1488, "shown": 1489, "one": 1490, "configuration": 1491, "another": 1492, "largest": 1493, "amount": 1494, "difference": 1495, "add": 1496, "classification": 1497, "abc": 1498, "def": 1499, "classified": 1500, "engine_model": 1501, "layer_anno": 1502, "stage": 1503, "substage": 1504, "mem": 1505, "h_d_memops": 1506, "misc": 1507, "basically": 1508, "dictionary": 1509, "pairs": 1510, "keys": 1511, "regex": 1512, "values": 1513, "bins": 1514, "wishes": 1515, "last": 1516, "consisting": 1517, "operations": 1518, "leftover": 1519, "invoking": 1520, "infile": 1521, "leverages": 1522, "dictconfig": 1523, "functionality": 1524, "robust": 1525, "loggers": 1526, "offers": 1527, "two": 1528, "variables": 1529, "accommodate": 1530, "range": 1531, "simple": 1532, "inflexible": 1533, "complex": 1534, "vllm_configure_logging": 1535, "leaving": 1536, "vllm_logging_config_path": 1537, "unset": 1538, "leave": 1539, "fine": 1540, "grained": 1541, "custom": 1542, "json": 1543, "controls": 1544, "whether": 1545, "takes": 1546, "disabled": 1547, "running": 1548, "given": 1549, "logger": 1550, "configured": 1551, "error": 1552, "occur": 1553, "allows": 1554, "alternative": 1555, "instead": 1556, "schema": 1557, "customize": 1558, "nhairs": 1559, "part": 1560, "container": 1561, "log": 1562, "stdout": 1563, "console": 1564, "info": 1565, "begin": 1566, "create": 1567, "logging_config": 1568, "formatters": 1569, "pythonjsonlogger": 1570, "jsonlogger": 1571, "jsonformatter": 1572, "handlers": 1573, "streamhandler": 1574, "formatter": 1575, "stream": 1576, "ext": 1577, "sys": 1578, "propagate": 1579, "false": 1580, "finally": 1581, "variable": 1582, "mistralai": 1583, "7b": 1584, "max": 1585, "len": 1586, "2048": 1587, "silence": 1588, "particular": 1589, "target": 1590, "configures": 1591, "won": 1592, "its": 1593, "messages": 1594, "overrides": 1595, "logging_utils": 1596, "newlineformatter": 1597, "datefmt": 1598, "levelname": 1599, "asctime": 1600, "filename": 1601, "lineno": 1602, "message": 1603, "debug": 1604, "example_noisy_logger": 1605, "prevent": 1606, "configuring": 1607, "turn": 1608, "silences": 1609, "lmcache": 1610, "demonstrates": 1611, "offloading": 1612, "nixl": 1613, "prerequisites": 1614, "simply": 1615, "dynamo": 1616, "least": 1617, "valid": 1618, "token": 1619, "hf_token": 1620, "8b": 1621, "instruct": 1622, "cd": 1623, "disagg_prefill_lmcache_v1": 1624, "disagg_example_nixl": 1625, "disagg_vllm_launcher": 1626, "launches": 1627, "servers": 1628, "proxy": 1629, "disagg_proxy_server": 1630, "fastapi": 1631, "coordinates": 1632, "prefiller": 1633, "decoder": 1634, "configs": 1635, "yaml": 1636, "several": 1637, "logs": 1638, "offload": 1639, "cpu_offload_lmcache": 1640, "kv_cache_sharing_lmcache_v1": 1641, "share": 1642, "disaggregated_prefill_lmcache_v0": 1643, "provides": 1644, "helm": 1645, "deploying": 1646, "application": 1647, "autoscaling": 1648, "resource": 1649, "defines": 1650, "maintainers": 1651, "ct": 1652, "lintconf": 1653, "linting": 1654, "rules": 1655, "validating": 1656, "templates": 1657, "_helpers": 1658, "tpl": 1659, "helper": 1660, "defining": 1661, "configmap": 1662, "template": 1663, "creating": 1664, "configmaps": 1665, "objects": 1666, "kubernetes": 1667, "deployments": 1668, "hpa": 1669, "horizontal": 1670, "pod": 1671, "autoscaler": 1672, "job": 1673, "jobs": 1674, "poddisruptionbudget": 1675, "budget": 1676, "pvc": 1677, "persistent": 1678, "volume": 1679, "claims": 1680, "secrets": 1681, "services": 1682, "demonstrate": 1683, "disagg_proxy_demo": 1684, "xpyd": 1685, "kv_events": 1686, "long": 1687, "exceeds": 1688, "maximum": 1689, "context": 1690, "length": 1691, "quick": 1692, "basic": 1693, "very": 1694, "texts": 1695, "3m": 1696, "model_name": 1697, "jinaai": 1698, "jina": 1699, "embeddings": 1700, "max_embed_len": 1701, "1048576": 1702, "extremely": 1703, "documents": 1704, "intfloat": 1705, "multilingual": 1706, "3072000": 1707, "comprehensive": 1708, "client": 1709, "startup": 1710, "parameters": 1711, "override": 1712, "pooler": 1713, "pooling_type": 1714, "auto": 1715, "normalize": 1716, "enable_chunked_processing": 1717, "sets": 1718, "own": 1719, "pooling": 1720, "strategy": 1721, "chunk": 1722, "cross": 1723, "aggregation": 1724, "automatically": 1725, "mean": 1726, "native": 1727, "combination": 1728, "component": 1729, "chunks": 1730, "always": 1731, "weighted": 1732, "averaging": 1733, "counts": 1734, "optimal": 1735, "processed": 1736, "semantic": 1737, "port": 1738, "31090": 1739, "gpu_count": 1740, "cls": 1741, "affects": 1742, "api_key": 1743, "empty": 1744, "authentication": 1745, "works": 1746, "inputs": 1747, "longer": 1748, "max_model_len": 1749, "smart": 1750, "chunking": 1751, "split": 1752, "max_position_embeddings": 1753, "maintain": 1754, "unified": 1755, "separately": 1756, "combined": 1757, "dimensionality": 1758, "standard": 1759, "handling": 1760, "accepted": 1761, "rejected": 1762, "vllm_allow_long_max_model_len": 1763, "extreme": 1764, "academic": 1765, "papers": 1766, "references": 1767, "legal": 1768, "contracts": 1769, "books": 1770, "entire": 1771, "chapters": 1772, "small": 1773, "repositories": 1774, "codebases": 1775, "aspect": 1776, "minimal": 1777, "proportional": 1778, "scalable": 1779, "quality": 1780, "short": 1781, "baseline": 1782, "medium": 1783, "document": 1784, "100k": 1785, "batch": 1786, "mixed": 1787, "consistency": 1788, "reproducible": 1789, "runs": 1790, "troubleshooting": 1791, "valueerror": 1792, "position": 1793, "4096": 1794, "solution": 1795, "increase": 1796, "reduce": 1797, "runtimeerror": 1798, "adjusting": 1799, "fewer": 1800, "slow": 1801, "expected": 1802, "calls": 1803, "activity": 1804, "150000": 1805, "37": 1806, "max_chunk_size": 1807, "extend": 1808, "architecture": 1809, "lengths": 1810, "validate": 1811, "submit": 1812, "parameter": 1813, "simplified": 1814, "millions": 1815, "better": 1816, "exceed": 1817, "limits": 1818, "backward": 1819, "continue": 1820, "opentelemetry": 1821, "poc": 1822, "packages": 1823, "sdk": 1824, "26": 1825, "exporter": 1826, "otlp": 1827, "conventions": 1828, "jaeger": 1829, "docker": 1830, "jaegertracing": 1831, "57": 1832, "rm": 1833, "collector_zipkin_host_port": 1834, "9411": 1835, "6831": 1836, "udp": 1837, "6832": 1838, "5778": 1839, "16686": 1840, "4317": 1841, "4318": 1842, "14250": 1843, "14268": 1844, "14269": 1845, "shell": 1846, "export": 1847, "ip": 1848, "jaeger_ip": 1849, "inspect": 1850, "networksettings": 1851, "ipaddress": 1852, "otel_exporter_otlp_traces_endpoint": 1853, "grpc": 1854, "insecure": 1855, "connections": 1856, "otel_service_name": 1857, "otel_exporter_otlp_traces_insecure": 1858, "facebook": 1859, "opt": 1860, "125m": 1861, "traces": 1862, "endpoint": 1863, "dummy": 1864, "dummy_client": 1865, "webui": 1866, "localhost": 1867, "pane": 1868, "select": 1869, "hit": 1870, "imgur": 1871, "gyhhfjo": 1872, "clicking": 1873, "spans": 1874, "tags": 1875, "demo": 1876, "prompt": 1877, "opf6cbl": 1878, "protocol": 1879, "protobuf": 1880, "transport": 1881, "otel_exporter_otlp_traces_protocol": 1882, "follows": 1883, "instrumentation": 1884, "automatic": 1885, "instrument": 1886, "hywvooj": 1887, "prometheus": 1888, "grafana": 1889, "connect": 1890, "metric": 1891, "launch": 1892, "checkout": 1893, "methods": 1894, "websites": 1895, "linux": 1896, "entrypoint": 1897, "sample": 1898, "wget": 1899, "co": 1900, "datasets": 1901, "anon8231489123": 1902, "sharegpt_vicuna_unfiltered": 1903, "sharegpt_v3_unfiltered_cleaned_split": 1904, "bench": 1905, "tokenizer": 1906, "completions": 1907, "dataset": 1908, "sharegpt": 1909, "rate": 1910, "navigating": 1911, "8000": 1912, "metrics": 1913, "exposed": 1914, "3000": 1915, "username": 1916, "admin": 1917, "password": 1918, "datasources": 1919, "page": 1920, "url": 1921, "connection": 1922, "separate": 1923, "containers": 1924, "creates": 1925, "dns": 1926, "9090": 1927, "click": 1928, "save": 1929, "green": 1930, "saying": 1931, "successfully": 1932, "queried": 1933, "import": 1934, "upload": 1935, "datasource": 1936, "screen": 1937, "looks": 1938, "r2vh9vw": 1939, "structured": 1940, "capabilities": 1941, "constraint": 1942, "responses": 1943, "concurrent": 1944, "choice": 1945, "qwen": 1946, "qwen2": 1947, "3b": 1948, "reasoning": 1949, "r1": 1950, "distill": 1951, "parser": 1952, "deepseek_r1": 1953, "standalone": 1954, "uv": 1955, "uvx": 1956, "git": 1957, "structured_outputs": 1958, "tip": 1959, "remotely": 1960, "openai_base_url": 1961, "remote_url": 1962, "constraints": 1963, "structural_tag": 1964, "primary": 1965, "interface": 1966, "doing": 1967, "interacting": 1968, "offline_inference": 1969, "rest": 1970, "argparse": 1971, "pass": 1972, "try": 1973, "classify": 1974, "embed": 1975, "score": 1976, "generate": 1977, "inference_params": 1978, "max_tokens": 1979, "temperature": 1980, "top_p": 1981, "top_k": 1982, "passing": 1983, "experiment": 1984, "specifies": 1985, "loaded": 1986, "calling": 1987, "get_default_sampling_params": 1988, "max_new_tokens": 1989, "wide": 1990, "limit": 1991, "gguf": 1992, "quantized": 1993, "downloading": 1994, "huggingface_hub": 1995, "hf_hub_download": 1996, "repo_id": 1997, "bartowski": 1998, "phi": 1999, "4k": 2000, "iq2_m": 2001, "print": 2002, "printed": 2003, "above": 2004, "microsoft": 2005, "gb": 2006, "seen": 2007, "virtual": 2008, "24": 2009, "virtually": 2010, "think": 2011, "34": 2012, "13b": 2013, "bf16": 2014, "weight": 2015, "26gb": 2016, "interconnect": 2017, "fly": 2018, "forward": 2019, "hf": 2020, "prefill_example": 2021, "decode_example": 2022, "sequentially": 2023, "performs": 2024, "saving": 2025, "local_storage": 2026, "prompts": 2027, "txt": 2028, "important": 2029, "performing": 2030, "consists": 2031, "lines": 2032, "openai_batch": 2033, "openai_example_batch": 2034, "jsonl": 2035, "represents": 2036, "reference": 2037, "platform": 2038, "requestinput": 2039, "endpoints": 2040, "coming": 2041, "soon": 2042, "pre": 2043, "requisites": 2044, "hub": 2045, "cli": 2046, "login": 2047, "gated": 2048, "visiting": 2049, "card": 2050, "agreeing": 2051, "along": 2052, "download": 2053, "working": 2054, "ve": 2055, "cat": 2056, "custom_id": 2057, "method": 2058, "role": 2059, "content": 2060, "helpful": 2061, "assistant": 2062, "hello": 2063, "world": 2064, "max_completion_tokens": 2065, "1000": 2066, "unhelpful": 2067, "tool": 2068, "designed": 2069, "called": 2070, "entrypoints": 2071, "run_batch": 2072, "383d1c59835645aeb2e07d004d62a826": 2073, "cmpl": 2074, "61c020e54b964d5a98fa7527bfcdd378": 2075, "object": 2076, "completion": 2077, "1715633336": 2078, "choices": 2079, "great": 2080, "meet": 2081, "tasks": 2082, "today": 2083, "logprobs": 2084, "null": 2085, "finish_reason": 2086, "stop": 2087, "stop_reason": 2088, "prompt_tokens": 2089, "25": 2090, "total_tokens": 2091, "56": 2092, "completion_tokens": 2093, "31": 2094, "42e3d09b14b04568afa3f1797751a267": 2095, "f44d049f6b3a42d4b2d7850bb1e31bcc": 2096, "32": 2097, "runner": 2098, "urls": 2099, "accessible": 2100, "located": 2101, "integrating": 2102, "s3": 2103, "integrate": 2104, "storage": 2105, "presigned": 2106, "bucket": 2107, "amazon": 2108, "amazons3": 2109, "userguide": 2110, "awscli": 2111, "credentials": 2112, "interactively": 2113, "boto3": 2114, "cp": 2115, "my_bucket": 2116, "my_input_file": 2117, "replace": 2118, "my_output_file": 2119, "placeholders": 2120, "awsdocs": 2121, "doc": 2122, "example_code": 2123, "s3_basics": 2124, "presigned_url": 2125, "botocore": 2126, "exceptions": 2127, "clienterror": 2128, "generate_presigned_url": 2129, "s3_client": 2130, "client_method": 2131, "method_parameters": 2132, "expires_in": 2133, "param": 2134, "return": 2135, "clientmethod": 2136, "params": 2137, "expiresin": 2138, "except": 2139, "raise": 2140, "input_url": 2141, "get_object": 2142, "3600": 2143, "output_url": 2144, "put_object": 2145, "west": 2146, "amazonaws": 2147, "awsaccesskeyid": 2148, "abcdefghijklmnopqrst": 2149, "signature": 2150, "abcdefghijklmnopqrstuvwxyz12345": 2151, "expires": 2152, "1715800091": 2153, "section": 2154, "terminal": 2155, "even": 2156, "mix": 2157, "earlier": 2158, "db0f71f7dec244e6bce530e0b4ef908b": 2159, "status_code": 2160, "200": 2161, "request_id": 2162, "3580bf4d4ae54d52b67eee266a6eab20": 2163, "embd": 2164, "33ac2efa7996430184461f2e38529746": 2165, "444647": 2166, "016204833984375": 2167, "0092010498046875": 2168, "0018358230590820312": 2169, "0028228759765625": 2170, "001422882080078125": 2171, "0031147003173828125": 2172, "baai": 2173, "bge": 2174, "reranker": 2175, "m3": 2176, "text_1": 2177, "france": 2178, "text_2": 2179, "brazil": 2180, "brasilia": 2181, "paris": 2182, "f87c5c4539184f618e555744a2965987": 2183, "806ab64512e44071b37d3f7ccd291413": 2184, "4ee45236897b4d29907d49b01298cdb1": 2185, "1737847944": 2186, "0010900497436523438": 2187, "prompt_tokens_details": 2188, "41990c51a26d4fac8419077f12871099": 2189, "73ce66379026482699f81974e14e1e99": 2190, "13f2ffe6ba40460fbf9f7f00ad667d75": 2191, "001094818115234375": 2192, "shapes": 2193, "assume": 2194, "tested": 2195, "v6e": 2196, "according": 2197, "google_tpu": 2198, "warmups": 2199, "enforce": 2200, "eager": 2201, "okay": 2202, "1024": 2203, "attempt": 2204, "xla_hlo_debug": 2205, "vllm_tpu_profile_duration_ms": 2206, "vllm_tpu_profile_delay_ms": 2207, "dir": 2208, "70b": 2209, "128": 2210, "decodes": 2211, "having": 2212, "hopefully": 2213, "2000": 2214, "rf": 2215, "xla_cache": 2216, "visualizing": 2217, "collected": 2218, "visualize": 2219, "tensorboard": 2220, "xla": 2221, "vm": 2222, "tensorflow": 2223, "etils": 2224, "importlib_resources": 2225, "point": 2226, "6006": 2227, "browser": 2228, "logdir": 2229, "omni": 2230, "thinker": 2231, "audio": 2232, "video": 2233, "qwen2_5_omni": 2234, "only_thinker": 2235, "mixed_modalities": 2236, "vision": 2237, "interleaved": 2238, "modalities": 2239, "yet": 2240, "vllm_use_v1": 2241, "use_audio_in_video": 2242, "audios": 2243, "multi_audios": 2244, "modality": 2245, "audio_language": 2246, "vision_language": 2247, "modelconfig": 2248, "cacheconfig": 2249, "loadconfig": 2250, "parallelconfig": 2251, "schedulerconfig": 2252, "deviceconfig": 2253, "speculativeconfig": 2254, "loraconfig": 2255, "multimodalconfig": 2256, "poolerconfig": 2257, "decodingconfig": 2258, "observabilityconfig": 2259, "kvtransferconfig": 2260, "compilationconfig": 2261, "vllmconfig": 2262, "prompttype": 2263, "textprompt": 2264, "tokensprompt": 2265, "llmengine": 2266, "asyncllmengine": 2267, "samplingparams": 2268, "poolingparams": 2269, "experimental": 2270, "passed": 2271, "alongside": 2272, "mm": 2273, "multi_modal_data": 2274, "field": 2275, "instructions": 2276, "listed": 2277, "multimodal_registry": 2278, "facing": 2279, "multimodaldatadict": 2280, "internal": 2281, "structures": 2282, "placeholderrange": 2283, "nestedtensors": 2284, "multimodalfieldelem": 2285, "multimodalfieldconfig": 2286, "multimodalkwargsitem": 2287, "multimodalkwargs": 2288, "multimodalinputs": 2289, "parsing": 2290, "parse": 2291, "registry": 2292, "model_executor": 2293, "interfaces_base": 2294, "interfaces": 2295, "manage": 2296, "viewing": 2297, "commands": 2298, "env": 2299, "8100": 2300, "over": 2301, "unix": 2302, "domain": 2303, "socket": 2304, "uds": 2305, "tmp": 2306, "sock": 2307, "options": 2308, "groups": 2309, "listgroup": 2310, "num": 2311, "seqs": 2312, "keyword": 2313, "pager": 2314, "hi": 2315, "tests": 2316, "extra": 2317, "1b": 2318, "random": 2319, "detailed": 2320, "subcommand": 2321, "equivalent": 2322, "arg": 2323, "key1": 2324, "value1": 2325, "key2": 2326, "key3": 2327, "value2": 2328, "additionally": 2329, "individually": 2330, "key4": 2331, "value3": 2332, "value4": 2333, "value5": 2334, "json_tip": 2335, "inc": 2336, "readme": 2337, "regular": 2338, "francisco": 2339, "bay": 2340, "area": 2341, "months": 2342, "guest": 2343, "speakers": 2344, "insights": 2345, "materials": 2346, "august": 2347, "2nd": 2348, "7th": 2349, "3rd": 2350, "march": 2351, "27th": 2352, "16th": 2353, "11th": 2354, "february": 2355, "january": 2356, "22nd": 2357, "november": 2358, "14th": 2359, "september": 2360, "9th": 2361, "july": 2362, "24th": 2363, "june": 2364, "31st": 2365, "youtu": 2366, "y0c": 2367, "duvenzq": 2368, "compile": 2369, "m0dmtfli": 2370, "dg": 2371, "october": 2372, "5th": 2373, "potentially": 2374, "locations": 2375, "interested": 2376, "speaking": 2377, "sponsoring": 2378, "levels": 2379, "highest": 2380, "priority": 2381, "lowest": 2382, "engine_args": 2383, "env_vars": 2384, "conserving": 2385, "might": 2386, "oom": 2387, "alleviate": 2388, "problem": 2389, "tp": 2390, "tensor_parallel_size": 2391, "option": 2392, "splits": 2393, "granite": 2394, "initializes": 2395, "correctly": 2396, "avoid": 2397, "related": 2398, "functions": 2399, "set_device": 2400, "initializing": 2401, "cannot": 2402, "re": 2403, "initialize": 2404, "subprocess": 2405, "devices": 2406, "cuda_visible_devices": 2407, "whole": 2408, "makes": 2409, "disk": 2410, "reading": 2411, "convert": 2412, "checkpoint": 2413, "sharded": 2414, "gh": 2415, "save_sharded_state": 2416, "conversion": 2417, "later": 2418, "much": 2419, "faster": 2420, "constant": 2421, "cost": 2422, "lower": 2423, "precision": 2424, "statically": 2425, "downloaded": 2426, "ones": 2427, "red": 2428, "hat": 2429, "redhatai": 2430, "dynamic": 2431, "further": 2432, "limiting": 2433, "max_num_seqs": 2434, "adept": 2435, "fuyu": 2436, "graphs": 2437, "optimize": 2438, "capture": 2439, "compilation_config": 2440, "achieve": 2441, "balance": 2442, "speed": 2443, "compilationlevel": 2444, "piecewise": 2445, "goes": 2446, "cudagraph_capture_sizes": 2447, "capturing": 2448, "completely": 2449, "enforce_eager": 2450, "flag": 2451, "ram": 2452, "processor": 2453, "mm_processor_cache_gb": 2454, "gib": 2455, "per": 2456, "core": 2457, "backend": 2458, "vllm_cpu_kvcache_space": 2459, "smaller": 2460, "footprint": 2461, "vl": 2462, "limit_mm_per_prompt": 2463, "go": 2464, "unused": 2465, "accepts": 2466, "allocate": 2467, "videos": 2468, "don": 2469, "gemma": 2470, "27b": 2471, "saves": 2472, "mm_processor_kwargs": 2473, "max_pixels": 2474, "768": 2475, "1280": 2476, "28": 2477, "internvl": 2478, "opengvlab": 2479, "internvl2": 2480, "2b": 2481, "max_dynamic_patch": 2482, "toc_depth": 2483, "openai_compatible_server": 2484, "engineargs": 2485, "arg_utils": 2486, "asyncengineargs": 2487, "defined": 2488, "therefore": 2489, "truth": 2490, "types": 2491, "docstrings": 2492, "async_engine_args": 2493, "vllm_port": 2494, "vllm_host_ip": 2495, "prefixed": 2496, "vllm_": 2497, "care": 2498, "taken": 2499, "conflict": 2500, "because": 2501, "capitalized": 2502, "concepts": 2503, "networking": 2504, "envs": 2505, "vars": 2506, "definition": 2507, "resolution": 2508, "loads": 2509, "inspecting": 2510, "architectures": 2511, "finding": 2512, "registered": 2513, "nevertheless": 2514, "fail": 2515, "lacks": 2516, "unofficial": 2517, "recorded": 2518, "ambiguity": 2519, "explicitly": 2520, "hf_overrides": 2521, "cerebras": 2522, "gpt2lmheadmodel": 2523, "recognized": 2524, "optimization": 2525, "tuning": 2526, "covers": 2527, "strategies": 2528, "consult": 2529, "conserving_memory": 2530, "conserve": 2531, "preemption": 2532, "regressive": 2533, "times": 2534, "space": 2535, "insufficient": 2536, "batched": 2537, "preempt": 2538, "preempted": 2539, "recomputed": 2540, "becomes": 2541, "occurs": 2542, "00": 2543, "49": 2544, "33": 2545, "scheduler": 2546, "1057": 2547, "sequence": 2548, "preemptionmode": 2549, "recompute": 2550, "mode": 2551, "gpu_memory_utilization": 2552, "total_cumulative_preemption_cnt": 2553, "mechanism": 2554, "ensures": 2555, "robustness": 2556, "recomputation": 2557, "adversely": 2558, "frequently": 2559, "encounter": 2560, "preemptions": 2561, "consider": 2562, "allocates": 2563, "percentage": 2564, "increasing": 2565, "utilization": 2566, "decrease": 2567, "max_num_batched_tokens": 2568, "reduces": 2569, "thereby": 2570, "requiring": 2571, "shards": 2572, "weights": 2573, "allowing": 2574, "excessive": 2575, "synchronization": 2576, "pipeline_parallel_size": 2577, "distributes": 2578, "layers": 2579, "indirectly": 2580, "penalties": 2581, "cumulative": 2582, "disable_log_stats": 2583, "rather": 2584, "swap": 2585, "prefills": 2586, "together": 2587, "helps": 2588, "improve": 2589, "balancing": 2590, "bound": 2591, "conditionally": 2592, "scheduling": 2593, "prioritizes": 2594, "batches": 2595, "pending": 2596, "schedules": 2597, "fit": 2598, "benefits": 2599, "improves": 2600, "itl": 2601, "prioritized": 2602, "locating": 2603, "tune": 2604, "inter": 2605, "slowing": 2606, "higher": 2607, "ttft": 2608, "8096": 2609, "especially": 2610, "almost": 2611, "still": 2612, "16384": 2613, "pdf": 2614, "2401": 2615, "08671": 2616, "2308": 2617, "16369": 2618, "too": 2619, "pressure": 2620, "pp": 2621, "parts": 2622, "maxed": 2623, "distribute": 2624, "nodes": 2625, "deep": 2626, "narrow": 2627, "distribution": 2628, "sharding": 2629, "combine": 2630, "ep": 2631, "specialized": 2632, "networks": 2633, "specifically": 2634, "deepseekv3": 2635, "qwen3moe": 2636, "computation": 2637, "enable_expert_parallel": 2638, "degree": 2639, "dp": 2640, "replicates": 2641, "environments": 2642, "isolation": 2643, "beneficial": 2644, "data_parallel_size": 2645, "product": 2646, "data_parallel_deployment": 2647, "inside": 2648, "bottleneck": 2649, "excess": 2650, "capacity": 2651, "correspondance": 2652, "repeatedly": 2653, "autoprocessor": 2654, "commonly": 2655, "conversations": 2656, "benefit": 2657, "larger": 2658, "outlined": 2659, "serve_args": 2660, "127": 2661, "6379": 2662, "uvicorn": 2663, "supplied": 2664, "simultaneously": 2665, "precedence": 2666, "priorities": 2667, "some_model": 2668, "tips": 2669, "serves": 2670, "collection": 2671, "handy": 2672, "optimizing": 2673, "workload": 2674, "sizing": 2675, "selecting": 2676, "ideal": 2677, "chips": 2678, "instance": 2679, "average": 2680, "adequate": 2681, "hbm": 2682, "colab": 2683, "calculator": 2684, "ericehanley": 2685, "rightsize": 2686, "hbm_calculator": 2687, "ipynb": 2688, "tell": 2689, "requirement": 2690, "consumed": 2691, "allocated": 2692, "approximately": 2693, "rule": 2694, "thumb": 2695, "tradeoff": 2696, "rightsizing": 2697, "decreasing": 2698, "effectively": 2699, "maximize": 2700, "increases": 2701, "carefully": 2702, "crucial": 2703, "achieving": 2704, "adjusted": 2705, "compilation": 2706, "background": 2707, "differences": 2708, "ll": 2709, "notice": 2710, "tpus": 2711, "initial": 2712, "asics": 2713, "executing": 2714, "compiled": 2715, "static": 2716, "compiler": 2717, "unlike": 2718, "flexibly": 2719, "shape": 2720, "warmup": 2721, "phase": 2722, "compiles": 2723, "anywhere": 2724, "minutes": 2725, "hour": 2726, "depending": 2727, "although": 2728, "subsequent": 2729, "eliminating": 2730, "vllm_xla_cache_path": 2731, "shareable": 2732, "deployed": 2733, "ranges": 2734, "impacted": 2735, "discussed": 2736, "factors": 2737, "influence": 2738, "things": 2739, "vllm_tpu_most_model_len": 2740, "most_model_len": 2741, "design": 2742, "shorter": 2743, "occasional": 2744, "negatively": 2745, "introducing": 2746, "specifying": 2747, "32k": 2748, "99": 2749, "2k": 2750, "32768": 2751, "subdivided": 2752, "latter": 2753, "gain": 2754, "padding": 2755, "switching": 2756, "vllm_tpu_bucket_padding_gap": 2757, "layout": 2758, "increments": 2759, "256": 2760, "etc": 2761, "pads": 2762, "fixed": 2763, "sending": 2764, "recompilation": 2765, "efficiencies": 2766, "pad": 2767, "exponential": 2768, "nearest": 2769, "linearly": 2770, "buckets": 2771, "increment": 2772, "512": 2773, "padding_gap": 2774, "64": 2775, "192": 2776, "320": 2777, "384": 2778, "448": 2779, "unnecessary": 2780, "num_tokens": 2781, "300": 2782, "bucket_padding": 2783, "careful": 2784, "choose": 2785, "gap": 2786, "means": 2787, "leading": 2788, "increased": 2789, "precompile": 2790, "store": 2791, "compilaed": 2792, "conversely": 2793, "overly": 2794, "yields": 2795, "improvement": 2796, "possible": 2797, "matches": 2798, "chip": 2799, "acceleration": 2800, "v5e": 2801, "mxu": 2802, "formats": 2803, "w8a8": 2804, "w8a16": 2805, "wip": 2806, "fp4": 2807, "w4a8": 2808, "parallelization": 2809, "fragment": 2810, "workloads": 2811, "strongly": 2812, "tuner": 2813, "auto_tune": 2814, "topics": 2815, "cover": 2816, "interpreting": 2817, "challenging": 2818, "expand": 2819, "guidance": 2820, "meantime": 2821, "profiling_tpu": 2822, "valuable": 2823, "spmd": 2824, "isn": 2825, "love": 2826, "hear": 2827, "interest": 2828, "kinds": 2829, "matter": 2830, "identify": 2831, "bugs": 2832, "suggest": 2833, "believe": 2834, "thus": 2835, "answering": 2836, "queries": 2837, "offering": 2838, "reviews": 2839, "assisting": 2840, "highly": 2841, "regarded": 2842, "impactful": 2843, "raising": 2844, "awareness": 2845, "posts": 2846, "highlight": 2847, "driving": 2848, "incredible": 2849, "projects": 2850, "appreciation": 2851, "starring": 2852, "board": 2853, "unsure": 2854, "links": 2855, "good": 2856, "3aissue": 2857, "20state": 2858, "3aopen": 2859, "20label": 2860, "3a": 2861, "22good": 2862, "20first": 2863, "20issue": 2864, "selected": 2865, "onboarding": 2866, "22new": 2867, "license": 2868, "developing": 2869, "python_env_setup": 2870, 