{"contributing": 0, "vllm": 1, "you": 2, "may": 3, "find": 4, "information": 5, "about": 6, "docs": 7, "ai": 8, "https": 9, "en": 10, "latest": 11, "markdownlint": 12, "disable": 13, "md001": 14, "md041": 15, "align": 16, "center": 17, "picture": 18, "source": 19, "media": 20, "prefers": 21, "color": 22, "scheme": 23, "dark": 24, "srcset": 25, "raw": 26, "githubusercontent": 27, "com": 28, "project": 29, "main": 30, "assets": 31, "logos": 32, "logo": 33, "text": 34, "png": 35, "img": 36, "alt": 37, "src": 38, "light": 39, "width": 40, "55": 41, "h3": 42, "easy": 43, "fast": 44, "cheap": 45, "llm": 46, "serving": 47, "everyone": 48, "href": 49, "documentation": 50, "blog": 51, "arxiv": 52, "org": 53, "abs": 54, "2309": 55, "06180": 56, "paper": 57, "vllm_project": 58, "twitter": 59, "discuss": 60, "user": 61, "forum": 62, "slack": 63, "developer": 64, "news": 65, "2025": 66, "08": 67, "we": 68, "hosted": 69, "beijing": 70, "meetup": 71, "mp": 72, "weixin": 73, "qq": 74, "dgkwg1wfpwgo2jcdtqqhxa": 75, "focusing": 76, "large": 77, "scale": 78, "deployment": 79, "please": 80, "slides": 81, "here": 82, "drive": 83, "google": 84, "folders": 85, "1pid6nsflu43dzri0eatcpgxsazdvbbqf": 86, "recording": 87, "www": 88, "chaspark": 89, "live": 90, "1166916873711665152": 91, "05": 92, "nyc": 93, "lu": 94, "ma": 95, "c1rqyf1f": 96, "presentation": 97, "1_q_aw_iomjwuimf1s1ym": 98, "zhjxz8cuel0ijvaquoybea": 99, "edit": 100, "usp": 101, "sharing": 102, "now": 103, "under": 104, "pytorch": 105, "foundation": 106, "announcement": 107, "welcomes": 108, "01": 109, "excited": 110, "announce": 111, "alpha": 112, "release": 113, "v1": 114, "major": 115, "architectural": 116, "upgrade": 117, "7x": 118, "speedup": 119, "clean": 120, "code": 121, "optimized": 122, "execution": 123, "loop": 124, "zero": 125, "overhead": 126, "prefix": 127, "caching": 128, "enhanced": 129, "multimodal": 130, "support": 131, "more": 132, "check": 133, "out": 134, "our": 135, "post": 136, "27": 137, "html": 138, "details": 139, "summary": 140, "previous": 141, "04": 142, "asia": 143, "day": 144, "sginnovate": 145, "event": 146, "limited": 147, "availability": 148, "morning": 149, "evening": 150, "slots": 151, "remaining": 152, "inaugural": 153, "from": 154, "team": 155, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 156, "03": 157, "ollama": 158, "inference": 159, "night": 160, "16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u": 161, "first": 162, "china": 163, "n77gibl2coratqhtveazfg": 164, "1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq": 165, "east": 166, "coast": 167, "7mu4k4xx": 168, "1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs": 169, "slide": 170, "id": 171, "g31441846c39_0_0": 172, "02": 173, "ninth": 174, "h7g3kuj9": 175, "meta": 176, "1jzc_pzvxrvnsfvcw": 177, "v4cfxb6pn7zz2cyp_flwo05aqg": 178, "amd": 179, "file": 180, "1zk5qejiktmlq2eqcxqzlljax3m9s7nwn": 181, "view": 182, "posted": 183, "eighth": 184, "zep56hui": 185, "cloud": 186, "1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4": 187, "1h24phewanyrl11xy5dxubvrc9f9kkjix": 188, "2024": 189, "12": 190, "joins": 191, "ecosystem": 192, "11": 193, "seventh": 194, "h0qvrajz": 195, "wi": 196, "th": 197, "snowflake": 198, "1e3cxqbv3jsfgp30swyvs3em_tw": 199, "ghohj9pajgk6kr54": 200, "1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a": 201, "10": 202, "have": 203, "just": 204, "created": 205, "coordinating": 206, "contributions": 207, "discussing": 208, "features": 209, "feel": 210, "free": 211, "join": 212, "us": 213, "ray": 214, "summit": 215, "held": 216, "special": 217, "track": 218, "opening": 219, "talk": 220, "1b_kqxphbtra_mdf": 221, "tr6i8rwdou5qotznceg2mkzxehm": 222, "learn": 223, "talks": 224, "youtube": 225, "playlist": 226, "list": 227, "plztswpqnepxl6aqwifuwuimlpfrvpksjr": 228, "other": 229, "contributors": 230, "users": 231, "09": 232, "sixth": 233, "87q3nvnh": 234, "nvidia": 235, "1wrlgwytqfaotd5wcgspnhoaw3nq0e": 236, "9wqyp7ny93xrs": 237, "07": 238, "fifth": 239, "lp0gyjqr": 240, "aws": 241, "1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y": 242, "partnership": 243, "officially": 244, "supports": 245, "llama": 246, "fp8": 247, "quantization": 248, "pipeline": 249, "parallelism": 250, "23": 251, "llama31": 252, "06": 253, "fourth": 254, "agivllm": 255, "cloudflare": 256, "bentoml": 257, "1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4": 258, "third": 259, "robloxandvllmmeetup2024": 260, "splashthat": 261, "roblox": 262, "1a": 263, "47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem": 264, "second": 265, "ygxbpzhl": 266, "ibm": 267, "12mi2skabnuw5rbwxdyy": 268, "hthth4imsnceoq10jdqbxga": 269, "2023": 270, "a16z": 271, "1ql": 272, "xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s": 273, "would": 274, "like": 275, "express": 276, "sincere": 277, "gratitude": 278, "andreessen": 279, "horowitz": 280, "30": 281, "supporting": 282, "open": 283, "community": 284, "providing": 285, "generous": 286, "grant": 287, "development": 288, "research": 289, "released": 290, "fastchat": 291, "integration": 292, "has": 293, "powered": 294, "lmsys": 295, "vicuna": 296, "chatbot": 297, "arena": 298, "chat": 299, "since": 300, "mid": 301, "april": 302, "use": 303, "library": 304, "originally": 305, "developed": 306, "sky": 307, "computing": 308, "lab": 309, "cs": 310, "berkeley": 311, "edu": 312, "uc": 313, "evolved": 314, "driven": 315, "both": 316, "academia": 317, "industry": 318, "state": 319, "art": 320, "throughput": 321, "efficient": 322, "management": 323, "attention": 324, "key": 325, "value": 326, "memory": 327, "pagedattention": 328, "20": 329, "continuous": 330, "batching": 331, "incoming": 332, "requests": 333, "model": 334, "cuda": 335, "hip": 336, "graph": 337, "quantizations": 338, "gptq": 339, "2210": 340, "17323": 341, "awq": 342, "2306": 343, "00978": 344, "autoround": 345, "05516": 346, "int4": 347, "int8": 348, "kernels": 349, "including": 350, "flashattention": 351, "flashinfer": 352, "speculative": 353, "decoding": 354, "chunked": 355, "prefill": 356, "flexible": 357, "seamless": 358, "popular": 359, "hugging": 360, "face": 361, "models": 362, "high": 363, "various": 364, "algorithms": 365, "parallel": 366, "sampling": 367, "beam": 368, "search": 369, "tensor": 370, "data": 371, "expert": 372, "distributed": 373, "streaming": 374, "outputs": 375, "openai": 376, "compatible": 377, "api": 378, "server": 379, "gpus": 380, "cpus": 381, "intel": 382, "powerpc": 383, "tpu": 384, "neuron": 385, "multi": 386, "lora": 387, "seamlessly": 388, "most": 389, "huggingface": 390, "transformer": 391, "llms": 392, "mixture": 393, "mixtral": 394, "deepseek": 395, "v2": 396, "v3": 397, "embedding": 398, "e5": 399, "mistral": 400, "modal": 401, "llava": 402, "full": 403, "supported": 404, "supported_models": 405, "getting": 406, "started": 407, "install": 408, "pip": 409, "getting_started": 410, "installation": 411, "gpu": 412, "index": 413, "build": 414, "wheel": 415, "bash": 416, "visit": 417, "quickstart": 418, "welcome": 419, "any": 420, "collaborations": 421, "how": 422, "get": 423, "involved": 424, "sponsors": 425, "compute": 426, "resources": 427, "testing": 428, "following": 429, "organizations": 430, "thank": 431, "your": 432, "note": 433, "sort": 434, "them": 435, "alphabetical": 436, "order": 437, "keep": 438, "consistent": 439, "md": 440, "cash": 441, "donations": 442, "dropbox": 443, "sequoia": 444, "capital": 445, "skywork": 446, "zhenfund": 447, "alibaba": 448, "anyscale": 449, "crusoe": 450, "databricks": 451, "deepinfra": 452, "lambda": 453, "nebius": 454, "novita": 455, "replicate": 456, "runpod": 457, "trainy": 458, "san": 459, "diego": 460, "sponsor": 461, "also": 462, "official": 463, "fundraising": 464, "venue": 465, "through": 466, "opencollective": 467, "plan": 468, "fund": 469, "maintenance": 470, "adoption": 471, "citation": 472, "cite": 473, "bibtex": 474, "inproceedings": 475, "kwon2023efficient": 476, "title": 477, "language": 478, "author": 479, "woosuk": 480, "kwon": 481, "zhuohan": 482, "li": 483, "siyuan": 484, "zhuang": 485, "ying": 486, "sheng": 487, "lianmin": 488, "zheng": 489, "cody": 490, "hao": 491, "yu": 492, "joseph": 493, "gonzalez": 494, "zhang": 495, "ion": 496, "stoica": 497, "booktitle": 498, "proceedings": 499, "acm": 500, "sigops": 501, "29th": 502, "symposium": 503, "operating": 504, "systems": 505, "principles": 506, "year": 507, "contact": 508, "start": 509, "technical": 510, "questions": 511, "feature": 512, "github": 513, "issues": 514, "fellow": 515, "security": 516, "disclosures": 517, "advisories": 518, "partnerships": 519, "lists": 520, "mailto": 521, "end": 522, "kit": 523, "wish": 524, "refer": 525, "repo": 526, "releasing": 527, "releases": 528, "offer": 529, "reliable": 530, "version": 531, "base": 532, "packaged": 533, "binary": 534, "format": 535, "can": 536, "conveniently": 537, "accessed": 538, "via": 539, "pypi": 540, "serve": 541, "milestones": 542, "communicate": 543, "newly": 544, "available": 545, "improvements": 546, "upcoming": 547, "changes": 548, "could": 549, "affect": 550, "potential": 551, "breaking": 552, "versioning": 553, "uses": 554, "right": 555, "shifted": 556, "where": 557, "new": 558, "patch": 559, "every": 560, "weeks": 561, "contain": 562, "bug": 563, "fixes": 564, "opposed": 565, "semver": 566, "contains": 567, "only": 568, "backwards": 569, "when": 570, "critical": 571, "need": 572, "made": 573, "post1": 574, "_major_": 575, "milestone": 576, "incompatible": 577, "similar": 578, "_minor_": 579, "_patch_": 580, "_post1_": 581, "_patch": 582, "1_": 583, "either": 584, "explicit": 585, "implicit": 586, "cadence": 587, "bi": 588, "weekly": 589, "basis": 590, "days": 591, "after": 592, "same": 593, "branch": 594, "all": 595, "future": 596, "dates": 597, "below": 598, "tentative": 599, "optional": 600, "date": 601, "versions": 602, "jan": 603, "feb": 604, "mar": 605, "apr": 606, "jun": 607, "jul": 608, "13": 609, "aug": 610, "14": 611, "15": 612, "sep": 613, "16": 614, "17": 615, "oct": 616, "18": 617, "19": 618, "nov": 619, "21": 620, "dec": 621, "22": 622, "each": 623, "built": 624, "dedicated": 625, "cut": 626, "performed": 627, "before": 628, "previously": 629, "reused": 630, "builds": 631, "triggered": 632, "push": 633, "rc": 634, "tag": 635, "vx": 636, "rc1": 637, "enables": 638, "test": 639, "multiple": 640, "rcs": 641, "final": 642, "does": 643, "trigger": 644, "used": 645, "notes": 646, "monitor": 647, "reverts": 648, "apply": 649, "cherry": 650, "pick": 651, "criteria": 652, "approach": 653, "finalizing": 654, "clear": 655, "what": 656, "picks": 657, "allowed": 658, "process": 659, "land": 660, "pr": 661, "typically": 662, "ensure": 663, "sufficient": 664, "time": 665, "complete": 666, "thorough": 667, "round": 668, "stable": 669, "regression": 670, "address": 671, "functional": 672, "performance": 673, "against": 674, "recent": 675, "severe": 676, "issue": 677, "silent": 678, "incorrectness": 679, "compatibility": 680, "crashes": 681, "deadlocks": 682, "leaks": 683, "introduced": 684, "specific": 685, "change": 686, "identifiers": 687, "ci": 688, "work": 689, "prs": 690, "considered": 691, "merged": 692, "trunk": 693, "exception": 694, "manual": 695, "validations": 696, "e2e": 697, "validation": 698, "perform": 699, "regressions": 700, "benchmark": 701, "workflow": 702, "actions": 703, "workflows": 704, "yml": 705, "current": 706, "coverage": 707, "llama3": 708, "llama4": 709, "hardware": 710, "h100": 711, "mi300x": 712, "_note": 713, "based": 714, "availability_": 715, "step": 716, "access": 717, "request": 718, "write": 719, "repository": 720, "run": 721, "review": 722, "setup": 723, "familiarize": 724, "yourself": 725, "configurations": 726, "tree": 727, "benchmarks": 728, "rocm": 729, "navigate": 730, "configure": 731, "set": 732, "v0": 733, "commit": 734, "hash": 735, "results": 736, "once": 737, "completes": 738, "dashboard": 739, "hud": 740, "reponame": 741, "2fvllm": 742, "corresponding": 743, "comparison": 744, "compare": 745, "verify": 746, "occurred": 747, "example": 748, "vs": 749, "starttime": 750, "thu": 751, "2c": 752, "2017": 753, "20apr": 754, "202025": 755, "2021": 756, "3a43": 757, "3a50": 758, "20gmt": 759, "stoptime": 760, "wed": 761, "2016": 762, "20jul": 763, "granularity": 764, "week": 765, "lbranch": 766, "lcommit": 767, "b6553be1bc75f046b00046a4ad7576364d03c835": 768, "rbranch": 769, "rcommit": 770, "a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f": 771, "benchmarkname": 772, "modelname": 773, "20models": 774, "backendname": 775, "20backends": 776, "modename": 777, "20modes": 778, "dtypename": 779, "20dtype": 780, "devicename": 781, "20devices": 782, "archname": 783, "20platforms": 784, "conduct": 785, "pledge": 786, "members": 787, "leaders": 788, "make": 789, "participation": 790, "harassment": 791, "experience": 792, "regardless": 793, "age": 794, "body": 795, "size": 796, "visible": 797, "invisible": 798, "disability": 799, "ethnicity": 800, "sex": 801, "characteristics": 802, "gender": 803, "identity": 804, "expression": 805, "level": 806, "education": 807, "socioeconomic": 808, "status": 809, "nationality": 810, "personal": 811, "appearance": 812, "race": 813, "caste": 814, "religion": 815, "sexual": 816, "orientation": 817, "act": 818, "interact": 819, "ways": 820, "contribute": 821, "welcoming": 822, "diverse": 823, "inclusive": 824, "healthy": 825, "standards": 826, "examples": 827, "behavior": 828, "contributes": 829, "positive": 830, "environment": 831, "include": 832, "demonstrating": 833, "empathy": 834, "kindness": 835, "toward": 836, "people": 837, "being": 838, "respectful": 839, "differing": 840, "opinions": 841, "viewpoints": 842, "experiences": 843, "giving": 844, "gracefully": 845, "accepting": 846, "constructive": 847, "feedback": 848, "responsibility": 849, "apologizing": 850, "those": 851, "affected": 852, "mistakes": 853, "learning": 854, "best": 855, "individuals": 856, "overall": 857, "unacceptable": 858, "sexualized": 859, "imagery": 860, "advances": 861, "kind": 862, "trolling": 863, "insulting": 864, "derogatory": 865, "comments": 866, "political": 867, "attacks": 868, "public": 869, "private": 870, "publishing": 871, "others": 872, "physical": 873, "email": 874, "without": 875, "permission": 876, "which": 877, "reasonably": 878, "inappropriate": 879, "professional": 880, "setting": 881, "enforcement": 882, "responsibilities": 883, "responsible": 884, "clarifying": 885, "enforcing": 886, "acceptable": 887, "take": 888, "appropriate": 889, "fair": 890, "corrective": 891, "action": 892, "response": 893, "deem": 894, "threatening": 895, "offensive": 896, "harmful": 897, "remove": 898, "reject": 899, "commits": 900, "wiki": 901, "edits": 902, "aligned": 903, "reasons": 904, "moderation": 905, "decisions": 906, "scope": 907, "applies": 908, "within": 909, "spaces": 910, "individual": 911, "representing": 912, "using": 913, "posting": 914, "social": 915, "account": 916, "acting": 917, "appointed": 918, "representative": 919, "online": 920, "offline": 921, "irl": 922, "instances": 923, "abusive": 924, "harassing": 925, "otherwise": 926, "reported": 927, "channel": 928, "complaints": 929, "reviewed": 930, "investigated": 931, "promptly": 932, "fairly": 933, "obligated": 934, "respect": 935, "privacy": 936, "reporter": 937, "incident": 938, "guidelines": 939, "follow": 940, "impact": 941, "determining": 942, "consequences": 943, "violation": 944, "correction": 945, "deemed": 946, "unprofessional": 947, "unwelcome": 948, "consequence": 949, "written": 950, "warning": 951, "clarity": 952, "around": 953, "nature": 954, "explanation": 955, "why": 956, "apology": 957, "requested": 958, "single": 959, "series": 960, "continued": 961, "interaction": 962, "unsolicited": 963, "specified": 964, "period": 965, "includes": 966, "avoiding": 967, "interactions": 968, "well": 969, "external": 970, "channels": 971, "violating": 972, "terms": 973, "lead": 974, "temporary": 975, "permanent": 976, "ban": 977, "serious": 978, "sustained": 979, "communication": 980, "during": 981, "pattern": 982, "aggression": 983, "disparagement": 984, "classes": 985, "attribution": 986, "adapted": 987, "contributor": 988, "covenant": 989, "code_of_conduct": 990, "were": 991, "inspired": 992, "mozilla": 993, "ladder": 994, "inclusion": 995, "answers": 996, "common": 997, "see": 998, "faq": 999, "translations": 1000, "policy": 1001, "reporting": 1002, "report": 1003, "privately": 1004, "vulnerability": 1005, "submission": 1006, "form": 1007, "triage": 1008, "reports": 1009, "triaged": 1010, "vulnerability_management": 1011, "threat": 1012, "guide": 1013, "usage": 1014, "assumptions": 1015, "recommendations": 1016, "blob": 1017, "securely": 1018, "severity": 1019, "determine": 1020, "risk": 1021, "taking": 1022, "dealing": 1023, "past": 1024, "defaults": 1025, "cases": 1026, "categories": 1027, "vulnerabilities": 1028, "allow": 1029, "remote": 1030, "attackers": 1031, "execute": 1032, "arbitrary": 1033, "control": 1034, "system": 1035, "significantly": 1036, "compromise": 1037, "confidentiality": 1038, "integrity": 1039, "privileges": 1040, "needed": 1041, "network": 1042, "deserialization": 1043, "exploit": 1044, "chains": 1045, "generally": 1046, "rated": 1047, "cvss": 1048, "flaws": 1049, "elevated": 1050, "rce": 1051, "contexts": 1052, "significant": 1053, "loss": 1054, "require": 1055, "advanced": 1056, "conditions": 1057, "some": 1058, "trust": 1059, "modes": 1060, "node": 1061, "privileged": 1062, "required": 1063, "scores": 1064, "between": 1065, "moderate": 1066, "cause": 1067, "denial": 1068, "service": 1069, "partial": 1070, "disruption": 1071, "do": 1072, "breach": 1073, "rating": 1074, "low": 1075, "minor": 1076, "informational": 1077, "logging": 1078, "errors": 1079, "non": 1080, "exploitable": 1081, "weaknesses": 1082, "local": 1083, "privilege": 1084, "negligible": 1085, "side": 1086, "collisions": 1087, "often": 1088, "less": 1089, "than": 1090, "prenotification": 1091, "certain": 1092, "prenotify": 1093, "vendors": 1094, "ship": 1095, "purpose": 1096, "coordinated": 1097, "notification": 1098, "adding": 1099, "contacts": 1100, "advisory": 1101, "few": 1102, "added": 1103, "group": 1104, "send": 1105, "copying": 1106, "vendor": 1107, "analyzed": 1108, "case": 1109, "withdraw": 1110, "receiving": 1111, "prenotifications": 1112, "membership": 1113, "refinements": 1114, "who": 1115, "included": 1116, "fill": 1117, "description": 1118, "ensuring": 1119, "checklist": 1120, "items": 1121, "bottom": 1122, "been": 1123, "result": 1124, "update": 1125, "essential": 1126, "elements": 1127, "effective": 1128, "fix": 1129, "link": 1130, "existing": 1131, "resolve": 1132, "command": 1133, "pasting": 1134, "necessary": 1135, "updating": 1136, "submitting": 1137, "read": 1138, "anything": 1139, "line": 1140, "removed": 1141, "hide": 1142, "navigation": 1143, "toc": 1144, "figure": 1145, "markdown": 1146, "span": 1147, "class": 1148, "60": 1149, "style": 1150, "strong": 1151, "script": 1152, "async": 1153, "defer": 1154, "buttons": 1155, "io": 1156, "js": 1157, "button": 1158, "show": 1159, "count": 1160, "true": 1161, "aria": 1162, "label": 1163, "star": 1164, "subscription": 1165, "icon": 1166, "octicon": 1167, "eye": 1168, "watch": 1169, "fork": 1170, "forked": 1171, "depends": 1172, "type": 1173, "looking": 1174, "recommend": 1175, "starting": 1176, "applications": 1177, "roadmap": 1178, "gaudi": 1179, "accelerators": 1180, "power": 1181, "trainium": 1182, "inferentia": 1183, "announcing": 1184, "intro": 1185, "sosp": 1186, "23x": 1187, "while": 1188, "reducing": 1189, "p50": 1190, "latency": 1191, "cade": 1192, "daniel": 1193, "et": 1194, "al": 1195, "meetups": 1196, "suite": 1197, "introduction": 1198, "directory": 1199, "two": 1200, "sets": 1201, "workload": 1202, "developers": 1203, "gain": 1204, "whether": 1205, "improves": 1206, "degrades": 1207, "nightly": 1208, "alternatives": 1209, "tgi": 1210, "trt": 1211, "lmdeploy": 1212, "know": 1213, "choose": 1214, "readme": 1215, "quick": 1216, "overview": 1217, "benchmarking": 1218, "qps": 1219, "a100": 1220, "coming": 1221, "xeon": 1222, "processors": 1223, "different": 1224, "duration": 1225, "1hr": 1226, "try": 1227, "constraint": 1228, "hr": 1229, "so": 1230, "won": 1231, "forever": 1232, "8b": 1233, "70b": 1234, "8x7b": 1235, "engines": 1236, "5hrs": 1237, "perf": 1238, "ready": 1239, "manually": 1240, "buildkite": 1241, "scripts": 1242, "sh": 1243, "runtime": 1244, "variables": 1245, "on_cpu": 1246, "default": 1247, "serving_json": 1248, "json": 1249, "tests": 1250, "empty": 1251, "string": 1252, "latency_json": 1253, "throughput_json": 1254, "throughout": 1255, "remote_host": 1256, "ip": 1257, "remote_port": 1258, "port": 1259, "descriptions": 1260, "detailed": 1261, "cpu": 1262, "instead": 1263, "one": 1264, "inside": 1265, "test_name": 1266, "latency_llama8b_tp1": 1267, "parameters": 1268, "tensor_parallel_size": 1269, "load_format": 1270, "dummy": 1271, "num_iters_warmup": 1272, "num_iters": 1273, "attributes": 1274, "unique": 1275, "identifier": 1276, "must": 1277, "latency_": 1278, "attribute": 1279, "arguments": 1280, "bench": 1281, "underline": 1282, "dash": 1283, "specifying": 1284, "convert": 1285, "feeding": 1286, "load": 1287, "num": 1288, "iters": 1289, "warmup": 1290, "numbers": 1291, "highly": 1292, "sensitive": 1293, "sure": 1294, "correctly": 1295, "save": 1296, "itself": 1297, "output": 1298, "parameter": 1299, "syntax": 1300, "except": 1301, "fed": 1302, "forward": 1303, "number": 1304, "slight": 1305, "might": 1306, "vary": 1307, "lot": 1308, "rate": 1309, "inf": 1310, "cover": 1311, "serving_llama8b_tp1_sharegpt": 1312, "qps_list": 1313, "server_parameters": 1314, "swap_space": 1315, "disable_log_stats": 1316, "client_parameters": 1317, "backend": 1318, "dataset_name": 1319, "sharegpt": 1320, "dataset_path": 1321, "sharegpt_v3_unfiltered_cleaned_split": 1322, "num_prompts": 1323, "200": 1324, "serving_": 1325, "client": 1326, "controls": 1327, "compared": 1328, "delay": 1329, "due": 1330, "randomized": 1331, "dataset": 1332, "benchmark_serving": 1333, "py": 1334, "still": 1335, "greatly": 1336, "saving": 1337, "related": 1338, "visualizing": 1339, "helps": 1340, "put": 1341, "table": 1342, "formatting": 1343, "real": 1344, "presented": 1345, "job": 1346, "page": 1347, "wait": 1348, "till": 1349, "finish": 1350, "running": 1351, "together": 1352, "attached": 1353, "files": 1354, "artifacts": 1355, "tab": 1356, "converted": 1357, "generates": 1358, "folder": 1359, "along": 1360, "benchmark_results": 1361, "compares": 1362, "provides": 1363, "ratio": 1364, "tput": 1365, "median": 1366, "ttft": 1367, "tpot": 1368, "passed": 1369, "tp": 1370, "pp": 1371, "result_a": 1372, "result_b": 1373, "name": 1374, "input": 1375, "lenght": 1376, "max": 1377, "concurrency": 1378, "python3": 1379, "results_a": 1380, "results_b": 1381, "len": 1382, "perf_ratio": 1383, "instruct": 1384, "random": 1385, "128": 1386, "1000": 1387, "142": 1388, "633982": 1389, "156": 1390, "526018": 1391, "097396": 1392, "241": 1393, "620334": 1394, "294": 1395, "018783": 1396, "216863": 1397, "diagram": 1398, "generated": 1399, "96c": 1400, "results_gnr_96c_091_tp2pp3": 1401, "128c": 1402, "results_gnr_128c_091_tp2pp3": 1403, "1886": 1404, "height": 1405, "828": 1406, "image": 1407, "attachments": 1408, "c02a43ef": 1409, "25d0": 1410, "4fd6": 1411, "90e5": 1412, "2169a28682dd": 1413, "docker": 1414, "containers": 1415, "yaml": 1416, "specifies": 1417, "container": 1418, "probe": 1419, "engine": 1420, "parse": 1421, "described": 1422, "launch": 1423, "last": 1424, "collect": 1425, "plot": 1426, "commands": 1427, "hard": 1428, "coded": 1429, "should": 1430, "several": 1431, "populating": 1432, "requires": 1433, "protobuf": 1434, "tensorrt": 1435, "demo": 1436, "neuralmagic": 1437, "git": 1438, "annotation": 1439, "downloading": 1440, "artifact": 1441, "zip": 1442, "download": 1443, "visualization": 1444, "reproduction": 1445, "deploy": 1446, "export": 1447, "hf_token": 1448, "hf": 1449, "token": 1450, "apt": 1451, "unzip": 1452, "vllm_source_code_loc": 1453, "aims": 1454, "provide": 1455, "sglang": 1456, "leads": 1457, "reproducible": 1458, "exact": 1459, "reproducing": 1460, "instructions": 1461, "scroll": 1462, "guilde": 1463, "8176": 1464, "images": 1465, "lmsysorg": 1466, "cu121": 1467, "openmmlab": 1468, "cu12": 1469, "nvcr": 1470, "tritonserver": 1471, "24": 1472, "trtllm": 1473, "python": 1474, "py3": 1475, "r24": 1476, "implementation": 1477, "works": 1478, "going": 1479, "bump": 1480, "up": 1481, "concrete": 1482, "specs": 1483, "8x": 1484, "heavy": 1485, "average": 1486, "462": 1487, "tokens": 1488, "decode": 1489, "256": 1490, "configuration": 1491, "datasets": 1492, "2105": 1493, "query": 1494, "per": 1495, "32": 1496, "queries": 1497, "randomly": 1498, "sampled": 1499, "arrival": 1500, "patterns": 1501, "determined": 1502, "poisson": 1503, "fixed": 1504, "seed": 1505, "evaluation": 1506, "metrics": 1507, "higher": 1508, "better": 1509, "lower": 1510, "itl": 1511, "inter": 1512, "known": 1513, "ignore": 1514, "eos": 1515, "flag": 1516, "length": 1517, "batch": 1518, "mean": 1519, "p99": 1520, "latency_tests_markdown_table": 1521, "sample": 1522, "prompts": 1523, "dynamically": 1524, "achieve": 1525, "maximum": 1526, "throughput_tests_markdown_table": 1527, "means": 1528, "come": 1529, "values": 1530, "100": 1531, "serving_tests_markdown_table": 1532, "platform": 1533, "platform_markdown_table": 1534, "tables": 1535, "section": 1536, "above": 1537, "pandas": 1538, "dataframes": 1539, "follows": 1540, "import": 1541, "pd": 1542, "benchmarking_results_json": 1543, "benchmarking_results": 1544, "loads": 1545, "latency_results": 1546, "dataframe": 1547, "from_dict": 1548, "throughput_results": 1549, "serving_results": 1550, "benchmarking_results_in_json_string": 1551, "experiment": 1552, "cluster": 1553, "http": 1554, "2412": 1555, "19437": 1556, "way": 1557, "sparse": 1558, "moe": 1559, "many": 1560, "experts": 1561, "however": 1562, "components": 1563, "beyond": 1564, "normal": 1565, "package": 1566, "driver": 1567, "impossible": 1568, "bundle": 1569, "break": 1570, "down": 1571, "requirements": 1572, "steps": 1573, "libraries": 1574, "pplx": 1575, "ppl": 1576, "deepep": 1577, "dependencies": 1578, "nvshmem": 1579, "enable": 1580, "ibgda": 1581, "root": 1582, "done": 1583, "host": 1584, "machine": 1585, "accept": 1586, "positional": 1587, "argument": 1588, "workspace": 1589, "path": 1590, "staging": 1591, "defaulting": 1592, "pwd": 1593, "ep_kernels_workspace": 1594, "hopper": 1595, "torch_cuda_arch_list": 1596, "install_python_libraries": 1597, "blackwell": 1598, "additional": 1599, "sudo": 1600, "configure_system_drivers": 1601, "reboot": 1602, "gputrc2graph": 1603, "processes": 1604, "nsight": 1605, "nsys": 1606, "trace": 1607, "rep": 1608, "tracing": 1609, "enabled": 1610, "kernel": 1611, "summaries": 1612, "visualizations": 1613, "useful": 1614, "profiling": 1615, "analyzing": 1616, "profile": 1617, "in_file": 1618, "metadata": 1619, "entry": 1620, "elapsed_nonprofiled_sec": 1621, "gpt": 1622, "oss": 1623, "ds": 1624, "wall": 1625, "clock": 1626, "seconds": 1627, "specify": 1628, "elapsed": 1629, "inflate": 1630, "actual": 1631, "entries": 1632, "provided": 1633, "separated": 1634, "out_dir": 1635, "csv": 1636, "saved": 1637, "chart": 1638, "nsys_cmd": 1639, "assumes": 1640, "installed": 1641, "help": 1642, "analyze": 1643, "cycles": 1644, "say": 1645, "config": 1646, "run1": 1647, "exec": 1648, "120b": 1649, "collecting": 1650, "profiles": 1651, "aren": 1652, "captured": 1653, "generation": 1654, "starts": 1655, "generating": 1656, "again": 1657, "total": 1658, "calculate": 1659, "analysis": 1660, "306": 1661, "produce": 1662, "categorizes": 1663, "names": 1664, "stacked": 1665, "bar": 1666, "shows": 1667, "mapped": 1668, "substages": 1669, "consist": 1670, "moe_gemm": 1671, "gemm": 1672, "biggest": 1673, "category": 1674, "148": 1675, "followed": 1676, "attn": 1677, "lets": 1678, "prioritize": 1679, "focus": 1680, "optimizations": 1681, "appended": 1682, "underneath": 1683, "processing": 1684, "tools": 1685, "html_tbl": 1686, "mapping": 1687, "suppose": 1688, "improving": 1689, "triton": 1690, "consumer": 1691, "74": 1692, "sec": 1693, "perhaps": 1694, "hasn": 1695, "next": 1696, "dive": 1697, "compose": 1698, "triton_poi_fused__to_copy_add_addmm_cat_": 1699, "csv1": 1700, "something": 1701, "run2": 1702, "102": 1703, "stack": 1704, "charts": 1705, "remain": 1706, "shown": 1707, "another": 1708, "largest": 1709, "amount": 1710, "difference": 1711, "add": 1712, "classification": 1713, "abc": 1714, "def": 1715, "classified": 1716, "engine_model": 1717, "layer_anno": 1718, "stage": 1719, "layer": 1720, "substage": 1721, "mem": 1722, "h_d_memops": 1723, "misc": 1724, "basically": 1725, "dictionary": 1726, "pairs": 1727, "keys": 1728, "regex": 1729, "bins": 1730, "wishes": 1731, "across": 1732, "consisting": 1733, "operations": 1734, "leftover": 1735, "invoking": 1736, "infile": 1737, "resolver": 1738, "plugins": 1739, "general": 1740, "discovering": 1741, "loading": 1742, "adapters": 1743, "loraresolver": 1744, "plugin": 1745, "framework": 1746, "vllm_allow_runtime_lora_updating": 1747, "vllm_plugins": 1748, "desired": 1749, "lora_filesystem_resolver": 1750, "vllm_plugin_lora_cache_dir": 1751, "receives": 1752, "adapter": 1753, "foobar": 1754, "doesn": 1755, "currently": 1756, "recognize": 1757, "look": 1758, "subdirectory": 1759, "containing": 1760, "exists": 1761, "kv": 1762, "cache": 1763, "transfer": 1764, "implements": 1765, "usecase": 1766, "disaggregated": 1767, "prefilling": 1768, "abstractions": 1769, "three": 1770, "pipe": 1771, "fifo": 1772, "torch": 1773, "transmission": 1774, "apis": 1775, "send_tensor": 1776, "recv_tensor": 1777, "lookup": 1778, "buffer": 1779, "caches": 1780, "hidden": 1781, "states": 1782, "insert": 1783, "drop_select": 1784, "sql": 1785, "semantics": 1786, "connector": 1787, "connects": 1788, "send_kv_caches_and_hidden_states": 1789, "recv_kv_caches_and_hidden_states": 1790, "enough": 1791, "worker": 1792, "really": 1793, "handle": 1794, "naturally": 1795, "handled": 1796, "translate": 1797, "bypassible": 1798, "skip": 1799, "already": 1800, "redis": 1801, "rdma": 1802, "database": 1803, "want": 1804, "adjust": 1805, "flow": 1806, "receive": 1807, "bypass": 1808, "directly": 1809, "implement": 1810, "bear": 1811, "mind": 1812, "constantly": 1813, "changing": 1814, "likely": 1815, "broken": 1816, "updates": 1817, "online_serving": 1818, "disaggregated_prefill": 1819, "disagg_prefill_workflow": 1820, "jpg": 1821, "chosen": 1822, "device": 1823, "offline_inference": 1824, "instance": 1825, "production": 1826, "training": 1827, "rlhf": 1828, "train": 1829, "fine": 1830, "tune": 1831, "troubleshooting": 1832, "document": 1833, "outlines": 1834, "strategies": 1835, "consider": 1836, "think": 1837, "ve": 1838, "discovered": 1839, "3aissue": 1840, "much": 1841, "relevant": 1842, "possible": 1843, "debugged": 1844, "problem": 1845, "remember": 1846, "turn": 1847, "off": 1848, "debugging": 1849, "defined": 1850, "simply": 1851, "shell": 1852, "avoid": 1853, "lingering": 1854, "settings": 1855, "slow": 1856, "functionalities": 1857, "left": 1858, "activated": 1859, "hangs": 1860, "isn": 1861, "downloaded": 1862, "disk": 1863, "internet": 1864, "depend": 1865, "connection": 1866, "recommended": 1867, "cli": 1868, "co": 1869, "huggingface_hub": 1870, "guides": 1871, "passing": 1872, "isolate": 1873, "long": 1874, "pay": 1875, "store": 1876, "clusters": 1877, "shared": 1878, "filesystems": 1879, "nodes": 1880, "filesystem": 1881, "additionally": 1882, "too": 1883, "slowing": 1884, "because": 1885, "needs": 1886, "frequently": 1887, "swap": 1888, "weights": 1889, "bottleneck": 1890, "fit": 1891, "oom": 1892, "error": 1893, "adopting": 1894, "options": 1895, "conserving_memory": 1896, "reduce": 1897, "consumption": 1898, "quality": 1899, "changed": 1900, "gh": 1901, "12622": 1902, "prior": 1903, "came": 1904, "neutral": 1905, "onwards": 1906, "generation_config": 1907, "creator": 1908, "responses": 1909, "degraded": 1910, "happening": 1911, "trying": 1912, "old": 1913, "continuing": 1914, "petition": 1915, "produces": 1916, "generations": 1917, "don": 1918, "solve": 1919, "stuck": 1920, "somewhere": 1921, "debug": 1922, "vllm_logging_level": 1923, "vllm_log_stats_interval": 1924, "log": 1925, "statistics": 1926, "tracking": 1927, "queue": 1928, "waiting": 1929, "hit": 1930, "cuda_launch_blocking": 1931, "identify": 1932, "causing": 1933, "nccl_debug": 1934, "nccl": 1935, "vllm_trace_function": 1936, "record": 1937, "function": 1938, "calls": 1939, "inspection": 1940, "tell": 1941, "unless": 1942, "absolutely": 1943, "delays": 1944, "startup": 1945, "incorrect": 1946, "cannot": 1947, "correct": 1948, "complicated": 1949, "parallel_state": 1950, "88": 1951, "world_size": 1952, "rank": 1953, "local_rank": 1954, "distributed_init_method": 1955, "tcp": 1956, "xxx": 1957, "54641": 1958, "override": 1959, "variable": 1960, "vllm_host_ip": 1961, "your_ip_address": 1962, "nccl_socket_ifname": 1963, "your_network_interface": 1964, "gloo_socket_ifname": 1965, "interface": 1966, "near": 1967, "self": 1968, "replay": 1969, "captures": 1970, "model_runner": 1971, "cudagraph": 1972, "particular": 1973, "operation": 1974, "causes": 1975, "enforce": 1976, "eager": 1977, "enforce_eager": 1978, "optimization": 1979, "established": 1980, "confirm": 1981, "working": 1982, "dist": 1983, "init_process_group": 1984, "get_rank": 1985, "device_count": 1986, "set_device": 1987, "floattensor": 1988, "all_reduce": 1989, "op": 1990, "reduceop": 1991, "sum": 1992, "synchronize": 1993, "item": 1994, "get_world_size": 1995, "assert": 1996, "expected": 1997, "got": 1998, "print": 1999, "successful": 2000, "gloo": 2001, "gloo_group": 2002, "new_group": 2003, "ranks": 2004, "range": 2005, "cpu_data": 2006, "exit": 2007, "device_communicators": 2008, "pynccl": 2009, "pyncclcommunicator": 2010, "backward": 2011, "prefer": 2012, "disabled": 2013, "false": 2014, "stream": 2015, "fill_": 2016, "cuda_graph": 2017, "current_stream": 2018, "destroy_process_group": 2019, "nproc": 2020, "torchrun": 2021, "nnodes": 2022, "according": 2023, "master_addr": 2024, "master": 2025, "reachable": 2026, "rdzv_backend": 2027, "c10d": 2028, "rdzv_endpoint": 2029, "runs": 2030, "successfully": 2031, "message": 2032, "sanity": 2033, "usually": 2034, "drivers": 2035, "sense": 2036, "administrator": 2037, "further": 2038, "assistance": 2039, "workaround": 2040, "nccl_p2p_disable": 2041, "deeplearning": 2042, "env": 2043, "solution": 2044, "distnetworkerror": 2045, "dns": 2046, "assign": 2047, "multiprocessing": 2048, "runtimeerror": 2049, "seen": 2050, "logs": 2051, "console": 2052, "50": 2053, "37": 2054, "multiproc_worker_utils": 2055, "281": 2056, "initialized": 2057, "spawn": 2058, "method": 2059, "vllm_worker_multiproc_method": 2060, "looks": 2061, "attempt": 2062, "finished": 2063, "its": 2064, "bootstrapping": 2065, "phase": 2066, "probably": 2067, "child": 2068, "forgotten": 2069, "proper": 2070, "idiom": 2071, "module": 2072, "__name__": 2073, "__main__": 2074, "freeze_support": 2075, "omitted": 2076, "program": 2077, "frozen": 2078, "executable": 2079, "safe": 2080, "importing": 2081, "guard": 2082, "behind": 2083, "block": 2084, "compile": 2085, "heavily": 2086, "optimize": 2087, "introduces": 2088, "dependency": 2089, "functionality": 2090, "functions": 2091, "10406": 2092, "simple": 2093, "sin": 2094, "return": 2095, "randn": 2096, "raises": 2097, "_inductor": 2098, "custom": 2099, "12219": 2100, "failed": 2101, "inspected": 2102, "model_executor": 2103, "registry": 2104, "_raise_for_unsupported": 2105, "raise": 2106, "valueerror": 2107, "architectures": 2108, "arch": 2109, "missing": 2110, "outdated": 2111, "binaries": 2112, "carefully": 2113, "traceback": 2114, "call": 2115, "inspect_model_cls": 2116, "typeerror": 2117, "nonetype": 2118, "object": 2119, "iterable": 2120, "resolution": 2121, "model_resolution": 2122, "explicitly": 2123, "infer": 2124, "platforms": 2125, "__init__": 2126, "infers": 2127, "14195": 2128, "unhandled": 2129, "ncclcomminitrank": 2130, "gpudirect": 2131, "encounters": 2132, "even": 2133, "info": 2134, "executing": 2135, "init_device": 2136, "deadlock": 2137, "usr": 2138, "lib": 2139, "packages": 2140, "99": 2141, "comm": 2142, "ncclcomm_t": 2143, "pynccl_wrapper": 2144, "277": 2145, "nccl_check": 2146, "_funcs": 2147, "ctypes": 2148, "byref": 2149, "error_str": 2150, "indicates": 2151, "initialize": 2152, "communicator": 2153, "possibly": 2154, "ipc_lock": 2155, "linux": 2156, "capability": 2157, "unmounted": 2158, "dev": 2159, "shm": 2160, "enabling": 2161, "parallelism_scaling": 2162, "guidance": 2163, "properly": 2164, "configuring": 2165, "caused": 2166, "zmq": 2167, "zeromq": 2168, "pyzmq": 2169, "2000": 2170, "occasionally": 2171, "hang": 2172, "depending": 2173, "6759": 2174, "circumvent": 2175, "1234": 2176, "nccl_cumem_enable": 2177, "cumem": 2178, "allocator": 2179, "gives": 2180, "benefits": 2181, "inconsistent": 2182, "crash": 2183, "observed": 2184, "openrlhf": 2185, "pull": 2186, "604": 2187, "discussion": 2188, "5723": 2189, "issuecomment": 2190, "2554389656": 2191, "deprecating": 2192, "rfc": 2193, "18571": 2194, "gradually": 2195, "share": 2196, "inviter": 2197, "vllm_use_v1": 2198, "reason": 2199, "wide": 2200, "independently": 2201, "grew": 2202, "increasingly": 2203, "complex": 2204, "complexity": 2205, "harder": 2206, "integrate": 2207, "capabilities": 2208, "debt": 2209, "revealing": 2210, "streamlined": 2211, "unified": 2212, "design": 2213, "building": 2214, "success": 2215, "retains": 2216, "proven": 2217, "utilities": 2218, "re": 2219, "architects": 2220, "core": 2221, "covering": 2222, "scheduler": 2223, "manager": 2224, "sampler": 2225, "cohesive": 2226, "maintainable": 2227, "accommodates": 2228, "growth": 2229, "innovation": 2230, "specifically": 2231, "modular": 2232, "hack": 2233, "codebase": 2234, "combine": 2235, "architecture": 2236, "configs": 2237, "upgrading": 2238, "context": 2239, "scenarios": 2240, "published": 2241, "living": 2242, "important": 2243, "limitations": 2244, "actively": 2245, "bring": 2246, "therefore": 2247, "updated": 2248, "progress": 2249, "towards": 2250, "falls": 2251, "nearly": 2252, "fully": 2253, "planned": 2254, "operational": 2255, "ongoing": 2256, "wip": 2257, "active": 2258, "scheduled": 2259, "rfcs": 2260, "delayed": 2261, "temporarily": 2262, "dropped": 2263, "later": 2264, "deprecated": 2265, "demand": 2266, "treats": 2267, "prompt": 2268, "request_id": 2269, "num_tokens": 2270, "allocate": 2271, "budget": 2272, "prefills": 2273, "strict": 2274, "separation": 2275, "phases": 2276, "scheduling": 2277, "policies": 2278, "served": 2279, "fcfs": 2280, "priority": 2281, "processed": 2282, "assigned": 2283, "tie": 2284, "breaker": 2285, "configurable": 2286, "nobr": 2287, "x86": 2288, "_64": 2289, "aarch64": 2290, "macos": 2291, "ascend": 2292, "spyre": 2293, "openvino": 2294, "repositories": 2295, "decoder": 2296, "encoder": 2297, "mamba": 2298, "excludes": 2299, "supportsv0only": 2300, "protocol": 2301, "tip": 2302, "corresponds": 2303, "column": 2304, "yet": 2305, "initial": 2306, "basic": 2307, "processor": 2308, "12249": 2309, "global": 2310, "logits": 2311, "13360": 2312, "simultaneous": 2313, "selective": 2314, "space": 2315, "mechanisms": 2316, "standard": 2317, "layers": 2318, "mamba2forcausallm": 2319, "mambaforcausallm": 2320, "disabling": 2321, "bambaforcausallm": 2322, "zamba2forcausallm": 2323, "nemotronhforcausallm": 2324, "falconh1forcausallm": 2325, "granitemoehybridforcausallm": 2326, "jambaforcausallm": 2327, "hybrid": 2328, "minimaxtext01forcausallm": 2329, "minimaxm1forcausallm": 2330, "mode": 2331, "requiring": 2332, "cross": 2333, "separate": 2334, "bartforconditionalgeneration": 2335, "mllamaforconditionalgeneration": 2336, "logprobs": 2337, "calculation": 2338, "devices": 2339, "15191": 2340, "spec": 2341, "13414": 2342, "structured": 2343, "alternative": 2344, "backends": 2345, "best_of": 2346, "13361": 2347, "swapping": 2348, "semantic": 2349, "differences": 2350, "returned": 2351, "immediately": 2352, "computed": 2353, "applying": 2354, "temperature": 2355, "scaling": 2356, "penalty": 2357, "adjustments": 2358, "reflect": 2359, "adjusted": 2360, "probabilities": 2361, "turned": 2362, "recomputation": 2363, "recover": 2364, "upon": 2365, "part": 2366, "rework": 2367, "legacy": 2368, "pass": 2369, "moving": 2370, "simplified": 2371, "longer": 2372, "preemptions": 2373, "fallbacks": 2374, "communications": 2375, "insecure": 2376, "protected": 2377, "placing": 2378, "isolated": 2379, "127": 2380, "14579": 2381, "data_parallel_master_ip": 2382, "data_parallel_master_port": 2383, "29500": 2384, "considerations": 2385, "points": 2386, "intended": 2387, "internal": 2388, "untrusted": 2389, "environments": 2390, "networks": 2391, "authorization": 2392, "messages": 2393, "sent": 2394, "unencrypted": 2395, "connections": 2396, "accepted": 2397, "anywhere": 2398, "checks": 2399, "isolation": 2400, "segmentation": 2401, "prevent": 2402, "unauthorized": 2403, "firewall": 2404, "rules": 2405, "practices": 2406, "always": 2407, "rather": 2408, "firewalls": 2409, "ports": 2410, "restrict": 2411, "authentication": 2412, "interfaces": 2413, "principle": 2414, "least": 2415, "protecting": 2416, "exposed": 2417, "designed": 2418, "unsafe": 2419, "services": 2420, "underlying": 2421, "frameworks": 2422, "listening": 2423, "sometimes": 2424, "outside": 2425, "direct": 2426, "concern": 2427, "leverages": 2428, "initialization": 2429, "creates": 2430, "tcpstore": 2431, "listens": 2432, "protections": 2433, "place": 2434, "accessible": 2435, "reach": 2436, "perspective": 2437, "intentional": 2438, "protect": 2439, "expose": 2440, "minimum": 2441, "surface": 2442, "area": 2443, "trusted": 2444, "hosts": 2445, "never": 2446, "consult": 2447, "application": 2448, "believe": 2449, "found": 2450, "reproducibility": 2451, "guarantee": 2452, "sake": 2453, "deterministic": 2454, "vllm_enable_v1_multiprocessing": 2455, "locality": 2456, "almost": 2457, "generators": 2458, "np": 2459, "manual_seed": 2460, "accordingly": 2461, "none": 2462, "un": 2463, "workers": 2464, "17929": 2465, "constructs": 2466, "having": 2467, "worry": 2468, "accidentally": 2469, "making": 2470, "subsequent": 2471, "rely": 2472, "stats": 2473, "collection": 2474, "collects": 2475, "anonymous": 2476, "engineering": 2477, "understand": 2478, "widely": 2479, "allows": 2480, "efforts": 2481, "workloads": 2482, "collected": 2483, "transparent": 2484, "subset": 2485, "cleaning": 2486, "aggregation": 2487, "publicly": 2488, "benefit": 2489, "usage_lib": 2490, "uuid": 2491, "fbe880e9": 2492, "084d": 2493, "4cab": 2494, "a395": 2495, "8984c50f1109": 2496, "provider": 2497, "gcp": 2498, "num_cpu": 2499, "cpu_type": 2500, "20ghz": 2501, "cpu_family_model_stepping": 2502, "85": 2503, "total_memory": 2504, "101261135872": 2505, "x86_64": 2506, "28": 2507, "amd64": 2508, "glibc2": 2509, "31": 2510, "gpu_count": 2511, "gpu_type": 2512, "l4": 2513, "gpu_memory_per_device": 2514, "23580639232": 2515, "model_architecture": 2516, "optforcausallm": 2517, "vllm_version": 2518, "cu123": 2519, "llm_class": 2520, "log_time": 2521, "1711663373492490000": 2522, "dtype": 2523, "float16": 2524, "block_size": 2525, "gpu_memory_utilization": 2526, "null": 2527, "kv_cache_dtype": 2528, "auto": 2529, "enable_lora": 2530, "enable_prefix_caching": 2531, "disable_custom_all_reduce": 2532, "preview": 2533, "tail": 2534, "usage_stats": 2535, "opting": 2536, "opt": 2537, "vllm_no_usage_stats": 2538, "do_not_track": 2539, "creating": 2540, "methods": 2541, "mkdir": 2542, "touch": 2543, "exposes": 2544, "health": 2545, "endpoint": 2546, "unsloth": 2547, "1b": 2548, "curl": 2549, "8000": 2550, "iteration_tokens_total": 2551, "histogram": 2552, "engine_step": 2553, "iteration_tokens_total_sum": 2554, "model_name": 2555, "iteration_tokens_total_bucket": 2556, "le": 2557, "64": 2558, "512": 2559, "definitions": 2560, "escape": 2561, "hatch": 2562, "asked": 2563, "assuming": 2564, "referring": 2565, "route": 2566, "7b": 2567, "intfloat": 2568, "baai": 2569, "bge": 2570, "listed": 2571, "extracting": 2572, "automatically": 2573, "mistralai": 2574, "inferior": 2575, "trained": 2576, "tasks": 2577, "yes": 2578, "variations": 2579, "occur": 2580, "numerical": 2581, "instability": 2582, "batched": 2583, "accuracy": 2584, "numerical_accuracy": 2585, "computations": 2586, "slice": 2587, "differently": 2588, "factors": 2589, "concurrent": 2590, "expansion": 2591, "combined": 2592, "slightly": 2593, "logit": 2594, "logprob": 2595, "accumulate": 2596, "potentially": 2597, "resulting": 2598, "divergence": 2599, "mitigation": 2600, "improved": 2601, "stability": 2602, "reduced": 2603, "variance": 2604, "float32": 2605, "bfloat16": 2606, "switching": 2607, "seeds": 2608, "aid": 2609, "achieving": 2610, "discrepancies": 2611, "precision": 2612, "levels": 2613, "highest": 2614, "lowest": 2615, "completions": 2616, "params": 2617, "engine_args": 2618, "env_vars": 2619, "tuning": 2620, "covers": 2621, "conserve": 2622, "preemption": 2623, "regressive": 2624, "times": 2625, "insufficient": 2626, "preempt": 2627, "preempted": 2628, "recomputed": 2629, "becomes": 2630, "occurs": 2631, "00": 2632, "49": 2633, "33": 2634, "1057": 2635, "sequence": 2636, "preemptionmode": 2637, "recompute": 2638, "increase": 2639, "total_cumulative_preemption_cnt": 2640, "mechanism": 2641, "ensures": 2642, "robustness": 2643, "adversely": 2644, "encounter": 2645, "pre": 2646, "allocates": 2647, "percentage": 2648, "increasing": 2649, "utilization": 2650, "decrease": 2651, "max_num_seqs": 2652, "max_num_batched_tokens": 2653, "reduces": 2654, "thereby": 2655, "shards": 2656, "allowing": 2657, "excessive": 2658, "synchronization": 2659, "pipeline_parallel_size": 2660, "distributes": 2661, "indirectly": 2662, "leaving": 2663, "penalties": 2664, "prometheus": 2665, "cumulative": 2666, "smaller": 2667, "chunks": 2668, "improve": 2669, "balancing": 2670, "bound": 2671, "conditionally": 2672, "prioritizes": 2673, "batches": 2674, "pending": 2675, "schedules": 2676, "prioritized": 2677, "locating": 2678, "adjusting": 2679, "2048": 2680, "fewer": 2681, "decodes": 2682, "optimal": 2683, "8096": 2684, "especially": 2685, "max_model_len": 2686, "equivalent": 2687, "16384": 2688, "papers": 2689, "pdf": 2690, "2401": 2691, "08671": 2692, "2308": 2693, "16369": 2694, "strategy": 2695, "pressure": 2696, "split": 2697, "parts": 2698, "maxed": 2699, "distribute": 2700, "very": 2701, "deep": 2702, "narrow": 2703, "distribution": 2704, "sharding": 2705, "ep": 2706, "specialized": 2707, "deepseekv3": 2708, "qwen3moe": 2709, "balance": 2710, "computation": 2711, "enable_expert_parallel": 2712, "degree": 2713, "dp": 2714, "replicates": 2715, "entire": 2716, "beneficial": 2717, "data_parallel_size": 2718, "sharded": 2719, "product": 2720, "data_parallel_deployment": 2721, "excess": 2722, "capacity": 2723, "qwen": 2724, "qwen2": 2725, "vl": 2726, "3b": 2727, "correspondance": 2728, "repeatedly": 2729, "inputs": 2730, "autoprocessor": 2731, "commonly": 2732, "conversations": 2733, "mm_processor_cache_gb": 2734, "gib": 2735, "completely": 2736, "larger": 2737, "toc_depth": 2738, "openai_compatible_server": 2739, "engineargs": 2740, "arg_utils": 2741, "asyncengineargs": 2742, "combination": 2743, "interested": 2744, "truth": 2745, "types": 2746, "docstrings": 2747, "json_tip": 2748, "inc": 2749, "argparse": 2750, "async_engine_args": 2751, "vllm_port": 2752, "prefixed": 2753, "vllm_": 2754, "care": 2755, "taken": 2756, "kubernetes": 2757, "conflict": 2758, "capitalized": 2759, "concepts": 2760, "networking": 2761, "envs": 2762, "vars": 2763, "definition": 2764, "tips": 2765, "doc": 2766, "serves": 2767, "handy": 2768, "optimizing": 2769, "google_tpu": 2770, "sizing": 2771, "selecting": 2772, "ideal": 2773, "chips": 2774, "adequate": 2775, "hbm": 2776, "colab": 2777, "calculator": 2778, "ericehanley": 2779, "rightsize": 2780, "hbm_calculator": 2781, "ipynb": 2782, "requirement": 2783, "consumed": 2784, "allocated": 2785, "approximately": 2786, "seqs": 2787, "rule": 2788, "thumb": 2789, "tradeoff": 2790, "rightsizing": 2791, "decreasing": 2792, "defines": 2793, "effectively": 2794, "limiting": 2795, "simultaneously": 2796, "maximize": 2797, "increases": 2798, "crucial": 2799, "compilation": 2800, "background": 2801, "ll": 2802, "notice": 2803, "tpus": 2804, "asics": 2805, "compiled": 2806, "static": 2807, "graphs": 2808, "xla": 2809, "compiler": 2810, "unlike": 2811, "dynamic": 2812, "shapes": 2813, "flexibly": 2814, "shape": 2815, "manage": 2816, "performs": 2817, "compiles": 2818, "saves": 2819, "storage": 2820, "located": 2821, "xla_cache": 2822, "minutes": 2823, "hour": 2824, "although": 2825, "launches": 2826, "eliminating": 2827, "vllm_xla_cache_path": 2828, "shareable": 2829, "deployed": 2830, "autoscaling": 2831, "ranges": 2832, "impacted": 2833, "discussed": 2834, "influence": 2835, "things": 2836, "vllm_tpu_most_model_len": 2837, "most_model_len": 2838, "shorter": 2839, "accommodate": 2840, "occasional": 2841, "negatively": 2842, "introducing": 2843, "32k": 2844, "2k": 2845, "32768": 2846, "subdivided": 2847, "latter": 2848, "padding": 2849, "bucket": 2850, "vllm_tpu_bucket_padding_gap": 2851, "layout": 2852, "increments": 2853, "etc": 2854, "pads": 2855, "lengths": 2856, "sending": 2857, "recompilation": 2858, "efficiencies": 2859, "pad": 2860, "exponential": 2861, "nearest": 2862, "linearly": 2863, "buckets": 2864, "increment": 2865, "padding_gap": 2866, "192": 2867, "320": 2868, "384": 2869, "448": 2870, "unnecessary": 2871, "300": 2872, "bucket_padding": 2873, "careful": 2874, "gap": 2875, "small": 2876, "leading": 2877, "increased": 2878, "precompile": 2879, "compilaed": 2880, "conversely": 2881, "overly": 2882, "yields": 2883, "improvement": 2884, "matches": 2885, "chip": 2886, 