{"contributing": 0, "vllm": 1, "you": 2, "may": 3, "find": 4, "information": 5, "about": 6, "docs": 7, "ai": 8, "https": 9, "en": 10, "latest": 11, "code": 12, "conduct": 13, "our": 14, "pledge": 15, "we": 16, "members": 17, "contributors": 18, "leaders": 19, "make": 20, "participation": 21, "community": 22, "harassment": 23, "free": 24, "experience": 25, "everyone": 26, "regardless": 27, "age": 28, "body": 29, "size": 30, "visible": 31, "invisible": 32, "disability": 33, "ethnicity": 34, "sex": 35, "characteristics": 36, "gender": 37, "identity": 38, "expression": 39, "level": 40, "education": 41, "socioeconomic": 42, "status": 43, "nationality": 44, "personal": 45, "appearance": 46, "race": 47, "caste": 48, "color": 49, "religion": 50, "sexual": 51, "orientation": 52, "act": 53, "interact": 54, "ways": 55, "contribute": 56, "open": 57, "welcoming": 58, "diverse": 59, "inclusive": 60, "healthy": 61, "standards": 62, "examples": 63, "behavior": 64, "contributes": 65, "positive": 66, "environment": 67, "include": 68, "demonstrating": 69, "empathy": 70, "kindness": 71, "toward": 72, "other": 73, "people": 74, "being": 75, "respectful": 76, "differing": 77, "opinions": 78, "viewpoints": 79, "experiences": 80, "giving": 81, "gracefully": 82, "accepting": 83, "constructive": 84, "feedback": 85, "responsibility": 86, "apologizing": 87, "those": 88, "affected": 89, "mistakes": 90, "learning": 91, "from": 92, "focusing": 93, "what": 94, "best": 95, "just": 96, "us": 97, "individuals": 98, "overall": 99, "unacceptable": 100, "use": 101, "sexualized": 102, "language": 103, "imagery": 104, "attention": 105, "advances": 106, "any": 107, "kind": 108, "trolling": 109, "insulting": 110, "derogatory": 111, "comments": 112, "political": 113, "attacks": 114, "public": 115, "private": 116, "publishing": 117, "others": 118, "physical": 119, "email": 120, "address": 121, "without": 122, "explicit": 123, "permission": 124, "which": 125, "could": 126, "reasonably": 127, "considered": 128, "inappropriate": 129, "professional": 130, "setting": 131, "enforcement": 132, "responsibilities": 133, "responsible": 134, "clarifying": 135, "enforcing": 136, "acceptable": 137, "take": 138, "appropriate": 139, "fair": 140, "corrective": 141, "action": 142, "response": 143, "deem": 144, "threatening": 145, "offensive": 146, "harmful": 147, "have": 148, "right": 149, "remove": 150, "edit": 151, "reject": 152, "commits": 153, "wiki": 154, "edits": 155, "issues": 156, "contributions": 157, "aligned": 158, "communicate": 159, "reasons": 160, "moderation": 161, "decisions": 162, "when": 163, "scope": 164, "applies": 165, "within": 166, "all": 167, "spaces": 168, "also": 169, "individual": 170, "officially": 171, "representing": 172, "using": 173, "official": 174, "posting": 175, "via": 176, "social": 177, "media": 178, "account": 179, "acting": 180, "appointed": 181, "representative": 182, "online": 183, "offline": 184, "irl": 185, "event": 186, "instances": 187, "abusive": 188, "harassing": 189, "otherwise": 190, "reported": 191, "channel": 192, "slack": 193, "complaints": 194, "reviewed": 195, "investigated": 196, "promptly": 197, "fairly": 198, "obligated": 199, "respect": 200, "privacy": 201, "security": 202, "reporter": 203, "incident": 204, "guidelines": 205, "follow": 206, "impact": 207, "determining": 208, "consequences": 209, "violation": 210, "correction": 211, "deemed": 212, "unprofessional": 213, "unwelcome": 214, "consequence": 215, "written": 216, "warning": 217, "providing": 218, "clarity": 219, "around": 220, "nature": 221, "explanation": 222, "why": 223, "apology": 224, "requested": 225, "through": 226, "single": 227, "series": 228, "actions": 229, "continued": 230, "interaction": 231, "involved": 232, "including": 233, "unsolicited": 234, "specified": 235, "period": 236, "time": 237, "includes": 238, "avoiding": 239, "interactions": 240, "well": 241, "external": 242, "channels": 243, "like": 244, "violating": 245, "terms": 246, "lead": 247, "temporary": 248, "permanent": 249, "ban": 250, "serious": 251, "sustained": 252, "sort": 253, "communication": 254, "allowed": 255, "during": 256, "pattern": 257, "aggression": 258, "disparagement": 259, "classes": 260, "attribution": 261, "adapted": 262, "contributor": 263, "covenant": 264, "www": 265, "org": 266, "version": 267, "available": 268, "v2": 269, "code_of_conduct": 270, "html": 271, "were": 272, "inspired": 273, "mozilla": 274, "ladder": 275, "github": 276, "com": 277, "inclusion": 278, "answers": 279, "common": 280, "questions": 281, "see": 282, "faq": 283, "translations": 284, "policy": 285, "reporting": 286, "please": 287, "report": 288, "privately": 289, "vulnerability": 290, "submission": 291, "form": 292, "project": 293, "advisories": 294, "new": 295, "issue": 296, "triage": 297, "reports": 298, "triaged": 299, "management": 300, "team": 301, "vulnerability_management": 302, "threat": 303, "model": 304, "guide": 305, "documentation": 306, "usage": 307, "more": 308, "assumptions": 309, "recommendations": 310, "pytorch": 311, "blob": 312, "main": 313, "md": 314, "how": 315, "securely": 316, "models": 317, "severity": 318, "determine": 319, "risk": 320, "each": 321, "taking": 322, "dealing": 323, "past": 324, "versions": 325, "defaults": 326, "cases": 327, "following": 328, "categories": 329, "critical": 330, "vulnerabilities": 331, "allow": 332, "remote": 333, "attackers": 334, "execute": 335, "arbitrary": 336, "full": 337, "control": 338, "system": 339, "significantly": 340, "compromise": 341, "confidentiality": 342, "integrity": 343, "availability": 344, "privileges": 345, "needed": 346, "execution": 347, "network": 348, "deserialization": 349, "exploit": 350, "chains": 351, "generally": 352, "rated": 353, "cvss": 354, "high": 355, "flaws": 356, "elevated": 357, "rce": 358, "specific": 359, "limited": 360, "contexts": 361, "significant": 362, "data": 363, "loss": 364, "require": 365, "advanced": 366, "conditions": 367, "some": 368, "trust": 369, "deployment": 370, "modes": 371, "multi": 372, "node": 373, "where": 374, "privileged": 375, "access": 376, "required": 377, "typically": 378, "scores": 379, "between": 380, "moderate": 381, "cause": 382, "denial": 383, "service": 384, "partial": 385, "disruption": 386, "do": 387, "breach": 388, "rating": 389, "low": 390, "minor": 391, "informational": 392, "disclosures": 393, "logging": 394, "errors": 395, "non": 396, "exploitable": 397, "weaknesses": 398, "local": 399, "privilege": 400, "offer": 401, "negligible": 402, "side": 403, "hash": 404, "collisions": 405, "often": 406, "less": 407, "than": 408, "prenotification": 409, "certain": 410, "prenotify": 411, "organizations": 412, "vendors": 413, "ship": 414, "purpose": 415, "coordinated": 416, "release": 417, "fixes": 418, "severe": 419, "notification": 420, "adding": 421, "contacts": 422, "advisory": 423, "few": 424, "days": 425, "before": 426, "wish": 427, "added": 428, "group": 429, "send": 430, "copying": 431, "vendor": 432, "contact": 433, "analyzed": 434, "case": 435, "basis": 436, "withdraw": 437, "receiving": 438, "future": 439, "prenotifications": 440, "membership": 441, "change": 442, "based": 443, "refinements": 444, "who": 445, "included": 446, "releasing": 447, "releases": 448, "reliable": 449, "base": 450, "packaged": 451, "binary": 452, "format": 453, "can": 454, "conveniently": 455, "accessed": 456, "pypi": 457, "serve": 458, "key": 459, "milestones": 460, "development": 461, "newly": 462, "features": 463, "improvements": 464, "upcoming": 465, "changes": 466, "affect": 467, "users": 468, "potential": 469, "breaking": 470, "versioning": 471, "uses": 472, "shifted": 473, "scheme": 474, "patch": 475, "out": 476, "every": 477, "weeks": 478, "contain": 479, "bug": 480, "opposed": 481, "semver": 482, "contains": 483, "only": 484, "backwards": 485, "compatible": 486, "need": 487, "made": 488, "special": 489, "post1": 490, "released": 491, "_major_": 492, "major": 493, "architectural": 494, "milestone": 495, "incompatible": 496, "api": 497, "similar": 498, "_minor_": 499, "_patch_": 500, "_post1_": 501, "_patch": 502, "1_": 503, "either": 504, "implicit": 505, "post": 506, "cadence": 507, "bi": 508, "weekly": 509, "after": 510, "same": 511, "branch": 512, "year": 513, "2025": 514, "dates": 515, "below": 516, "tentative": 517, "note": 518, "optional": 519, "date": 520, "jan": 521, "feb": 522, "mar": 523, "apr": 524, "jun": 525, "10": 526, "11": 527, "jul": 528, "12": 529, "13": 530, "aug": 531, "14": 532, "15": 533, "sep": 534, "16": 535, "17": 536, "oct": 537, "18": 538, "19": 539, "nov": 540, "20": 541, "21": 542, "dec": 543, "22": 544, "23": 545, "built": 546, "dedicated": 547, "cut": 548, "performed": 549, "live": 550, "previously": 551, "reused": 552, "builds": 553, "triggered": 554, "push": 555, "rc": 556, "tag": 557, "vx": 558, "rc1": 559, "enables": 560, "build": 561, "test": 562, "multiple": 563, "rcs": 564, "final": 565, "does": 566, "trigger": 567, "used": 568, "notes": 569, "assets": 570, "created": 571, "monitor": 572, "reverts": 573, "apply": 574, "cherry": 575, "pick": 576, "criteria": 577, "approach": 578, "finalizing": 579, "clear": 580, "picks": 581, "process": 582, "land": 583, "pr": 584, "ensure": 585, "has": 586, "sufficient": 587, "complete": 588, "thorough": 589, "round": 590, "testing": 591, "stable": 592, "regression": 593, "functional": 594, "performance": 595, "against": 596, "most": 597, "recent": 598, "silent": 599, "incorrectness": 600, "compatibility": 601, "crashes": 602, "deadlocks": 603, "large": 604, "memory": 605, "leaks": 606, "introduced": 607, "identifiers": 608, "ci": 609, "feature": 610, "work": 611, "prs": 612, "merged": 613, "trunk": 614, "exception": 615, "manual": 616, "validations": 617, "e2e": 618, "validation": 619, "perform": 620, "end": 621, "regressions": 622, "benchmark": 623, "workflow": 624, "integration": 625, "workflows": 626, "yml": 627, "current": 628, "coverage": 629, "llama3": 630, "llama4": 631, "mixtral": 632, "hardware": 633, "nvidia": 634, "h100": 635, "amd": 636, "mi300x": 637, "_note": 638, "availability_": 639, "step": 640, "get": 641, "request": 642, "write": 643, "repository": 644, "run": 645, "review": 646, "setup": 647, "familiarize": 648, "yourself": 649, "configurations": 650, "cuda": 651, "tree": 652, "benchmarks": 653, "rocm": 654, "navigate": 655, "configure": 656, "set": 657, "v0": 658, "commit": 659, "results": 660, "once": 661, "completes": 662, "dashboard": 663, "hud": 664, "llms": 665, "reponame": 666, "2fvllm": 667, "under": 668, "corresponding": 669, "comparison": 670, "compare": 671, "previous": 672, "verify": 673, "occurred": 674, "here": 675, "example": 676, "vs": 677, "starttime": 678, "thu": 679, "2c": 680, "2017": 681, "20apr": 682, "202025": 683, "2021": 684, "3a43": 685, "3a50": 686, "20gmt": 687, "stoptime": 688, "wed": 689, "2016": 690, "20jul": 691, "granularity": 692, "week": 693, "lbranch": 694, "lcommit": 695, "b6553be1bc75f046b00046a4ad7576364d03c835": 696, "rbranch": 697, "rcommit": 698, "a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f": 699, "benchmarkname": 700, "modelname": 701, "20models": 702, "backendname": 703, "20backends": 704, "modename": 705, "20modes": 706, "dtypename": 707, "20dtype": 708, "devicename": 709, "20devices": 710, "archname": 711, "20platforms": 712, "markdownlint": 713, "disable": 714, "md001": 715, "md041": 716, "align": 717, "center": 718, "picture": 719, "source": 720, "prefers": 721, "dark": 722, "srcset": 723, "raw": 724, "githubusercontent": 725, "logos": 726, "logo": 727, "text": 728, "png": 729, "img": 730, "alt": 731, "src": 732, "light": 733, "width": 734, "55": 735, "h3": 736, "easy": 737, "fast": 738, "cheap": 739, "llm": 740, "serving": 741, "href": 742, "blog": 743, "arxiv": 744, "abs": 745, "2309": 746, "06180": 747, "paper": 748, "vllm_project": 749, "twitter": 750, "discuss": 751, "user": 752, "forum": 753, "developer": 754, "news": 755, "08": 756, "hosted": 757, "beijing": 758, "meetup": 759, "mp": 760, "weixin": 761, "qq": 762, "dgkwg1wfpwgo2jcdtqqhxa": 763, "scale": 764, "slides": 765, "drive": 766, "google": 767, "folders": 768, "1pid6nsflu43dzri0eatcpgxsazdvbbqf": 769, "recording": 770, "chaspark": 771, "1166916873711665152": 772, "05": 773, "nyc": 774, "lu": 775, "ma": 776, "c1rqyf1f": 777, "presentation": 778, "1_q_aw_iomjwuimf1s1ym": 779, "zhjxz8cuel0ijvaquoybea": 780, "usp": 781, "sharing": 782, "now": 783, "foundation": 784, "announcement": 785, "welcomes": 786, "01": 787, "excited": 788, "announce": 789, "alpha": 790, "v1": 791, "upgrade": 792, "7x": 793, "speedup": 794, "clean": 795, "optimized": 796, "loop": 797, "zero": 798, "overhead": 799, "prefix": 800, "caching": 801, "enhanced": 802, "multimodal": 803, "support": 804, "check": 805, "27": 806, "details": 807, "summary": 808, "04": 809, "asia": 810, "day": 811, "sginnovate": 812, "morning": 813, "evening": 814, "slots": 815, "remaining": 816, "inaugural": 817, "19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo": 818, "03": 819, "ollama": 820, "inference": 821, "night": 822, "16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u": 823, "first": 824, "china": 825, "n77gibl2coratqhtveazfg": 826, "1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq": 827, "east": 828, "coast": 829, "7mu4k4xx": 830, "1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs": 831, "slide": 832, "id": 833, "g31441846c39_0_0": 834, "02": 835, "ninth": 836, "h7g3kuj9": 837, "meta": 838, "1jzc_pzvxrvnsfvcw": 839, "v4cfxb6pn7zz2cyp_flwo05aqg": 840, "file": 841, "1zk5qejiktmlq2eqcxqzlljax3m9s7nwn": 842, "view": 843, "posted": 844, "eighth": 845, "zep56hui": 846, "cloud": 847, "1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4": 848, "1h24phewanyrl11xy5dxubvrc9f9kkjix": 849, "2024": 850, "joins": 851, "ecosystem": 852, "seventh": 853, "h0qvrajz": 854, "wi": 855, "th": 856, "snowflake": 857, "1e3cxqbv3jsfgp30swyvs3em_tw": 858, "ghohj9pajgk6kr54": 859, "1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a": 860, "coordinating": 861, "discussing": 862, "feel": 863, "join": 864, "ray": 865, "summit": 866, "held": 867, "track": 868, "opening": 869, "talk": 870, "1b_kqxphbtra_mdf": 871, "tr6i8rwdou5qotznceg2mkzxehm": 872, "learn": 873, "talks": 874, "youtube": 875, "playlist": 876, "list": 877, "plztswpqnepxl6aqwifuwuimlpfrvpksjr": 878, "09": 879, "sixth": 880, "87q3nvnh": 881, "1wrlgwytqfaotd5wcgspnhoaw3nq0e": 882, "9wqyp7ny93xrs": 883, "07": 884, "fifth": 885, "lp0gyjqr": 886, "aws": 887, "1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y": 888, "partnership": 889, "supports": 890, "llama": 891, "fp8": 892, "quantization": 893, "pipeline": 894, "parallelism": 895, "llama31": 896, "06": 897, "fourth": 898, "agivllm": 899, "cloudflare": 900, "bentoml": 901, "1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4": 902, "third": 903, "robloxandvllmmeetup2024": 904, "splashthat": 905, "roblox": 906, "1a": 907, "47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem": 908, "second": 909, "ygxbpzhl": 910, "ibm": 911, "12mi2skabnuw5rbwxdyy": 912, "hthth4imsnceoq10jdqbxga": 913, "2023": 914, "a16z": 915, "1ql": 916, "xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s": 917, "would": 918, "express": 919, "sincere": 920, "gratitude": 921, "andreessen": 922, "horowitz": 923, "30": 924, "supporting": 925, "generous": 926, "grant": 927, "research": 928, "fastchat": 929, "powered": 930, "lmsys": 931, "vicuna": 932, "chatbot": 933, "arena": 934, "chat": 935, "since": 936, "mid": 937, "april": 938, "library": 939, "originally": 940, "developed": 941, "sky": 942, "computing": 943, "lab": 944, "cs": 945, "berkeley": 946, "edu": 947, "uc": 948, "evolved": 949, "driven": 950, "both": 951, "academia": 952, "industry": 953, "state": 954, "art": 955, "throughput": 956, "efficient": 957, "value": 958, "pagedattention": 959, "continuous": 960, "batching": 961, "incoming": 962, "requests": 963, "hip": 964, "graph": 965, "quantizations": 966, "gptq": 967, "2210": 968, "17323": 969, "awq": 970, "2306": 971, "00978": 972, "autoround": 973, "05516": 974, "int4": 975, "int8": 976, "kernels": 977, "flashattention": 978, "flashinfer": 979, "speculative": 980, "decoding": 981, "chunked": 982, "prefill": 983, "flexible": 984, "seamless": 985, "popular": 986, "hugging": 987, "face": 988, "various": 989, "algorithms": 990, "parallel": 991, "sampling": 992, "beam": 993, "search": 994, "tensor": 995, "expert": 996, "distributed": 997, "streaming": 998, "outputs": 999, "openai": 1000, "server": 1001, "gpus": 1002, "cpus": 1003, "intel": 1004, "powerpc": 1005, "tpu": 1006, "neuron": 1007, "lora": 1008, "seamlessly": 1009, "huggingface": 1010, "transformer": 1011, "mixture": 1012, "deepseek": 1013, "v3": 1014, "embedding": 1015, "e5": 1016, "mistral": 1017, "modal": 1018, "llava": 1019, "supported": 1020, "supported_models": 1021, "getting": 1022, "started": 1023, "install": 1024, "pip": 1025, "getting_started": 1026, "installation": 1027, "gpu": 1028, "index": 1029, "wheel": 1030, "bash": 1031, "visit": 1032, "quickstart": 1033, "welcome": 1034, "collaborations": 1035, "sponsors": 1036, "compute": 1037, "resources": 1038, "thank": 1039, "your": 1040, "them": 1041, "alphabetical": 1042, "order": 1043, "keep": 1044, "consistent": 1045, "cash": 1046, "donations": 1047, "dropbox": 1048, "sequoia": 1049, "capital": 1050, "skywork": 1051, "zhenfund": 1052, "alibaba": 1053, "anyscale": 1054, "crusoe": 1055, "databricks": 1056, "deepinfra": 1057, "lambda": 1058, "nebius": 1059, "novita": 1060, "replicate": 1061, "runpod": 1062, "trainy": 1063, "san": 1064, "diego": 1065, "sponsor": 1066, "fundraising": 1067, "venue": 1068, "opencollective": 1069, "plan": 1070, "fund": 1071, "maintenance": 1072, "adoption": 1073, "citation": 1074, "cite": 1075, "bibtex": 1076, "inproceedings": 1077, "kwon2023efficient": 1078, "title": 1079, "author": 1080, "woosuk": 1081, "kwon": 1082, "zhuohan": 1083, "li": 1084, "siyuan": 1085, "zhuang": 1086, "ying": 1087, "sheng": 1088, "lianmin": 1089, "zheng": 1090, "cody": 1091, "hao": 1092, "yu": 1093, "joseph": 1094, "gonzalez": 1095, "zhang": 1096, "ion": 1097, "stoica": 1098, "booktitle": 1099, "proceedings": 1100, "acm": 1101, "sigops": 1102, "29th": 1103, "symposium": 1104, "operating": 1105, "systems": 1106, "principles": 1107, "start": 1108, "technical": 1109, "fellow": 1110, "partnerships": 1111, "lists": 1112, "mailto": 1113, "kit": 1114, "refer": 1115, "repo": 1116, "fill": 1117, "description": 1118, "ensuring": 1119, "checklist": 1120, "items": 1121, "bottom": 1122, "been": 1123, "result": 1124, "update": 1125, "essential": 1126, "elements": 1127, "effective": 1128, "fix": 1129, "link": 1130, "existing": 1131, "resolve": 1132, "command": 1133, "pasting": 1134, "necessary": 1135, "updating": 1136, "submitting": 1137, "read": 1138, "anything": 1139, "line": 1140, "removed": 1141, "hide": 1142, "navigation": 1143, "toc": 1144, "figure": 1145, "markdown": 1146, "span": 1147, "class": 1148, "60": 1149, "style": 1150, "strong": 1151, "script": 1152, "async": 1153, "defer": 1154, "buttons": 1155, "io": 1156, "js": 1157, "button": 1158, "show": 1159, "count": 1160, "true": 1161, "aria": 1162, "label": 1163, "star": 1164, "subscription": 1165, "icon": 1166, "octicon": 1167, "eye": 1168, "watch": 1169, "fork": 1170, "forked": 1171, "depends": 1172, "type": 1173, "looking": 1174, "recommend": 1175, "starting": 1176, "applications": 1177, "roadmap": 1178, "gaudi": 1179, "accelerators": 1180, "power": 1181, "trainium": 1182, "inferentia": 1183, "announcing": 1184, "intro": 1185, "sosp": 1186, "23x": 1187, "while": 1188, "reducing": 1189, "p50": 1190, "latency": 1191, "cade": 1192, "daniel": 1193, "et": 1194, "al": 1195, "meetups": 1196, "machete": 1197, "mixed": 1198, "precision": 1199, "cutlass": 1200, "gemm": 1201, "spiritual": 1202, "successor": 1203, "marlin": 1204, "kernel": 1205, "hopper": 1206, "architectures": 1207, "pairs": 1208, "epilogues": 1209, "easier": 1210, "add": 1211, "compared": 1212, "overview": 1213, "effectively": 1214, "performs": 1215, "python": 1216, "scale_type": 1217, "w_s": 1218, "dtype": 1219, "compute_type": 1220, "w_q": 1221, "w_z": 1222, "quantized": 1223, "weight": 1224, "matrix": 1225, "scales": 1226, "zeropoints": 1227, "so": 1228, "fma": 1229, "operations": 1230, "means": 1231, "must": 1232, "pre": 1233, "applied": 1234, "supplied": 1235, "assume": 1236, "subtracted": 1237, "optimization": 1238, "prepacking": 1239, "closely": 1240, "match": 1241, "core": 1242, "layouts": 1243, "allowing": 1244, "wider": 1245, "shared": 1246, "loads": 1247, "loading": 1248, "prepacked": 1249, "calling": 1250, "machete_gemm": 1251, "flow": 1252, "looks": 1253, "something": 1254, "import": 1255, "_custom_ops": 1256, "ops": 1257, "w_q_packed": 1258, "machete_prepack_b": 1259, "wtype": 1260, "output": 1261, "b_q": 1262, "b_type": 1263, "b_scales": 1264, "b_group_size": 1265, "group_size": 1266, "generation": 1267, "generate": 1268, "different": 1269, "tile": 1270, "shapes": 1271, "template": 1272, "instantiations": 1273, "py": 1274, "typeconfig": 1275, "appended": 1276, "impl_configs": 1277, "automatically": 1278, "generated": 1279, "assuming": 1280, "provide": 1281, "implconfig": 1282, "bundles": 1283, "scheduleconfig": 1284, "specialization": 1285, "default": 1286, "heuristic": 1287, "info": 1288, "scheduler": 1289, "etc": 1290, "differently": 1291, "problem": 1292, "almost": 1293, "never": 1294, "one": 1295, "works": 1296, "beneficial": 1297, "comes": 1298, "should": 1299, "provided": 1300, "maps": 1301, "schedule": 1302, "parameter": 1303, "define": 1304, "combinations": 1305, "with_zeropoints": 1306, "with_scales": 1307, "reduce": 1308, "compile": 1309, "times": 1310, "limiting": 1311, "introduction": 1312, "document": 1313, "describes": 1314, "implemented": 1315, "fusing": 1316, "de": 1317, "onto": 1318, "gemms": 1319, "currently": 1320, "symmetric": 1321, "weights": 1322, "asymmetric": 1323, "activations": 1324, "per": 1325, "token": 1326, "scaledepilogue": 1327, "bias": 1328, "scaledepiloguebias": 1329, "scaledepilogueazp": 1330, "scaledepilogueazppertoken": 1331, "instead": 1332, "passed": 1333, "epilogue": 1334, "induces": 1335, "redundant": 1336, "addition": 1337, "operation": 1338, "runtime": 1339, "underlying": 1340, "linear": 1341, "algebra": 1342, "activation": 1343, "rfc": 1344, "3975": 1345, "widehat": 1346, "matrices": 1347, "become": 1348, "math": 1349, "s_a": 1350, "j_a": 1351, "z_a": 1352, "s_b": 1353, "respectively": 1354, "point": 1355, "ones": 1356, "dimensions": 1357, "additional": 1358, "expanding": 1359, "further": 1360, "calculate": 1361, "follows": 1362, "left": 1363, "known": 1364, "ahead": 1365, "row": 1366, "equal": 1367, "mathbf": 1368, "vector": 1369, "column": 1370, "sums": 1371, "computes": 1372, "meaning": 1373, "parameters": 1374, "scale_a": 1375, "scalar": 1376, "scale_b": 1377, "always": 1378, "because": 1379, "term": 1380, "precomputed": 1381, "stored": 1382, "azp_with_adj": 1383, "points": 1384, "efficiently": 1385, "precompute": 1386, "pass": 1387, "above": 1388, "becomes": 1389, "outer": 1390, "product": 1391, "azp_adj": 1392, "adjustment": 1393, "azp": 1394, "computation": 1395, "dq": 1396, "configuration": 1397, "leverages": 1398, "config": 1399, "dictconfig": 1400, "functionality": 1401, "enable": 1402, "robust": 1403, "loggers": 1404, "offers": 1405, "two": 1406, "variables": 1407, "accommodate": 1408, "range": 1409, "simple": 1410, "inflexible": 1411, "complex": 1412, "vllm_configure_logging": 1413, "leaving": 1414, "vllm_logging_config_path": 1415, "unset": 1416, "leave": 1417, "fine": 1418, "grained": 1419, "custom": 1420, "path": 1421, "json": 1422, "controls": 1423, "whether": 1424, "takes": 1425, "enabled": 1426, "disabled": 1427, "running": 1428, "given": 1429, "root": 1430, "logger": 1431, "configured": 1432, "error": 1433, "occur": 1434, "allows": 1435, "specify": 1436, "alternative": 1437, "schema": 1438, "dictionary": 1439, "customize": 1440, "nhairs": 1441, "part": 1442, "container": 1443, "image": 1444, "log": 1445, "stdout": 1446, "console": 1447, "begin": 1448, "create": 1449, "logging_config": 1450, "formatters": 1451, "pythonjsonlogger": 1452, "jsonlogger": 1453, "jsonformatter": 1454, "handlers": 1455, "streamhandler": 1456, "formatter": 1457, "stream": 1458, "ext": 1459, "sys": 1460, "propagate": 1461, "false": 1462, "finally": 1463, "variable": 1464, "mistralai": 1465, "7b": 1466, "max": 1467, "len": 1468, "2048": 1469, "silence": 1470, "particular": 1471, "target": 1472, "configures": 1473, "won": 1474, "its": 1475, "messages": 1476, "overrides": 1477, "logging_utils": 1478, "newlineformatter": 1479, "datefmt": 1480, "levelname": 1481, "asctime": 1482, "filename": 1483, "lineno": 1484, "message": 1485, "debug": 1486, "example_noisy_logger": 1487, "prevent": 1488, "configuring": 1489, "turn": 1490, "silences": 1491, "profiling": 1492, "profile": 1493, "decode": 1494, "actual": 1495, "mix": 1496, "many": 1497, "already": 1498, "tested": 1499, "v6e": 1500, "installed": 1501, "according": 1502, "google_tpu": 1503, "several": 1504, "warmups": 1505, "enforce": 1506, "eager": 1507, "okay": 1508, "trace": 1509, "runs": 1510, "qwen": 1511, "qwen2": 1512, "instruct": 1513, "1024": 1514, "input": 1515, "tokens": 1516, "up": 1517, "attempt": 1518, "export": 1519, "xla_hlo_debug": 1520, "vllm_tpu_profile_duration_ms": 1521, "3000": 1522, "vllm_tpu_profile_delay_ms": 1523, "python3": 1524, "batch": 1525, "dir": 1526, "profiles": 1527, "70b": 1528, "32": 1529, "128": 1530, "decodes": 1531, "having": 1532, "extremely": 1533, "small": 1534, "1000": 1535, "skip": 1536, "hopefully": 1537, "2000": 1538, "rm": 1539, "rf": 1540, "cache": 1541, "xla_cache": 1542, "visualizing": 1543, "collected": 1544, "visualize": 1545, "tensorboard": 1546, "xla": 1547, "vm": 1548, "likely": 1549, "dependencies": 1550, "tensorflow": 1551, "cpu": 1552, "plugin": 1553, "etils": 1554, "importlib_resources": 1555, "directory": 1556, "saved": 1557, "http": 1558, "localhost": 1559, "6006": 1560, "browser": 1561, "logdir": 1562, "port": 1563, "basic": 1564, "provides": 1565, "primary": 1566, "interface": 1567, "doing": 1568, "interacting": 1569, "separate": 1570, "shows": 1571, "offline_inference": 1572, "rest": 1573, "scripts": 1574, "argument": 1575, "parser": 1576, "argparse": 1577, "arguments": 1578, "try": 1579, "help": 1580, "classify": 1581, "embed": 1582, "score": 1583, "accept": 1584, "inference_params": 1585, "max_tokens": 1586, "temperature": 1587, "top_p": 1588, "top_k": 1589, "passing": 1590, "experiment": 1591, "specifies": 1592, "loaded": 1593, "get_default_sampling_params": 1594, "auto": 1595, "folder": 1596, "max_new_tokens": 1597, "sets": 1598, "wide": 1599, "limit": 1600, "number": 1601, "gguf": 1602, "downloading": 1603, "huggingface_hub": 1604, "hf_hub_download": 1605, "repo_id": 1606, "bartowski": 1607, "phi": 1608, "medium": 1609, "4k": 1610, "iq2_m": 1611, "print": 1612, "printed": 1613, "tokenizer": 1614, "microsoft": 1615, "offload": 1616, "gb": 1617, "seen": 1618, "virtual": 1619, "way": 1620, "increase": 1621, "24": 1622, "virtually": 1623, "think": 1624, "34": 1625, "load": 1626, "13b": 1627, "bf16": 1628, "requires": 1629, "least": 1630, "26gb": 1631, "interconnect": 1632, "fly": 1633, "forward": 1634, "hf": 1635, "disaggregated": 1636, "demonstrate": 1637, "files": 1638, "sh": 1639, "helper": 1640, "prefill_example": 1641, "decode_example": 1642, "sequentially": 1643, "sure": 1644, "saving": 1645, "kv": 1646, "local_storage": 1647, "prompts": 1648, "txt": 1649, "important": 1650, "performing": 1651, "consists": 1652, "objects": 1653, "lines": 1654, "openai_batch": 1655, "openai_example_batch": 1656, "jsonl": 1657, "represents": 1658, "package": 1659, "reference": 1660, "platform": 1661, "requestinput": 1662, "completions": 1663, "embeddings": 1664, "endpoints": 1665, "coming": 1666, "soon": 1667, "requisites": 1668, "8b": 1669, "co": 1670, "hub": 1671, "machine": 1672, "cli": 1673, "login": 1674, "gated": 1675, "visiting": 1676, "card": 1677, "agreeing": 1678, "along": 1679, "download": 1680, "own": 1681, "working": 1682, "wget": 1683, "ve": 1684, "look": 1685, "cat": 1686, "custom_id": 1687, "method": 1688, "url": 1689, "role": 1690, "content": 1691, "helpful": 1692, "assistant": 1693, "hello": 1694, "world": 1695, "max_completion_tokens": 1696, "unhelpful": 1697, "tool": 1698, "designed": 1699, "called": 1700, "entrypoints": 1701, "run_batch": 1702, "383d1c59835645aeb2e07d004d62a826": 1703, "cmpl": 1704, "61c020e54b964d5a98fa7527bfcdd378": 1705, "object": 1706, "completion": 1707, "1715633336": 1708, "choices": 1709, "great": 1710, "meet": 1711, "tasks": 1712, "mind": 1713, "today": 1714, "logprobs": 1715, "null": 1716, "finish_reason": 1717, "stop": 1718, "stop_reason": 1719, "prompt_tokens": 1720, "25": 1721, "total_tokens": 1722, "56": 1723, "completion_tokens": 1724, "31": 1725, "42e3d09b14b04568afa3f1797751a267": 1726, "f44d049f6b3a42d4b2d7850bb1e31bcc": 1727, "runner": 1728, "urls": 1729, "accessible": 1730, "located": 1731, "integrating": 1732, "s3": 1733, "integrate": 1734, "storage": 1735, "presigned": 1736, "prerequisites": 1737, "bucket": 1738, "amazon": 1739, "amazons3": 1740, "userguide": 1741, "creating": 1742, "awscli": 1743, "credentials": 1744, "interactively": 1745, "boto3": 1746, "upload": 1747, "cp": 1748, "my_bucket": 1749, "my_input_file": 1750, "sdk": 1751, "replace": 1752, "my_output_file": 1753, "placeholders": 1754, "names": 1755, "awsdocs": 1756, "doc": 1757, "example_code": 1758, "s3_basics": 1759, "presigned_url": 1760, "botocore": 1761, "exceptions": 1762, "clienterror": 1763, "def": 1764, "generate_presigned_url": 1765, "s3_client": 1766, "client_method": 1767, "method_parameters": 1768, "expires_in": 1769, "param": 1770, "client": 1771, "name": 1772, "seconds": 1773, "valid": 1774, "return": 1775, "clientmethod": 1776, "params": 1777, "expiresin": 1778, "except": 1779, "raise": 1780, "input_url": 1781, "get_object": 1782, "3600": 1783, "output_url": 1784, "put_object": 1785, "west": 1786, "amazonaws": 1787, "awsaccesskeyid": 1788, "abcdefghijklmnopqrst": 1789, "signature": 1790, "abcdefghijklmnopqrstuvwxyz12345": 1791, "expires": 1792, "1715800091": 1793, "section": 1794, "terminal": 1795, "endpoint": 1796, "intfloat": 1797, "even": 1798, "long": 1799, "earlier": 1800, "db0f71f7dec244e6bce530e0b4ef908b": 1801, "status_code": 1802, "200": 1803, "request_id": 1804, "3580bf4d4ae54d52b67eee266a6eab20": 1805, "embd": 1806, "33ac2efa7996430184461f2e38529746": 1807, "444647": 1808, "016204833984375": 1809, "0092010498046875": 1810, "0018358230590820312": 1811, "0028228759765625": 1812, "001422882080078125": 1813, "0031147003173828125": 1814, "baai": 1815, "bge": 1816, "reranker": 1817, "m3": 1818, "text_1": 1819, "france": 1820, "text_2": 1821, "brazil": 1822, "brasilia": 1823, "paris": 1824, "f87c5c4539184f618e555744a2965987": 1825, "806ab64512e44071b37d3f7ccd291413": 1826, "4ee45236897b4d29907d49b01298cdb1": 1827, "1737847944": 1828, "0010900497436523438": 1829, "37": 1830, "prompt_tokens_details": 1831, "41990c51a26d4fac8419077f12871099": 1832, "73ce66379026482699f81974e14e1e99": 1833, "13f2ffe6ba40460fbf9f7f00ad667d75": 1834, "001094818115234375": 1835, "omni": 1836, "thinker": 1837, "audio": 1838, "video": 1839, "qwen2_5_omni": 1840, "only_thinker": 1841, "mixed_modalities": 1842, "vision": 1843, "inputs": 1844, "engine": 1845, "interleaved": 1846, "modalities": 1847, "yet": 1848, "vllm_use_v1": 1849, "use_audio_in_video": 1850, "audios": 1851, "multi_audios": 1852, "modality": 1853, "audio_language": 1854, "vision_language": 1855, "disagg_proxy_demo": 1856, "demonstrates": 1857, "xpyd": 1858, "kv_events": 1859, "opentelemetry": 1860, "poc": 1861, "packages": 1862, "26": 1863, "exporter": 1864, "otlp": 1865, "semantic": 1866, "conventions": 1867, "jaeger": 1868, "docker": 1869, "jaegertracing": 1870, "57": 1871, "collector_zipkin_host_port": 1872, "9411": 1873, "6831": 1874, "udp": 1875, "6832": 1876, "5778": 1877, "16686": 1878, "4317": 1879, "4318": 1880, "14250": 1881, "14268": 1882, "14269": 1883, "shell": 1884, "ip": 1885, "jaeger_ip": 1886, "inspect": 1887, "networksettings": 1888, "ipaddress": 1889, "otel_exporter_otlp_traces_endpoint": 1890, "grpc": 1891, "insecure": 1892, "connections": 1893, "otel_service_name": 1894, "otel_exporter_otlp_traces_insecure": 1895, "facebook": 1896, "opt": 1897, "125m": 1898, "traces": 1899, "context": 1900, "dummy": 1901, "dummy_client": 1902, "webui": 1903, "pane": 1904, "select": 1905, "hit": 1906, "imgur": 1907, "gyhhfjo": 1908, "clicking": 1909, "spans": 1910, "tags": 1911, "demo": 1912, "containing": 1913, "prompt": 1914, "metadata": 1915, "opf6cbl": 1916, "protocol": 1917, "protobuf": 1918, "transport": 1919, "otel_exporter_otlp_traces_protocol": 1920, "instrumentation": 1921, "fastapi": 1922, "automatic": 1923, "instrument": 1924, "hywvooj": 1925, "prometheus": 1926, "grafana": 1927, "connect": 1928, "metric": 1929, "stack": 1930, "launch": 1931, "checkout": 1932, "methods": 1933, "websites": 1934, "compose": 1935, "linux": 1936, "entrypoint": 1937, "servers": 1938, "submit": 1939, "sample": 1940, "datasets": 1941, "anon8231489123": 1942, "sharegpt_vicuna_unfiltered": 1943, "sharegpt_v3_unfiltered_cleaned_split": 1944, "bench": 1945, "dataset": 1946, "sharegpt": 1947, "rate": 1948, "navigating": 1949, "8000": 1950, "metrics": 1951, "exposed": 1952, "username": 1953, "admin": 1954, "password": 1955, "datasources": 1956, "page": 1957, "connection": 1958, "containers": 1959, "creates": 1960, "dns": 1961, "9090": 1962, "click": 1963, "save": 1964, "green": 1965, "saying": 1966, "successfully": 1967, "queried": 1968, "datasource": 1969, "screen": 1970, "r2vh9vw": 1971, "structured": 1972, "capabilities": 1973, "constraint": 1974, "responses": 1975, "concurrent": 1976, "choice": 1977, "3b": 1978, "reasoning": 1979, "r1": 1980, "distill": 1981, "deepseek_r1": 1982, "want": 1983, "standalone": 1984, "uv": 1985, "uvx": 1986, "git": 1987, "subdirectory": 1988, "online_serving": 1989, "structured_outputs": 1990, "tip": 1991, "remotely": 1992, "openai_base_url": 1993, "remote_url": 1994, "constraints": 1995, "structural_tag": 1996, "regex": 1997, "helm": 1998, "charts": 1999, "chart": 2000, "deploying": 2001, "application": 2002, "autoscaling": 2003, "resource": 2004, "yaml": 2005, "defines": 2006, "maintainers": 2007, "ct": 2008, "lintconf": 2009, "linting": 2010, "rules": 2011, "values": 2012, "validating": 2013, "templates": 2014, "_helpers": 2015, "tpl": 2016, "defining": 2017, "configmap": 2018, "configmaps": 2019, "kubernetes": 2020, "deployments": 2021, "hpa": 2022, "horizontal": 2023, "pod": 2024, "autoscaler": 2025, "job": 2026, "jobs": 2027, "poddisruptionbudget": 2028, "budget": 2029, "pvc": 2030, "persistent": 2031, "volume": 2032, "claims": 2033, "secrets": 2034, "services": 2035, "processing": 2036, "handle": 2037, "exceeds": 2038, "maximum": 2039, "length": 2040, "quick": 2041, "very": 2042, "texts": 2043, "3m": 2044, "model_name": 2045, "jinaai": 2046, "jina": 2047, "max_embed_len": 2048, "1048576": 2049, "documents": 2050, "multilingual": 2051, "3072000": 2052, "comprehensive": 2053, "startup": 2054, "override": 2055, "pooler": 2056, "pooling_type": 2057, "normalize": 2058, "enable_chunked_processing": 2059, "pooling": 2060, "strategy": 2061, "chunk": 2062, "cross": 2063, "aggregation": 2064, "mean": 2065, "native": 2066, "combination": 2067, "component": 2068, "chunks": 2069, "weighted": 2070, "averaging": 2071, "counts": 2072, "optimal": 2073, "processed": 2074, "31090": 2075, "gpu_count": 2076, "cls": 2077, "last": 2078, "affects": 2079, "api_key": 2080, "empty": 2081, "authentication": 2082, "longer": 2083, "max_model_len": 2084, "smart": 2085, "chunking": 2086, "split": 2087, "max_position_embeddings": 2088, "maintain": 2089, "unified": 2090, "separately": 2091, "combined": 2092, "across": 2093, "dimensionality": 2094, "standard": 2095, "handling": 2096, "accepted": 2097, "rejected": 2098, "vllm_allow_long_max_model_len": 2099, "extreme": 2100, "academic": 2101, "papers": 2102, "references": 2103, "legal": 2104, "contracts": 2105, "books": 2106, "entire": 2107, "chapters": 2108, "repositories": 2109, "codebases": 2110, "aspect": 2111, "minimal": 2112, "proportional": 2113, "scalable": 2114, "quality": 2115, "short": 2116, "normal": 2117, "baseline": 2118, "100k": 2119, "consistency": 2120, "reproducible": 2121, "troubleshooting": 2122, "valueerror": 2123, "position": 2124, "4096": 2125, "solution": 2126, "runtimeerror": 2127, "adjusting": 2128, "fewer": 2129, "slow": 2130, "expected": 2131, "due": 2132, "calls": 2133, "logs": 2134, "activity": 2135, "150000": 2136, "max_chunk_size": 2137, "extend": 2138, "architecture": 2139, "lengths": 2140, "validate": 2141, "updates": 2142, "simplified": 2143, "millions": 2144, "better": 2145, "exceed": 2146, "limits": 2147, "backward": 2148, "continue": 2149, "lmcache": 2150, "prefilling": 2151, "offloading": 2152, "nixl": 2153, "simply": 2154, "dynamo": 2155, "hf_token": 2156, "cd": 2157, "disagg_prefill_lmcache_v1": 2158, "disagg_example_nixl": 2159, "components": 2160, "disagg_vllm_launcher": 2161, "launches": 2162, "proxy": 2163, "disagg_proxy_server": 2164, "coordinates": 2165, "prefiller": 2166, "decoder": 2167, "configs": 2168, "generates": 2169, "cpu_offload_lmcache": 2170, "implementation": 2171, "kv_cache_sharing_lmcache_v1": 2172, "share": 2173, "caches": 2174, "disaggregated_prefill_lmcache_v0": 2175, "json_tip": 2176, "inc": 2177, "options": 2178, "equivalent": 2179, "arg": 2180, "key1": 2181, "value1": 2182, "key2": 2183, "key3": 2184, "value2": 2185, "additionally": 2186, "individually": 2187, "key4": 2188, "value3": 2189, "value4": 2190, "value5": 2191, "manage": 2192, "viewing": 2193, "commands": 2194, "collect": 2195, "env": 2196, "starts": 2197, "8100": 2198, "over": 2199, "unix": 2200, "domain": 2201, "socket": 2202, "uds": 2203, "tmp": 2204, "sock": 2205, "groups": 2206, "listgroup": 2207, "modelconfig": 2208, "num": 2209, "seqs": 2210, "keyword": 2211, "pager": 2212, "directly": 2213, "host": 2214, "hi": 2215, "tests": 2216, "extra": 2217, "1b": 2218, "random": 2219, "collecting": 2220, "detailed": 2221, "subcommand": 2222, "readme": 2223, "regular": 2224, "francisco": 2225, "bay": 2226, "area": 2227, "months": 2228, "guest": 2229, "speakers": 2230, "insights": 2231, "materials": 2232, "august": 2233, "2nd": 2234, "7th": 2235, "3rd": 2236, "march": 2237, "27th": 2238, "16th": 2239, "11th": 2240, "february": 2241, "january": 2242, "22nd": 2243, "november": 2244, "14th": 2245, "september": 2246, "9th": 2247, "htt": 2248, "ps": 2249, "july": 2250, "24th": 2251, "june": 2252, "31st": 2253, "youtu": 2254, "y0c": 2255, "duvenzq": 2256, "torch": 2257, "m0dmtfli": 2258, "dg": 2259, "october": 2260, "5th": 2261, "potentially": 2262, "locations": 2263, "interested": 2264, "speaking": 2265, "sponsoring": 2266, "transformers": 2267, "reinforcement": 2268, "trl": 2269, "tools": 2270, "train": 2271, "supervised": 2272, "tuning": 2273, "sft": 2274, "relative": 2275, "grpo": 2276, "direct": 2277, "preference": 2278, "dpo": 2279, "reward": 2280, "modeling": 2281, "integrated": 2282, "speeding_up_training": 2283, "use_vllm": 2284, "flag": 2285, "grpoconfig": 2286, "grpo_trainer": 2287, "onlinedpoconfig": 2288, "online_dpo_trainer": 2289, "human": 2290, "rlhf": 2291, "technique": 2292, "tunes": 2293, "desired": 2294, "behaviors": 2295, "libraries": 2296, "openrlhf": 2297, "verl": 2298, "volcengine": 2299, "unsloth": 2300, "unslothai": 2301, "don": 2302, "training": 2303, "processes": 2304, "colocated": 2305, "rlhf_colocate": 2306, "utilities": 2307, "rlhf_utils": 2308, "notebooks": 2309, "showing": 2310, "4b": 2311, "colab": 2312, "nb": 2313, "qwen3_": 2314, "ipynb": 2315, "walks": 2316, "probe": 2317, "readiness": 2318, "failure": 2319, "keyboardinterrupt": 2320, "terminated": 2321, "conclusion": 2322, "alternatively": 2323, "deploy": 2324, "frameworks": 2325, "inftyai": 2326, "llmaz": 2327, "integrations": 2328, "kserve": 2329, "kuberay": 2330, "sigs": 2331, "lws": 2332, "llamastack": 2333, "substratusai": 2334, "kubeai": 2335, "aibrix": 2336, "production": 2337, "demonstration": 2338, "purposes": 2339, "par": 2340, "secret": 2341, "storing": 2342, "eof": 2343, "kubectl": 2344, "apiversion": 2345, "persistentvolumeclaim": 2346, "spec": 2347, "accessmodes": 2348, "readwriteonce": 2349, "volumemode": 2350, "filesystem": 2351, "50gi": 2352, "opaque": 2353, "next": 2354, "apps": 2355, "replicas": 2356, "selector": 2357, "matchlabels": 2358, "app": 2359, "labels": 2360, "bin": 2361, "args": 2362, "hugging_face_hub_token": 2363, "valuefrom": 2364, "secretkeyref": 2365, "ports": 2366, "containerport": 2367, "volumemounts": 2368, "mountpath": 2369, "volumes": 2370, "claimname": 2371, "tcp": 2372, "targetport": 2373, "clusterip": 2374, "might": 2375, "couple": 2376, "minutes": 2377, "waiting": 2378, "uvicorn": 2379, "press": 2380, "ctrl": 2381, "quit": 2382, "requisite": 2383, "cluster": 2384, "scheduling": 2385, "store": 2386, "hostpath": 2387, "namespace": 2388, "storageclassname": 2389, "accessing": 2390, "stringdata": 2391, "replace_with_token": 2392, "deploys": 2393, "needs": 2394, "shm": 2395, "emptydir": 2396, "sizelimit": 2397, "2gi": 2398, "max_num_batched_tokens": 2399, "20g": 2400, "6g": 2401, "dev": 2402, "livenessprobe": 2403, "httpget": 2404, "health": 2405, "initialdelayseconds": 2406, "periodseconds": 2407, "readinessprobe": 2408, "8gi": 2409, "hostnetwork": 2410, "hostipc": 2411, "rocm6": 2412, "2_mi300_ubuntu20": 2413, "04_py3": 2414, "9_vllm_0": 2415, "securitycontext": 2416, "seccompprofile": 2417, "unconfined": 2418, "runasgroup": 2419, "44": 2420, "sys_ptrace": 2421, "steps": 2422, "k8s": 2423, "device": 2424, "master": 2425, "expose": 2426, "80": 2427, "useful": 2428, "sessionaffinity": 2429, "none": 2430, "curl": 2431, "svc": 2432, "correctly": 2433, "deployed": 2434, "receive": 2435, "failurethreshold": 2436, "too": 2437, "kill": 2438, "indications": 2439, "happened": 2440, "events": 2441, "failed": 2442, "restarted": 2443, "mitigate": 2444, "identify": 2445, "ideal": 2446, "removing": 2447, "probes": 2448, "manifest": 2449, "measuring": 2450, "much": 2451, "ready": 2452, "scaling": 2453, "ml": 2454, "leveraging": 2455, "outlined": 2456, "able": 2457, "encounter": 2458, "suggestions": 2459, "ipc": 2460, "qwen3": 2461, "6b": 2462, "engines": 2463, "podman": 2464, "engine_args": 2465, "hood": 2466, "particularly": 2467, "avoid": 2468, "licensing": 2469, "gh": 2470, "8030": 2471, "license": 2472, "dockerfile": 2473, "top": 2474, "layer": 2475, "installs": 2476, "matches": 2477, "building": 2478, "optionally": 2479, "max_jobs": 2480, "nvcc_threads": 2481, "docker_buildkit": 2482, "types": 2483, "widest": 2484, "distribution": 2485, "torch_cuda_arch_list": 2486, "selinux": 2487, "labeling": 2488, "buildah": 2489, "discussions": 2490, "4184": 2491, "arm64": 2492, "aarch64": 2493, "grace": 2494, "writing": 2495, "nightly": 2496, "experimental": 2497, "modules": 2498, "compiled": 2499, "flags": 2500, "speed": 2501, "however": 2502, "substantially": 2503, "larger": 2504, "benefits": 2505, "substantial": 2506, "gh200": 2507, "15gb": 2508, "1475s": 2509, "min": 2510, "93gb": 2511, "use_existing_torch": 2512, "66": 2513, "ptx": 2514, "arm": 2515, "x86_64": 2516, "compilation": 2517, "qemu": 2518, "emulate": 2519, "register": 2520, "static": 2521, "multiarch": 2522, "reset": 2523, "yes": 2524, "replaced": 2525, "images": 2526, "supposed": 2527, "home": 2528, "nccl": 2529, "cu12": 2530, "libnccl": 2531, "permissions": 2532, "parent": 2533, "directories": 2534, "vllm_nccl_so_path": 2535, "nginx": 2536, "balancer": 2537, "nginxloadbalancer": 2538, "assumes": 2539, "cloned": 2540, "re": 2541, "vllm_root": 2542, "pwd": 2543, "named": 2544, "conf": 2545, "cmd": 2546, "daemon": 2547, "off": 2548, "lb": 2549, "nginx_conf": 2550, "ll": 2551, "another": 2552, "vllmn": 2553, "max_fails": 2554, "fail_timeout": 2555, "10000s": 2556, "entry": 2557, "upstream": 2558, "backend": 2559, "least_conn": 2560, "vllm0": 2561, "vllm1": 2562, "listen": 2563, "location": 2564, "proxy_pass": 2565, "proxy_set_header": 2566, "real": 2567, "remote_addr": 2568, "forwarded": 2569, "proxy_add_x_forwarded_for": 2570, "proto": 2571, "behind": 2572, "settings": 2573, "shown": 2574, "http_proxy": 2575, "https_proxy": 2576, "vllm_nginx": 2577, "cached": 2578, "somewhere": 2579, "else": 2580, "hf_cache_dir": 2581, "wait": 2582, "leverage": 2583, "downloaded": 2584, "again": 2585, "vllm_cpu_kvcache_space": 2586, "vllm_cpu_omp_threads_bind": 2587, "adjust": 2588, "mkdir": 2589, "itd": 2590, "24gb": 2591, "8081": 2592, "8082": 2593, "grep": 2594, "generative": 2595, "generative_models": 2596, "pooling_models": 2597, "task": 2598, "alongside": 2599, "natively": 2600, "found": 2601, "model_executor": 2602, "mm": 2603, "implementations": 2604, "apply_model": 2605, "transformersforcausallm": 2606, "transformersformultimodallm": 2607, "force": 2608, "model_impl": 2609, "impl": 2610, "openai_compatible_server": 2611, "fully": 2612, "optimise": 2613, "degraded": 2614, "comparing": 2615, "whole": 2616, "exists": 2617, "contrast": 2618, "attribute": 2619, "backbone": 2620, "slight": 2621, "difference": 2622, "neither": 2623, "still": 2624, "customizing": 2625, "custom_models": 2626, "correct": 2627, "structure": 2628, "present": 2629, "auto_map": 2630, "automodel": 2631, "customisation": 2632, "done": 2633, "mymodel": 2634, "mymodelforcausallm": 2635, "trust_remote_code": 2636, "model_dir": 2637, "modifications": 2638, "kwargs": 2639, "down": 2640, "myattention": 2641, "all_attention_functions": 2642, "call": 2643, "_supports_attention_backend": 2644, "modeling_my_model": 2645, "pretrainedmodel": 2646, "nn": 2647, "module": 2648, "self": 2649, "hidden_states": 2650, "attention_interface": 2651, "_attn_implementation": 2652, "attn_output": 2653, "attn_weights": 2654, "query_states": 2655, "key_states": 2656, "value_states": 2657, "happens": 2658, "background": 2659, "is_backend_compatible": 2660, "base_model_tp_plan": 2661, "base_model_pp_plan": 2662, "configuration_my_model": 2663, "pretrainedconfig": 2664, "myconfig": 2665, "layers": 2666, "self_attn": 2667, "k_proj": 2668, "colwise": 2669, "v_proj": 2670, "o_proj": 2671, "rowwise": 2672, "mlp": 2673, "gate_proj": 2674, "up_proj": 2675, "down_proj": 2676, "embed_tokens": 2677, "input_ids": 2678, "inputs_embeds": 2679, "attention_mask": 2680, "norm": 2681, "dict": 2682, "qualified": 2683, "patterns": 2684, "styles": 2685, "child": 2686, "tuple": 2687, "str": 2688, "stages": 2689, "modulelist": 2690, "element": 2691, "hf_home": 2692, "package_reference": 2693, "environment_variables": 2694, "hfhome": 2695, "inside": 2696, "field": 2697, "listed": 2698, "_need_": 2699, "easiest": 2700, "really": 2701, "program": 2702, "my": 2703, "encode": 2704, "returns": 2705, "hidden": 2706, "states": 2707, "indicates": 2708, "instructions": 2709, "implement": 2710, "choose": 2711, "prefer": 2712, "guides": 2713, "huggingfaceh4": 2714, "zephyr": 2715, "beta": 2716, "eval_results": 2717, "scan": 2718, "verbose": 2719, "delete": 2720, "tui": 2721, "interactive": 2722, "revisions": 2723, "selected": 2724, "counting": 2725, "438": 2726, "9m": 2727, "nothing": 2728, "deleted": 2729, "ago": 2730, "a5beb1e3": 2731, "modified": 2732, "3g": 2733, "d4aa6901": 2734, "1g": 2735, "2cfc18c9": 2736, "space": 2737, "enter": 2738, "modification": 2739, "confirm": 2740, "revision": 2741, "deletion": 2742, "total": 2743, "tips": 2744, "globally": 2745, "session": 2746, "interpreter": 2747, "os": 2748, "environ": 2749, "modelscope": 2750, "cn": 2751, "vllm_use_modelscope": 2752, "legend": 2753, "planned": 2754, "limitations": 2755, "primarily": 2756, "llmgenerate": 2757, "llmchat": 2758, "white": 2759, "nowrap": 2760, "pp": 2761, "parallelism_scaling": 2762, "8779": 2763, "aquilaforcausallm": 2764, "aquila": 2765, "aquila2": 2766, "aquilachat": 2767, "arceeforcausallm": 2768, "arcee": 2769, "afm": 2770, "5b": 2771, "arcticforcausallm": 2772, "arctic": 2773, "baichuanforcausallm": 2774, "baichuan2": 2775, "baichuan": 2776, "bailingmoeforcausallm": 2777, "ling": 2778, "inclusionai": 2779, "lite": 2780, "plus": 2781, "bambaforcausallm": 2782, "bamba": 2783, "9b": 2784, "bloomforcausallm": 2785, "bloom": 2786, "bloomz": 2787, "bloomchat": 2788, "bigscience": 2789, "bartforconditionalgeneration": 2790, "bart": 2791, "cnn": 2792, "mbartforconditionalgeneration": 2793, "mbart": 2794, "ro": 2795, "50": 2796, "chatglmmodel": 2797, "chatglmforconditionalgeneration": 2798, "chatglm": 2799, "zai": 2800, "chatglm2": 2801, "chatglm3": 2802, "shieldlm": 2803, "cohereforcausallm": 2804, "cohere2forcausallm": 2805, "coherelabs": 2806, "c4ai": 2807, "v01": 2808, "r7b": 2809, "dbrxforcausallm": 2810, "dbrx": 2811, "decilmforcausallm": 2812, "decilm": 2813, "3_3": 2814, "nemotron": 2815, "super": 2816, "49b": 2817, "deepseekforcausallm": 2818, "67b": 2819, "deepseekv2forcausallm": 2820, "deepseekv3forcausallm": 2821, "dots1forcausallm": 2822, "dots": 2823, "llm1": 2824, "rednote": 2825, "hilab": 2826, "inst": 2827, "ernie4_5forcausallm": 2828, "ernie4": 2829, "baidu": 2830, "ernie": 2831, "pt": 2832, "ernie4_5_moeforcausallm": 2833, "5moe": 2834, "21b": 2835, "a3b": 2836, "300b": 2837, "a47b": 2838, "exaoneforcausallm": 2839, "exaone": 2840, "lgai": 2841, "exaone4forcausallm": 2842, "32b": 2843, "fairseq2llamaforcausallm": 2844, "fairseq2": 2845, "mgleize": 2846, "falconforcausallm": 2847, "falcon": 2848, "tiiuae": 2849, "40b": 2850, "rw": 2851, "falconmambaforcausallm": 2852, "falconmamba": 2853, "mamba": 2854, "falconh1forcausallm": 2855, "h1": 2856, "34b": 2857, "gemmaforcausallm": 2858, "gemma": 2859, "2b": 2860, "gemma2forcausallm": 2861, "27b": 2862, "gemma3forcausallm": 2863, "gemma3nforcausallm": 2864, "3n": 2865, "e2b": 2866, "e4b": 2867, "glmforcausallm": 2868, "glm": 2869, "glm4forcausallm": 2870, "0414": 2871, "glm4moeforcausallm": 2872, "gpt2lmheadmodel": 2873, "gpt": 2874, 