{"def": 0, "load_module_from_path": 1, "module_name": 2, "path": 3, "spec": 4, "importlib": 5, "util": 6, "spec_from_file_location": 7, "module": 8, "module_from_spec": 9, "sys": 10, "modules": 11, "loader": 12, "exec_module": 13, "return": 14, "is_sccache_available": 15, "bool": 16, "which": 17, "sccache": 18, "none": 19, "int": 20, "os": 21, "getenv": 22, "vllm_disable_sccache": 23, "is_ccache_available": 24, "ccache": 25, "is_ninja_available": 26, "ninja": 27, "is_url_available": 28, "url": 29, "str": 30, "from": 31, "urllib": 32, "request": 33, "import": 34, "urlopen": 35, "status": 36, "try": 37, "except": 38, "exception": 39, "false": 40, "200": 41, "class": 42, "cmakeextension": 43, "extension": 44, "__init__": 45, "self": 46, "name": 47, "cmake_lists_dir": 48, "kwa": 49, "super": 50, "sources": 51, "py_limited_api": 52, "true": 53, "abspath": 54, "cmake_build_ext": 55, "build_ext": 56, "dict": 57, "directories": 58, "have": 59, "been": 60, "configured": 61, "did_config": 62, "determine": 63, "number": 64, "compilation": 65, "jobs": 66, "optionally": 67, "nvcc": 68, "compile": 69, "threads": 70, "compute_num_jobs": 71, "num_jobs": 72, "either": 73, "value": 74, "max_jobs": 75, "environment": 76, "variable": 77, "defined": 78, "cpus": 79, "available": 80, "envs": 81, "logger": 82, "info": 83, "using": 84, "else": 85, "sched_getaffinity": 86, "isn": 87, "universally": 88, "so": 89, "fall": 90, "back": 91, "cpu_count": 92, "we": 93, "get": 94, "error": 95, "here": 96, "len": 97, "attributeerror": 98, "nvcc_threads": 99, "_is_cuda": 100, "get_nvcc_cuda_version": 101, "version": 102, "11": 103, "when": 104, "set": 105, "reduce": 106, "avoid": 107, "overloading": 108, "system": 109, "max": 110, "perform": 111, "cmake": 112, "configuration": 113, "single": 114, "configure": 115, "ext": 116, "ve": 117, "already": 118, "cmakelists": 119, "txt": 120, "exit": 121, "early": 122, "select": 123, "build": 124, "type": 125, "note": 126, "optimization": 127, "level": 128, "debug": 129, "default_cfg": 130, "relwithdebinfo": 131, "cfg": 132, "cmake_build_type": 133, "cmake_args": 134, "dcmake_build_type": 135, "format": 136, "dvllm_target_device": 137, "vllm_target_device": 138, "verbose": 139, "dcmake_verbose_makefile": 140, "dcmake_c_compiler_launcher": 141, "dcmake_cxx_compiler_launcher": 142, "dcmake_cuda_compiler_launcher": 143, "dcmake_hip_compiler_launcher": 144, "elif": 145, "pass": 146, "python": 147, "executable": 148, "can": 149, "find": 150, "exact": 151, "match": 152, "dvllm_python_executable": 153, "reuse": 154, "dependencies": 155, "subsequent": 156, "calls": 157, "dvllm_python_path": 158, "join": 159, "override": 160, "base": 161, "directory": 162, "fetchcontent": 163, "downloads": 164, "root": 165, "deps": 166, "allows": 167, "sharing": 168, "between": 169, "profiles": 170, "plays": 171, "more": 172, "nicely": 173, "fetchcontent_base_dir": 174, "fc_base_dir": 175, "root_dir": 176, "environ": 177, "dfetchcontent_base_dir": 178, "setup": 179, "parallelism": 180, "tool": 181, "dnvcc_threads": 182, "build_tool": 183, "dcmake_job_pool_compile": 184, "string": 185, "dcmake_job_pools": 186, "default": 187, "whatever": 188, "picks": 189, "make": 190, "sure": 191, "use": 192, "cuda_home": 193, "dcmake_cuda_compiler": 194, "bin": 195, "subprocess": 196, "check_call": 197, "cwd": 198, "build_temp": 199, "build_extensions": 200, "ensure": 201, "present": 202, "working": 203, "check_output": 204, "oserror": 205, "raise": 206, "runtimeerror": 207, "cannot": 208, "create": 209, "does": 210, "exist": 211, "exists": 212, "makedirs": 213, "targets": 214, "target_name": 215, "removeprefix": 216, "vllm": 217, "vllm_flash_attn": 218, "all": 219, "extensions": 220, "append": 221, "build_args": 222, "target": 223, "install": 224, "libraries": 225, "proper": 226, "location": 227, "outdir": 228, "get_ext_fullpath": 229, "parent": 230, "absolute": 231, "skip": 232, "same": 233, "continue": 234, "appends": 235, "prefix": 236, "contains": 237, "need": 238, "remove": 239, "range": 240, "count": 241, "should": 242, "actually": 243, "components": 244, "install_args": 245, "component": 246, "run": 247, "first": 248, "standard": 249, "command": 250, "copy": 251, "py": 252, "build_lib": 253, "current": 254, "included": 255, "editable": 256, "glob": 257, "files": 258, "recursive": 259, "file": 260, "dst_file": 261, "split": 262, "print": 263, "copying": 264, "dirname": 265, "exist_ok": 266, "copy_file": 267, "precompiled_build_ext": 268, "disables": 269, "building": 270, "precompiled": 271, "binaries": 272, "assert": 273, "vllm_use_precompiled": 274, "only": 275, "supported": 276, "cuda": 277, "builds": 278, "skipping": 279, "precompiled_wheel_utils": 280, "extracts": 281, "other": 282, "existing": 283, "wheel": 284, "staticmethod": 285, "extract_precompiled_and_patch_package": 286, "wheel_url_or_path": 287, "tempfile": 288, "zipfile": 289, "temp_dir": 290, "isfile": 291, "wheel_filename": 292, "mkdtemp": 293, "wheels": 294, "wheel_path": 295, "downloading": 296, "urlretrieve": 297, "filename": 298, "package_data_patch": 299, "files_to_copy": 300, "_c": 301, "abi3": 302, "_moe_c": 303, "_flashmla_c": 304, "_vllm_fa2_c": 305, "_vllm_fa3_c": 306, "cumem_allocator": 307, "compiled_regex": 308, "re": 309, "file_members": 310, "list": 311, "filter": 312, "lambda": 313, "filelist": 314, "extract": 315, "target_path": 316, "open": 317, "src": 318, "wb": 319, "dst": 320, "shutil": 321, "copyfileobj": 322, "pkg": 323, "replace": 324, "setdefault": 325, "basename": 326, "finally": 327, "removing": 328, "temporary": 329, "rmtree": 330, "get_base_commit_in_main_branch": 331, "force": 332, "nightly": 333, "mainly": 334, "used": 335, "ci": 336, "testing": 337, "vllm_test_use_precompiled_nightly_wheel": 338, "latest": 339, "commit": 340, "hash": 341, "upstream": 342, "main": 343, "branch": 344, "resp_json": 345, "curl": 346, "https": 347, "api": 348, "github": 349, "com": 350, "repos": 351, "project": 352, "commits": 353, "decode": 354, "utf": 355, "upstream_main_commit": 356, "json": 357, "loads": 358, "sha": 359, "docker": 360, "context": 361, "git": 362, "may": 363, "immutable": 364, "missing": 365, "vllm_docker_build_context": 366, "check": 367, "local": 368, "repo": 369, "cat": 370, "calledprocesserror": 371, "fetch": 372, "remote": 373, "repository": 374, "update": 375, "any": 376, "branches": 377, "ensures": 378, "ref": 379, "its": 380, "history": 381, "our": 382, "current_branch": 383, "show": 384, "strip": 385, "base_commit": 386, "merge": 387, "valueerror": 388, "err": 389, "warning": 390, "failed": 391, "compatible": 392, "your": 393, "dev": 394, "_no_device": 395, "empty": 396, "has_cuda": 397, "torch": 398, "_is_neuron": 399, "_is_tpu": 400, "_is_hip": 401, "rocm": 402, "hip": 403, "neuron": 404, "tpu": 405, "_is_cpu": 406, "cpu": 407, "_is_xpu": 408, "xpu": 409, "_build_custom_ops": 410, "get_rocm_version": 411, "rocm_home": 412, "librocm": 413, "core": 414, "see": 415, "blob": 416, "d11f5c20d500f729c393680a01fa902ebf92094b": 417, "rocm_version": 418, "cpp": 419, "l21": 420, "librocm_core_file": 421, "lib": 422, "is_file": 423, "librocm_core": 424, "ctypes": 425, "cdll": 426, "vererrors": 427, "c_uint32": 428, "get_rocm_core_version": 429, "getrocmversion": 430, "restype": 431, "argtypes": 432, "pointer": 433, "major": 434, "minor": 435, "patch": 436, "byref": 437, "get_neuronxcc_version": 438, "sysconfig": 439, "site_dir": 440, "get_paths": 441, "purelib": 442, "version_file": 443, "neuronxcc": 444, "executed": 445, "successfully": 446, "fp": 447, "content": 448, "read": 449, "regular": 450, "expression": 451, "search": 452, "__version__": 453, "group": 454, "could": 455, "output": 456, "adapted": 457, "nvidia": 458, "apex": 459, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 460, "nvcc_output": 461, "universal_newlines": 462, "release_idx": 463, "index": 464, "release": 465, "nvcc_cuda_version": 466, "parse": 467, "get_gaudi_sw_version": 468, "returns": 469, "driver": 470, "enable": 471, "console": 472, "printing": 473, "hl": 474, "smi": 475, "shell": 476, "text": 477, "capture_output": 478, "env": 479, "enable_console": 480, "returncode": 481, "stdout": 482, "get_vllm_version": 483, "get_version": 484, "write_to": 485, "_version": 486, "sep": 487, "versions": 488, "might": 489, "contain": 490, "cuda_version": 491, "main_cuda_version": 492, "cuda_version_str": 493, "source": 494, "tarball": 495, "required": 496, "pypi": 497, "sdist": 498, "argv": 499, "cu": 500, "neuron_version": 501, "neuron_version_str": 502, "unknown": 503, "runtime": 504, "get_requirements": 505, "package": 506, "requirements": 507, "requirements_dir": 508, "_read_requirements": 509, "resolved_requirements": 510, "line": 511, "startswith": 512, "common": 513, "cuda_major": 514, "cuda_minor": 515, "modified_requirements": 516, "req": 517, "flash": 518, "attn": 519, "12": 520, "built": 521, "unsupported": 522, "platform": 523, "please": 524, "find_cuda_init": 525, "fn": 526, "callable": 527, "object": 528, "helper": 529, "function": 530, "initialization": 531, "errors": 532, "initializes": 533, "prints": 534, "stack": 535, "trace": 536, "how": 537, "happens": 538, "_lazy_init": 539, "wrapper": 540, "nonlocal": 541, "traceback": 542, "extract_stack": 543, "initialized": 544, "format_list": 545, "samplingtype": 546, "intenum": 547, "greedy": 548, "random": 549, "random_seed": 550, "guideddecodingparams": 551, "one": 552, "fields": 553, "logit": 554, "processor": 555, "optional": 556, "union": 557, "regex": 558, "choice": 559, "grammar": 560, "json_object": 561, "options": 562, "backend": 563, "backend_was_auto": 564, "disable_fallback": 565, "disable_any_whitespace": 566, "disable_additional_properties": 567, "whitespace_pattern": 568, "structural_tag": 569, "from_optional": 570, "basemodel": 571, "arg": 572, "schemas": 573, "pydantic": 574, "models": 575, "isinstance": 576, "model_json_schema": 577, "__post_init__": 578, "validate": 579, "some": 580, "mutually": 581, "exclusive": 582, "guide_count": 583, "sum": 584, "you": 585, "kind": 586, "guided": 587, "decoding": 588, "multiple": 589, "specified": 590, "__dict__": 591, "requestoutputkind": 592, "enum": 593, "entire": 594, "far": 595, "every": 596, "requestoutput": 597, "cumulative": 598, "deltas": 599, "each": 600, "delta": 601, "do": 602, "intermediate": 603, "final_only": 604, "samplingparams": 605, "msgspec": 606, "struct": 607, "omit_defaults": 608, "ignore": 609, "call": 610, "cached_property": 611, "sampling": 612, "parameters": 613, "generation": 614, "overall": 615, "follow": 616, "openai": 617, "completion": 618, "docs": 619, "reference": 620, "completions": 621, "addition": 622, "support": 623, "beam": 624, "sequences": 625, "given": 626, "prompt": 627, "best_of": 628, "generated": 629, "top": 630, "returned": 631, "must": 632, "greater": 633, "than": 634, "equal": 635, "v0": 636, "_real_n": 637, "presence_penalty": 638, "float": 639, "penalizes": 640, "new": 641, "tokens": 642, "based": 643, "whether": 644, "appear": 645, "values": 646, "encourage": 647, "model": 648, "while": 649, "repeat": 650, "frequency_penalty": 651, "frequency": 652, "repetition_penalty": 653, "temperature": 654, "controls": 655, "randomness": 656, "lower": 657, "deterministic": 658, "higher": 659, "zero": 660, "means": 661, "top_p": 662, "probability": 663, "consider": 664, "top_k": 665, "min_p": 666, "represents": 667, "minimum": 668, "token": 669, "considered": 670, "relative": 671, "most": 672, "likely": 673, "disable": 674, "seed": 675, "stop": 676, "strings": 677, "stop_token_ids": 678, "ids": 679, "unless": 680, "special": 681, "ignore_eos": 682, "eos": 683, "generating": 684, "after": 685, "max_tokens": 686, "16": 687, "maximum": 688, "generate": 689, "per": 690, "sequence": 691, "min_tokens": 692, "before": 693, "logprobs": 694, "log": 695, "probabilities": 696, "non": 697, "result": 698, "includes": 699, "well": 700, "chosen": 701, "implementation": 702, "follows": 703, "always": 704, "sampled": 705, "up": 706, "elements": 707, "response": 708, "vocab_size": 709, "prompt_logprobs": 710, "parameter": 711, "exposed": 712, "engine": 713, "now": 714, "server": 715, "returning": 716, "detokenize": 717, "skip_special_tokens": 718, "spaces_between_special_tokens": 719, "add": 720, "spaces": 721, "logitsprocessor": 722, "because": 723, "logits_processors": 724, "functions": 725, "modify": 726, "logits": 727, "previously": 728, "argument": 729, "include_stop_str_in_output": 730, "include": 731, "truncate_prompt_tokens": 732, "annotated": 733, "meta": 734, "ge": 735, "truncation": 736, "size": 737, "integer": 738, "last": 739, "left": 740, "disabled": 741, "output_kind": 742, "below": 743, "supposed": 744, "input": 745, "post_init": 746, "output_text_buffer_length": 747, "_all_stop_token_ids": 748, "field": 749, "default_factory": 750, "construct": 751, "processors": 752, "guided_decoding": 753, "provided": 754, "logit_bias": 755, "applies": 756, "biases": 757, "allowed_token_ids": 758, "retains": 759, "scores": 760, "extra_args": 761, "arbitrary": 762, "additional": 763, "args": 764, "custom": 765, "implementations": 766, "plugins": 767, "etc": 768, "tree": 769, "bad": 770, "words": 771, "bad_words": 772, "allowed": 773, "precisely": 774, "corresponding": 775, "next": 776, "complete": 777, "_bad_words_token_ids": 778, "convert": 779, "token_id": 780, "clamp": 781, "bias": 782, "100": 783, "min": 784, "items": 785, "deal": 786, "original": 787, "results": 788, "got": 789, "_max_temp": 790, "less": 791, "cause": 792, "numerical": 793, "nan": 794, "inf": 795, "tensors": 796, "maxed": 797, "out": 798, "characters": 799, "hold": 800, "evaluation": 801, "until": 802, "finished": 803, "_verify_args": 804, "_sampling_eps": 805, "_verify_greedy_sampling": 806, "eos_token_id": 807, "added": 808, "least": 809, "negative": 810, "quietly": 811, "accept": 812, "prefer": 813, "typeerror": 814, "__name__": 815, "st_id": 816, "integers": 817, "stop_str": 818, "update_from_generation_config": 819, "generation_config": 820, "model_eos_token_id": 821, "id": 822, "sampling_params": 823, "processing": 824, "eos_ids": 825, "don": 826, "primary": 827, "since": 828, "handled": 829, "separately": 830, "stopping": 831, "purposes": 832, "discard": 833, "update_from_tokenizer": 834, "tokenizer": 835, "anytokenizer": 836, "bad_word": 837, "prohibit": 838, "both": 839, "beginning": 840, "middle": 841, "related": 842, "add_prefix_space": 843, "lstrip": 844, "prompt_token_ids": 845, "encode": 846, "add_special_tokens": 847, "space": 848, "produces": 849, "word": 850, "invalid_token_ids": 851, "bad_words_token_ids": 852, "max_token_id": 853, "vocabulary": 854, "following": 855, "were": 856, "satisfying": 857, "sampling_type": 858, "property": 859, "all_stop_token_ids": 860, "internal": 861, "backward": 862, "compatibility": 863, "guaranteed": 864, "clone": 865, "deep": 866, "maybe": 867, "objects": 868, "nontrivial": 869, "amount": 870, "data": 871, "expensive": 872, "however": 873, "copied": 874, "needs": 875, "parallel": 876, "issues": 877, "3087": 878, "logit_processor_refs": 879, "lp": 880, "hasattr": 881, "deepcopy": 882, "memo": 883, "__repr__": 884, "beamsearchparams": 885, "beam_width": 886, "length_penalty": 887, "poolingparams": 888, "array_like": 889, "pooling": 890, "attributes": 891, "normalize": 892, "embeddings": 893, "outputs": 894, "dimensions": 895, "matryoshka": 896, "representation": 897, "activation": 898, "apply": 899, "classification": 900, "softmax": 901, "reward": 902, "step_tag_id": 903, "returned_token_ids": 904, "task": 905, "poolingtask": 906, "requires_token_ids": 907, "extra_kwargs": 908, "all_parameters": 909, "valid_parameters": 910, "embed": 911, "classify": 912, "score": 913, "instance": 914, "verify": 915, "model_config": 916, "modelconfig": 917, "msg": 918, "overwrite": 919, "validation": 920, "done": 921, "against": 922, "config": 923, "method": 924, "_merge_default_parameters": 925, "_set_default_parameters": 926, "_verify_valid_parameters": 927, "pooler_config": 928, "getattr": 929, "setattr": 930, "is_matryoshka": 931, "served_model_name": 932, "changing": 933, "lead": 934, "poor": 935, "mds": 936, "matryoshka_dimensions": 937, "supports": 938, "invalid_parameters": 939, "has": 940, "get_default_cache_root": 941, "xdg_cache_home": 942, "expanduser": 943, "cache": 944, "get_default_config_root": 945, "xdg_config_home": 946, "maybe_convert_int": 947, "maybe_convert_bool": 948, "get_vllm_port": 949, "port": 950, "vllm_port": 951, "otherwise": 952, "raises": 953, "uri": 954, "suggest": 955, "k8s": 956, "service": 957, "discovery": 958, "issue": 959, "urlparse": 960, "parsed": 961, "scheme": 962, "appears": 963, "caused": 964, "kubernetes": 965, "ai": 966, "en": 967, "stable": 968, "serving": 969, "env_vars": 970, "html": 971, "valid": 972, "__getattr__": 973, "lazy": 974, "variables": 975, "environment_variables": 976, "attribute": 977, "__dir__": 978, "keys": 979, "is_set": 980, "explicitly": 981, "set_vllm_use_v1": 982, "use_v1": 983, "vllm_use_v1": 984, "user": 985, "compute_hash": 986, "whenever": 987, "key": 988, "factors": 989, "affects": 990, "computation": 991, "graph": 992, "example": 993, "different": 994, "vllm_pp_layer_partition": 995, "graphs": 996, "vars": 997, "affect": 998, "kernels": 999, "attention": 1000, "backends": 1001, "also": 1002, "todo": 1003, "deftruth": 1004, "factorize": 1005, "environment_variables_to_hash": 1006, "vllm_mla_disable": 1007, "vllm_use_triton_flash_attn": 1008, "vllm_use_triton_awq": 1009, "vllm_dp_rank": 1010, "vllm_dp_size": 1011, "vllm_use_standalone_compile": 1012, "vllm_fused_moe_chunk_size": 1013, "vllm_flashinfer_moe_backend": 1014, "vllm_v1_use_prefill_decode_attention": 1015, "vllm_use_aiter_unified_attention": 1016, "vllm_attention_backend": 1017, "vllm_use_flashinfer_sampler": 1018, "vllm_flashinfer_force_tensor_cores": 1019, "vllm_disabled_kernels": 1020, "vllm_use_deep_gemm": 1021, "vllm_use_trtllm_fp4_gemm": 1022, "vllm_use_flashinfer_moe_fp8": 1023, "vllm_use_flashinfer_moe_fp4": 1024, "vllm_use_flashinfer_moe_mxfp4_mxfp8": 1025, "vllm_use_flashinfer_moe_mxfp4_bf16": 1026, "vllm_use_cudnn_prefill": 1027, "vllm_use_trtllm_attention": 1028, "vllm_rocm_use_aiter": 1029, "vllm_rocm_use_aiter_paged_attn": 1030, "vllm_rocm_use_aiter_linear": 1031, "vllm_rocm_use_aiter_moe": 1032, "vllm_rocm_use_aiter_rmsnorm": 1033, "vllm_rocm_use_aiter_mla": 1034, "vllm_rocm_use_aiter_mha": 1035, "vllm_rocm_use_skinny_gemm": 1036, "vllm_rocm_fp8_padding": 1037, "vllm_rocm_moe_padding": 1038, "vllm_rocm_custom_paged_attn": 1039, "vllm_rocm_quick_reduce_quantization": 1040, "vllm_rocm_quick_reduce_cast_bf16_to_fp16": 1041, "vllm_rocm_quick_reduce_max_size_bytes_mb": 1042, "goes": 1043, "sync": 1044, "bug": 1045, "hash_str": 1046, "hashlib": 1047, "md5": 1048, "usedforsecurity": 1049, "hexdigest": 1050, "ipex_ops": 1051, "_reshape_activation_tensor": 1052, "tensor": 1053, "tuple": 1054, "num": 1055, "reshape": 1056, "x1": 1057, "x2": 1058, "chunk": 1059, "chunks": 1060, "dim": 1061, "silu_and_mul": 1062, "ipex": 1063, "llm": 1064, "functional": 1065, "gelu_and_mul": 1066, "gelu_tanh_and_mul": 1067, "gelu_fast": 1068, "nn": 1069, "gelu": 1070, "gelu_new": 1071, "gelu_quick": 1072, "paged_attention_v1": 1073, "query": 1074, "key_cache": 1075, "value_cache": 1076, "num_kv_heads": 1077, "scale": 1078, "block_tables": 1079, "context_lens": 1080, "block_size": 1081, "max_context_len": 1082, "alibi_slopes": 1083, "kv_cache_dtype": 1084, "k_scale": 1085, "v_scale": 1086, "tp_rank": 1087, "blocksparse_local_blocks": 1088, "blocksparse_vert_stride": 1089, "blocksparse_block_size": 1090, "64": 1091, "blocksparse_head_sliding_step": 1092, "auto": 1093, "num_heads": 1094, "num_queries_per_tokens": 1095, "pagedattention": 1096, "single_query_kv_attention": 1097, "contiguous": 1098, "view_as": 1099, "paged_attention_v2": 1100, "exp_sum": 1101, "max_logits": 1102, "tmp_out": 1103, "rotary_embedding": 1104, "positions": 1105, "batch_size": 1106, "seq_len": 1107, "head_size": 1108, "cos_sin_cache": 1109, "cos_sin_dim": 1110, "rot_dim": 1111, "is_neox": 1112, "rotary_embedding_batched": 1113, "batched_rotary_embedding": 1114, "cos_sin_cache_offsets": 1115, "rms_norm": 1116, "weight": 1117, "epsilon": 1118, "fused_add_rms_norm": 1119, "residual": 1120, "tmp": 1121, "add_rms_norm": 1122, "copy_": 1123, "varlen_attention": 1124, "seqlen_q": 1125, "seqlen_k": 1126, "max_seqlen_q": 1127, "max_seqlen_k": 1128, "pdropout": 1129, "softmax_scale": 1130, "zero_tensors": 1131, "is_causal": 1132, "return_softmax": 1133, "gen_": 1134, "generator": 1135, "window_size_left": 1136, "window_size_right": 1137, "logits_soft_cap": 1138, "endswith": 1139, "reshape_and_cache": 1140, "slot_mapping": 1141, "reshape_and_cache_flash": 1142, "k_scale_float": 1143, "v_scale_float": 1144, "fp8": 1145, "kv": 1146, "flash_attn_varlen_func": 1147, "cu_seqlens_q": 1148, "seqused_k": 1149, "kernel": 1150, "causal": 1151, "block_table": 1152, "window_size": 1153, "softcap": 1154, "cu_seqlens_k": 1155, "currently": 1156, "keep": 1157, "scheduler_metadata": 1158, "fa_version": 1159, "q_descale": 1160, "k_descale": 1161, "v_descale": 1162, "num_splits": 1163, "s_aux": 1164, "cumsum": 1165, "device": 1166, "dtype": 1167, "int32": 1168, "real_window_size": 1169, "get_scheduler_metadata": 1170, "num_heads_q": 1171, "num_heads_kv": 1172, "headdim": 1173, "cache_seqlens": 1174, "qkv_dtype": 1175, "bfloat16": 1176, "headdim_v": 1177, "cu_seqlens_k_new": 1178, "cache_leftpad": 1179, "page_size": 1180, "max_seqlen_k_new": 1181, "infinite": 1182, "window": 1183, "has_softcap": 1184, "tuned": 1185, "speed": 1186, "pack_gqa": 1187, "sm_margin": 1188, "sms": 1189, "communication": 1190, "warning_once": 1191, "implemented": 1192, "copy_blocks": 1193, "key_caches": 1194, "value_caches": 1195, "block_mapping": 1196, "swap_blocks": 1197, "beamsearchsequence": 1198, "keeps": 1199, "track": 1200, "filled": 1201, "about": 1202, "logprob": 1203, "lora_request": 1204, "lorarequest": 1205, "cum_logprob": 1206, "finish_reason": 1207, "stop_reason": 1208, "multi_modal_data": 1209, "multimodaldatadict": 1210, "mm_processor_kwargs": 1211, "beamsearchoutput": 1212, "best": 1213, "length": 1214, "width": 1215, "beamsearchinstance": 1216, "prompt_tokens": 1217, "kwargs": 1218, "beams": 1219, "completed": 1220, "get_beam_search_score": 1221, "cumulative_logprob": 1222, "calculate": 1223, "penalty": 1224, "huggingface": 1225, "transformers": 1226, "ccb92be23def445f2afdea94c31286f84b89eb5b": 1227, "beam_search": 1228, "l938": 1229, "create_sort_beams_key_function": 1230, "sort_beams_key": 1231, "_prev_minor_version_was": 1232, "version_str": 1233, "matches": 1234, "previous": 1235, "supplied": 1236, "hidden": 1237, "metrics": 1238, "anything": 1239, "__version_tuple__": 1240, "won": 1241, "right": 1242, "thing": 1243, "_prev_minor_version": 1244, "purpose": 1245, "work": 1246, "fine": 1247, "nanrepr": 1248, "nans": 1249, "ieee_754": 1250, "exp": 1251, "1s": 1252, "mantissa": 1253, "0s": 1254, "extd_range_max_min": 1255, "scalartype": 1256, "represent": 1257, "wide": 1258, "floating": 1259, "point": 1260, "types": 1261, "particular": 1262, "sub": 1263, "byte": 1264, "something": 1265, "capable": 1266, "representing": 1267, "stored_value": 1268, "useful": 1269, "quantized": 1270, "gptq": 1271, "4bit": 1272, "uses": 1273, "found": 1274, "csrc": 1275, "scalar_type": 1276, "hpp": 1277, "signatures": 1278, "kept": 1279, "exponent": 1280, "bits": 1281, "excluding": 1282, "sign": 1283, "bit": 1284, "signed": 1285, "scalar": 1286, "store": 1287, "unsigned": 1288, "128": 1289, "stored": 1290, "127": 1291, "129": 1292, "_finite_values_only": 1293, "private": 1294, "infs": 1295, "has_infs": 1296, "instead": 1297, "nan_repr": 1298, "applicable": 1299, "_floating_point_max_int": 1300, "52": 1301, "double": 1302, "__str__": 1303, "max_mantissa": 1304, "max_exponent": 1305, "adjust": 1306, "assume": 1307, "where": 1308, "precedent": 1309, "float8_e4m3b11fnuz": 1310, "jax": 1311, "ml": 1312, "ml_dtypes": 1313, "premature": 1314, "over": 1315, "complication": 1316, "just": 1317, "assuming": 1318, "exponent_bias": 1319, "exponent_bias_double": 1320, "10": 1321, "max_exponent_double": 1322, "shift": 1323, "ieee": 1324, "bitwise": 1325, "them": 1326, "together": 1327, "_floating_point_max": 1328, "double_raw": 1329, "unpack": 1330, "pack": 1331, "_raw_max": 1332, "is_floating_point": 1333, "size_bits": 1334, "is_signed": 1335, "_raw_min": 1336, "sign_bit_double": 1337, "63": 1338, "max_raw": 1339, "min_raw": 1340, "int64_t": 1341, "functools": 1342, "passed": 1343, "pytorch": 1344, "ops": 1345, "layout": 1346, "from_id": 1347, "val": 1348, "offset": 1349, "or_and_advance": 1350, "member": 1351, "bit_width": 1352, "bit_mask": 1353, "32": 1354, "too": 1355, "big": 1356, "fit": 1357, "int64": 1358, "_scalar_types_id_map": 1359, "representable": 1360, "accounting": 1361, "consistency": 1362, "org": 1363, "is_integer": 1364, "has_bias": 1365, "infinity": 1366, "has_nans": 1367, "is_ieee_754": 1368, "754": 1369, "conventions": 1370, "naming": 1371, "generally": 1372, "leading": 1373, "_e": 1374, "exponent_bits": 1375, "mantissa_bits": 1376, "flags": 1377, "finite": 1378, "infinities": 1379, "encoding": 1380, "ret": 1381, "uint": 1382, "__len__": 1383, "throw": 1384, "opcheck": 1385, "convenience": 1386, "constructors": 1387, "classmethod": 1388, "int_": 1389, "cls": 1390, "noqa": 1391, "b018": 1392, "cached": 1393, "float_ieee754": 1394, "float_": 1395, "finite_values_only": 1396, "constructor": 1397, "scalar_type_id": 1398, "doesn": 1399, "scalar_types": 1400, "int4": 1401, "uint4": 1402, "int8": 1403, "uint8": 1404, "float8_e4m3fn": 1405, "float8_e5m2": 1406, "float8_e8m0fnu": 1407, "float16_e8m7": 1408, "float16_e5m10": 1409, "fp6": 1410, "usyd": 1411, "fsalab": 1412, "fp6_llm": 1413, "float6_e3m2f": 1414, "fp4": 1415, "www": 1416, "opencompute": 1417, "documents": 1418, "ocp": 1419, "microscaling": 1420, "formats": 1421, "mx": 1422, "v1": 1423, "final": 1424, "pdf": 1425, "float4_e2m1f": 1426, "uint2b2": 1427, "uint3b4": 1428, "uint4b8": 1429, "uint8b128": 1430, "colloquial": 1431, "names": 1432, "float16": 1433, "seq_lens": 1434, "max_seq_len": 1435, "paged_attention_rocm": 1436, "query_start_loc": 1437, "fp8_out_scale": 1438, "_rocm_c": 1439, "paged_attention": 1440, "mla_decode_kvcache_cpu": 1441, "kv_cache": 1442, "_c_cpu": 1443, "mla_decode_kvcache": 1444, "merge_attn_states": 1445, "prefix_output": 1446, "prefix_lse": 1447, "suffix_output": 1448, "suffix_lse": 1449, "output_lse": 1450, "convert_vertical_slash_indexes": 1451, "q_seqlens": 1452, "batch": 1453, "kv_seqlens": 1454, "vertical_indexes": 1455, "n_heads": 1456, "nnz_v": 1457, "slash_indexes": 1458, "nnz_s": 1459, "context_size": 1460, "block_size_m": 1461, "block_size_n": 1462, "nnz_slash": 1463, "nnz_vertical": 1464, "num_rows": 1465, "block_count": 1466, "zeros": 1467, "block_offset": 1468, "column_count": 1469, "column_index": 1470, "convert_vertical_slash_indexes_mergehead": 1471, "head": 1472, "indices": 1473, "vertical_indices_count": 1474, "slash_indices_count": 1475, "updated": 1476, "input_contiguous": 1477, "apply_repetition_penalties_torch": 1478, "prompt_mask": 1479, "output_mask": 1480, "repetition_penalties": 1481, "unsqueeze": 1482, "op": 1483, "penalties": 1484, "positive": 1485, "divide": 1486, "multiply": 1487, "scaling": 1488, "apply_repetition_penalties_cuda": 1489, "apply_repetition_penalties_": 1490, "apply_repetition_penalties": 1491, "repetition": 1492, "place": 1493, "shape": 1494, "num_seqs": 1495, "boolean": 1496, "indicating": 1497, "is_cuda": 1498, "is_contiguous": 1499, "rms_norm_dynamic_per_token_quant": 1500, "quant_dtype": 1501, "scale_ub": 1502, "empty_like": 1503, "scales": 1504, "numel": 1505, "float32": 1506, "awq_dequantize": 1507, "qweight": 1508, "split_k_iters": 1509, "thx": 1510, "thy": 1511, "model_executor": 1512, "layers": 1513, "quantization": 1514, "awq_triton": 1515, "awq_dequantize_triton": 1516, "awq_gemm": 1517, "qzeros": 1518, "awq_gemm_triton": 1519, "gptq_gemm": 1520, "b_q_weight": 1521, "b_gptq_qzeros": 1522, "b_gptq_scales": 1523, "b_g_idx": 1524, "use_exllama": 1525, "gptq_shuffle": 1526, "q_weight": 1527, "q_perm": 1528, "marlin_gemm": 1529, "b_scales": 1530, "workspace": 1531, "size_m": 1532, "size_n": 1533, "size_k": 1534, "gptq_marlin_24_gemm": 1535, "b_meta": 1536, "b_q_type": 1537, "cutlass_scaled_mm_supports_fp4": 1538, "cuda_device_capability": 1539, "cutlass_blockwise_scaled_grouped_mm": 1540, "scales_a": 1541, "scales_b": 1542, "problem_sizes": 1543, "expert_offsets": 1544, "cutlass_scaled_fp4_mm": 1545, "block_scale_a": 1546, "block_scale_b": 1547, "alpha": 1548, "out_dtype": 1549, "ndim": 1550, "cutlass_scaled_mm_supports_fp8": 1551, "cutlass_scaled_mm_supports_block_fp8": 1552, "cutlass_scaled_mm": 1553, "scale_a": 1554, "scale_b": 1555, "implements": 1556, "fused": 1557, "mm": 1558, "numpy": 1559, "style": 1560, "broadcasting": 1561, "order": 1562, "blockwise": 1563, "like": 1564, "deepseek": 1565, "v3": 1566, "extended": 1567, "broadcast": 1568, "rules": 1569, "extend": 1570, "rule": 1571, "extent": 1572, "dimension": 1573, "element": 1574, "along": 1575, "src_shape": 1576, "target_shape": 1577, "times": 1578, "consecutively": 1579, "would": 1580, "expand": 1581, "case": 1582, "massage": 1583, "2d": 1584, "view": 1585, "cutlass_compatible_b": 1586, "current_platform": 1587, "is_rocm": 1588, "compressed_tensors": 1589, "triton_scaled_mm": 1590, "cutlass_scaled_mm_azp": 1591, "azp_adj": 1592, "azp": 1593, "param": 1594, "channel": 1595, "cutlass_sparse_scaled_mm_supported": 1596, "cutlass_group_gemm_supported": 1597, "cutlass_sparse_compress": 1598, "compresses": 1599, "sparse": 1600, "matrix": 1601, "cutlass": 1602, "operations": 1603, "takes": 1604, "dense": 1605, "two": 1606, "metadata": 1607, "compressed": 1608, "containing": 1609, "a_nzs": 1610, "a_meta": 1611, "compression": 1612, "operation": 1613, "fails": 1614, "notes": 1615, "encodes": 1616, "sparsity": 1617, "elemspermetaelem": 1618, "8b": 1619, "2b_per_nz": 1620, "cutlass_scaled_sparse_mm": 1621, "bt_nzs": 1622, "bt_meta": 1623, "performs": 1624, "scaled": 1625, "multiplication": 1626, "steps": 1627, "randn": 1628, "prune": 1629, "prune_to_2_4": 1630, "compress": 1631, "transposed": 1632, "applying": 1633, "get_cutlass_moe_mm_data": 1634, "topk_ids": 1635, "problem_sizes1": 1636, "problem_sizes2": 1637, "input_permutation": 1638, "output_permutation": 1639, "num_experts": 1640, "blockscale_offsets": 1641, "prepare": 1642, "necessary": 1643, "grouped": 1644, "multiplications": 1645, "moe": 1646, "expert": 1647, "mapping": 1648, "compute": 1649, "mark": 1650, "begins": 1651, "sorted": 1652, "computed": 1653, "mxnxk": 1654, "sizes": 1655, "mms": 1656, "permutation": 1657, "shuffle": 1658, "executing": 1659, "block": 1660, "rows": 1661, "shuffle_rows": 1662, "input_tensor": 1663, "dst2src_map": 1664, "according": 1665, "output_tensor": 1666, "permute": 1667, "performing": 1668, "num_tokens_permuted": 1669, "get_cutlass_pplx_moe_mm_data": 1670, "expert_num_tokens": 1671, "num_local_experts": 1672, "padded_m": 1673, "non_zero_expert_idxs": 1674, "consecutive": 1675, "experts": 1676, "counts": 1677, "cutlass_moe_mm": 1678, "out_tensors": 1679, "a_tensors": 1680, "b_tensors": 1681, "a_scales": 1682, "a_strides": 1683, "b_strides": 1684, "c_strides": 1685, "per_act_token": 1686, "per_out_ch": 1687, "executes": 1688, "ab": 1689, "strides": 1690, "cutlass_fp4_moe_mm": 1691, "alphas": 1692, "sf_offsets": 1693, "blockscaled": 1694, "gemm": 1695, "runs": 1696, "gemms": 1697, "combination": 1698, "problem": 1699, "during": 1700, "nvfp4": 1701, "fusedmoe": 1702, "forward": 1703, "a_ptrs": 1704, "b_ptrs": 1705, "weights": 1706, "a_": 1707, "blockscales": 1708, "e4m3": 1709, "precision": 1710, "sf_size": 1711, "sf_offset": 1712, "cutlass_fp4_group_mm": 1713, "gptq_marlin_repack": 1714, "perm": 1715, "num_bits": 1716, "awq_marlin_repack": 1717, "gptq_marlin_moe_repack": 1718, "awq_marlin_moe_repack": 1719, "gptq_marlin_gemm": 1720, "b_bias": 1721, "global_scale": 1722, "b_zeros": 1723, "g_idx": 1724, "is_k_full": 1725, "use_atomic_add": 1726, "use_fp32_reduce": 1727, "is_zp_float": 1728, "machete_supported_schedules": 1729, "a_type": 1730, "b_type": 1731, "group_scales_type": 1732, "group_zeros_type": 1733, "channel_scales_type": 1734, "token_scales_type": 1735, "out_type": 1736, "machete_mm": 1737, "b_q": 1738, "machete_prepack_b": 1739, "b_group_scales": 1740, "b_group_zeros": 1741, "b_group_size": 1742, "b_channel_scales": 1743, "a_token_scales": 1744, "schedule": 1745, "permute_cols": 1746, "scaled_fp4_quant": 1747, "input_global_scale": 1748, "quantize": 1749, "quantizes": 1750, "dynamically": 1751, "factor": 1752, "shared": 1753, "swizzled": 1754, "thread": 1755, "execution": 1756, "tcgen05": 1757, "mma": 1758, "4x": 1759, "packed": 1760, "float8_e4m3": 1761, "sizzled": 1762, "other_dims": 1763, "fp16": 1764, "bf16": 1765, "rounded": 1766, "due": 1767, "requirement": 1768, "tile": 1769, "128x4": 1770, "pad": 1771, "multiples": 1772, "round_up": 1773, "rounded_m": 1774, "scale_n": 1775, "rounded_n": 1776, "output_scale": 1777, "scaled_fp4_experts_quant": 1778, "topk": 1779, "inputs": 1780, "offsets": 1781, "blockscale": 1782, "output_scales": 1783, "control": 1784, "prevent": 1785, "running": 1786, "memory": 1787, "increased": 1788, "larger": 1789, "max_tokens_per_expert": 1790, "vllm_max_tokens_per_expert_fp4_moe": 1791, "m_numtopk": 1792, "cutlass_moe_fp4": 1793, "observed": 1794, "scales_k": 1795, "padded_k": 1796, "scaled_fp8_quant": 1797, "num_token_padding": 1798, "use_per_token_if_dynamic": 1799, "static": 1800, "dynamic": 1801, "provide": 1802, "omit": 1803, "determined": 1804, "padding": 1805, "downstream": 1806, "benefit": 1807, "upper": 1808, "bound": 1809, "per_tensor": 1810, "per_token": 1811, "code": 1812, "assumes": 1813, "batch_dim": 1814, "num_tokens": 1815, "flattened": 1816, "mi300": 1817, "float_e3m3fnuz": 1818, "fp8_dtype": 1819, "dynamic_per_token_scaled_fp8_quant": 1820, "dynamic_scaled_fp8_quant": 1821, "static_scaled_fp8_quant": 1822, "allspark_repack_weight": 1823, "zero_point": 1824, "has_zp": 1825, "rearrange": 1826, "asymmetric": 1827, "n32k16": 1828, "ampere": 1829, "w8a16": 1830, "symmetric": 1831, "rearranged": 1832, "n_32align": 1833, "qweight_reorder": 1834, "scale_reorder": 1835, "zero_point_reorder": 1836, "rearrange_kn_weight_as_n32k16_order": 1837, "allspark_w8a16_gemm": 1838, "b_qweight": 1839, "b_qzeros": 1840, "group_size": 1841, "sm_count": 1842, "sm_version": 1843, "cublas_m_threshold": 1844, "n32k16_reorder": 1845, "scaled_int8_quant": 1846, "invoke": 1847, "ignored": 1848, "static_scaled_int8_quant": 1849, "input_scales": 1850, "input_azp": 1851, "dynamic_scaled_int8_quant": 1852, "marlin_qqq_gemm": 1853, "s_tok": 1854, "s_ch": 1855, "s_group": 1856, "ggml_dequantize": 1857, "quant_type": 1858, "ggml_mul_mat_vec_a8": 1859, "row": 1860, "ggml_mul_mat_a8": 1861, "ggml_moe_a8": 1862, "sorted_token_ids": 1863, "expert_ids": 1864, "num_tokens_post_padded": 1865, "ggml_moe_a8_vec": 1866, "symint": 1867, "ggml_moe_get_block_size": 1868, "selective_scan_fwd": 1869, "d_": 1870, "z_": 1871, "delta_bias_": 1872, "delta_softplus": 1873, "cache_indices": 1874, "has_initial_state": 1875, "ssm_states": 1876, "pad_slot_id": 1877, "llmm1": 1878, "rows_per_block": 1879, "wvsplitk": 1880, "cu_count": 1881, "wvsplitkq": 1882, "moe_sum": 1883, "moe_align_block_size": 1884, "experts_ids": 1885, "num_tokens_post_pad": 1886, "moe_wna16_gemm": 1887, "topk_weights": 1888, "block_size_k": 1889, "notimplementederror": 1890, "optimized": 1891, "platforms": 1892, "topk_softmax": 1893, "token_expert_indices": 1894, "gating_output": 1895, "moe_wna16_marlin_gemm": 1896, "num_tokens_past_padded": 1897, "moe_block_size": 1898, "mul_topk_weights": 1899, "is_ep": 1900, "_c_cache_ops": 1901, "concat_and_cache_mla": 1902, "kv_c": 1903, "k_pe": 1904, "copy_blocks_mla": 1905, "kv_caches": 1906, "convert_fp8": 1907, "kv_dtype": 1908, "gather_cache": 1909, "src_cache": 1910, "cu_seq_lens": 1911, "seq_starts": 1912, "get_device_attribute": 1913, "_c_cuda_utils": 1914, "get_max_shared_memory_per_block_device_attribute": 1915, "ruff": 1916, "e501": 1917, "init_custom_ar": 1918, "ipc_tensors": 1919, "rank_data": 1920, "rank": 1921, "fully_connected": 1922, "_c_custom_ar": 1923, "all_reduce": 1924, "fa": 1925, "inp": 1926, "reg_buffer": 1927, "reg_buffer_sz_bytes": 1928, "dispose": 1929, "meta_size": 1930, "register_buffer": 1931, "get_graph_buffer_ipc_meta": 1932, "register_graph_buffers": 1933, "handles": 1934, "allocate_shared_buffer_and_handle": 1935, "open_mem_handle": 1936, "mem_handle": 1937, "free_shared_buffer": 1938, "ptr": 1939, "init_custom_qr": 1940, "world_size": 1941, "qr_max_size": 1942, "qr_destroy": 1943, "qr_all_reduce": 1944, "quant_level": 1945, "cast_bf2half": 1946, "qr_get_handle": 1947, "qr_open_handles": 1948, "get_flash_mla_metadata": 1949, "num_heads_per_head_k": 1950, "num_heads_k": 1951, "arguments": 1952, "equals": 1953, "seq_len_q": 1954, "tile_scheduler_metadata": 1955, "num_sm_parts": 1956, "tileschedulermetadatasize": 1957, "flash_mla_with_kvcache": 1958, "k_cache": 1959, "head_dim_v": 1960, "head_dim": 1961, "num_blocks": 1962, "page_block_size": 1963, "max_num_blocks_per_seq": 1964, "get_mla_metadata": 1965, "qk": 1966, "sqrt": 1967, "mask": 1968, "softmax_lse": 1969, "flash_mla_fwd_kvcache": 1970, "cutlass_mla_decode": 1971, "q_nope": 1972, "q_pe": 1973, "kv_c_and_k_pe_cache": 1974, "page_table": 1975, "sm100_cutlass_mla_decode": 1976, "num_kv_splits": 1977, "sm100_cutlass_mla_get_workspace_size": 1978, "num_batches": 1979, "_print_debug_once": 1980, "hashable": 1981, "stacklevel": 1982, "caller": 1983, "_print_info_once": 1984, "_print_warning_once": 1985, "_vllmlogger": 1986, "information": 1987, "methods": 1988, "directly": 1989, "logging": 1990, "conflicting": 1991, "intel_extension_for_pytorch": 1992, "utils": 1993, "_logger": 1994, "debug_once": 1995, "message": 1996, "silently": 1997, "dropped": 1998, "info_once": 1999, "_configure_vllm_root_logger": 2000, "logging_config": 2001, "vllm_configure_logging": 2002, "vllm_logging_config_path": 2003, "evaluated": 2004, "implies": 2005, "unset": 2006, "default_logging_config": 2007, "load": 2008, "custom_config": 2009, "invalid": 2010, "expected": 2011, "formatter": 2012, "formatters": 2013, "provides": 2014, "backwards": 2015, "10134": 2016, "newlineformatter": 2017, "logging_utils": 2018, "dictconfig": 2019, "init_logger": 2020, "loggers": 2021, "retrieved": 2022, "way": 2023, "getlogger": 2024, "method_name": 2025, "_methods_to_patch": 2026, "methodtype": 2027, "cast": 2028, "_trace_calls": 2029, "log_path": 2030, "frame": 2031, "event": 2032, "f_code": 2033, "co_filename": 2034, "lineno": 2035, "f_lineno": 2036, "func_name": 2037, "co_name": 2038, "last_frame": 2039, "f_back": 2040, "last_filename": 2041, "last_lineno": 2042, "last_func_name": 2043, "initial": 2044, "ts": 2045, "datetime": 2046, "strftime": 2047, "write": 2048, "nameerror": 2049, "deleted": 2050, "shutdown": 2051, "partial": 2052, "enable_trace_function_call": 2053, "log_file_path": 2054, "tracing": 2055, "under": 2056, "debugging": 2057, "hangs": 2058, "crashes": 2059, "calling": 2060, "enabled": 2061, "affected": 2062, "vllm_trace_function": 2063, "record": 2064, "slow": 2065, "down": 2066, "suggested": 2067, "hang": 2068, "saved": 2069, "__file__": 2070, "settrace": 2071, "httpconnection": 2072, "send": 2073, "http": 2074, "requests": 2075, "reuse_client": 2076, "_sync_client": 2077, "session": 2078, "_async_client": 2079, "aiohttp": 2080, "clientsession": 2081, "get_sync_client": 2082, "intentionally": 2083, "async": 2084, "even": 2085, "though": 2086, "client": 2087, "accessible": 2088, "inside": 2089, "loop": 2090, "get_async_client": 2091, "trust_env": 2092, "_validate_http_url": 2093, "parsed_url": 2094, "_headers": 2095, "extras": 2096, "mutablemapping": 2097, "agent": 2098, "vllm_version": 2099, "get_response": 2100, "stream": 2101, "timeout": 2102, "extra_headers": 2103, "headers": 2104, "get_async_response": 2105, "await": 2106, "get_bytes": 2107, "bytes": 2108, "raise_for_status": 2109, "async_get_bytes": 2110, "get_text": 2111, "async_get_text": 2112, "get_json": 2113, "async_get_json": 2114, "download_file": 2115, "save_path": 2116, "chunk_size": 2117, "iter_content": 2118, "async_download_file": 2119, "iter_chunked": 2120, "batchdescriptor": 2121, "namedtuple": 2122, "descriptor": 2123, "cudagraph": 2124, "dispatching": 2125, "minimal": 2126, "possible": 2127, "properly": 2128, "uniquely": 2129, "describe": 2130, "padded": 2131, "uniform_decode": 2132, "uniform": 2133, "dispatch": 2134, "supporting": 2135, "batches": 2136, "non_uniform": 2137, "_compute_chunked_local_num_tokens": 2138, "num_tokens_across_dp_cpu": 2139, "max_num_tokens": 2140, "chunk_idx": 2141, "dp_size": 2142, "local_size": 2143, "dp_tokens": 2144, "lockstep": 2145, "dpmetadata": 2146, "max_tokens_across_dp_cpu": 2147, "cu_tokens_across_dp_cpu": 2148, "local_sizes": 2149, "num_tokens_across_dp": 2150, "dp_rank": 2151, "gather": 2152, "across": 2153, "dp": 2154, "ranks": 2155, "num_tokens_tensor": 2156, "distributed": 2157, "parallel_state": 2158, "get_dp_group": 2159, "dist": 2160, "cpu_group": 2161, "parallel_config": 2162, "parallelconfig": 2163, "attn_metadata": 2164, "data_parallel_size": 2165, "data_parallel_rank": 2166, "num_prefill_tokens": 2167, "batchsize": 2168, "num_decode_tokens": 2169, "contextmanager": 2170, "chunked_sizes": 2171, "max_chunk_size_per_rank": 2172, "manager": 2173, "temporarily": 2174, "specific": 2175, "chunked": 2176, "processes": 2177, "designated": 2178, "portion": 2179, "others": 2180, "uneven": 2181, "break": 2182, "total": 2183, "sets": 2184, "process": 2185, "derive": 2186, "wise": 2187, "cu_sizes": 2188, "item": 2189, "yield": 2190, "get_chunk_sizes_across_dp_rank": 2191, "forwardcontext": 2192, "vllm_config": 2193, "compilation_config": 2194, "static_forward_context": 2195, "no_compile_layers": 2196, "attentionmetadata": 2197, "map": 2198, "layer_name": 2199, "layer": 2200, "making": 2201, "virtual_engines": 2202, "share": 2203, "virtual_engine": 2204, "dp_metadata": 2205, "full": 2206, "piecewise": 2207, "cudagraph_runtime_mode": 2208, "cudagraphmode": 2209, "batch_descriptor": 2210, "mode": 2211, "get_forward_context": 2212, "_forward_context": 2213, "set_forward_context": 2214, "vllmconfig": 2215, "stores": 2216, "inject": 2217, "logic": 2218, "global": 2219, "forward_start_time": 2220, "need_to_track_batchsize": 2221, "track_batchsize": 2222, "time": 2223, "perf_counter": 2224, "prev_context": 2225, "last_logging_time": 2226, "batchsize_logging_interval": 2227, "synchronous": 2228, "scheduling": 2229, "adding": 2230, "synchronize": 2231, "measurement": 2232, "milliseconds": 2233, "batchsize_forward_time": 2234, "1000": 2235, "forward_stats": 2236, "bs": 2237, "profiling": 2238, "medium": 2239, "quantile": 2240, "round": 2241, "sort": 2242, "reverse": 2243, "stats": 2244, "median_time": 2245, "ms": 2246, "completionoutput": 2247, "token_ids": 2248, "position": 2249, "requested": 2250, "reason": 2251, "why": 2252, "including": 2253, "encountering": 2254, "lora": 2255, "genericsequence": 2256, "samplelogprobs": 2257, "poolingoutput": 2258, "extracted": 2259, "states": 2260, "__eq__": 2261, "__class__": 2262, "request_id": 2263, "unique": 2264, "encoder": 2265, "decoder": 2266, "whole": 2267, "associated": 2268, "encoder_prompt": 2269, "encoder_prompt_token_ids": 2270, "num_cached_tokens": 2271, "hit": 2272, "kv_transfer_params": 2273, "params": 2274, "transfer": 2275, "promptlogprobs": 2276, "requestmetrics": 2277, "multi_modal_placeholders": 2278, "multimodalplaceholderdict": 2279, "still": 2280, "older": 2281, "without": 2282, "breaking": 2283, "ignoring": 2284, "extra": 2285, "next_output": 2286, "aggregate": 2287, "next_completion": 2288, "enumerate": 2289, "mutablesequence": 2290, "from_seq_group": 2291, "seq_group": 2292, "sequencegroup": 2293, "use_cache": 2294, "seq_id_to_seq_group": 2295, "sequencegroupbase": 2296, "is_finished": 2297, "assembled_seq_group": 2298, "maybe_assemble_group": 2299, "finish_seq": 2300, "clear": 2301, "seq": 2302, "to_be_finished": 2303, "sub_request_id": 2304, "seq_id_to_index": 2305, "del": 2306, "completionrequest": 2307, "init": 2308, "needed": 2309, "cached_request_output": 2310, "top_n_seqs": 2311, "get_seqs": 2312, "include_logprobs": 2313, "text_buffer_length": 2314, "include_prompt": 2315, "output_text": 2316, "get_output_text_to_return": 2317, "output_token_ids": 2318, "get_output_token_ids_to_return": 2319, "num_output_tokens": 2320, "get_num_cached_tokens": 2321, "output_logprobs": 2322, "slice": 2323, "finishes": 2324, "get_output_len": 2325, "cached_outputs": 2326, "get_cumulative_logprob": 2327, "sequencestatus": 2328, "get_finished_reason": 2329, "finished_time": 2330, "set_finished_time": 2331, "init_kwargs": 2332, "request_output": 2333, "poolingrequestoutput": 2334, "generic": 2335, "_o": 2336, "identifier": 2337, "flag": 2338, "pooled_data": 2339, "requestoutputfactory": 2340, "embeddingoutput": 2341, "embedding": 2342, "vector": 2343, "floats": 2344, "depends": 2345, "from_base": 2346, "pooling_output": 2347, "tolist": 2348, "hidden_size": 2349, "embeddingrequestoutput": 2350, "classificationoutput": 2351, "probs": 2352, "classes": 2353, "num_classes": 2354, "classificationrequestoutput": 2355, "scoringoutput": 2356, "scoring": 2357, "similarity": 2358, "squeeze": 2359, "scoringrequestoutput": 2360, "stderr": 2361, "popen": 2362, "pipe": 2363, "raw_output": 2364, "raw_err": 2365, "communicate": 2366, "rc": 2367, "get_platform": 2368, "win32": 2369, "enc": 2370, "oem": 2371, "locale": 2372, "getpreferredencoding": 2373, "topo": 2374, "whitespace": 2375, "meaningful": 2376, "rstrip": 2377, "filenotfounderror": 2378, "cmd_str": 2379, "run_and_read_all": 2380, "run_lambda": 2381, "reads": 2382, "run_and_parse_first_match": 2383, "run_and_return_first_line": 2384, "get_conda_packages": 2385, "patterns": 2386, "default_conda_patterns": 2387, "conda": 2388, "conda_exe": 2389, "splitlines": 2390, "get_gcc_version": 2391, "gcc": 2392, "get_clang_version": 2393, "clang": 2394, "get_cmake_version": 2395, "get_nvidia_driver_version": 2396, "darwin": 2397, "cmd": 2398, "kextstat": 2399, "grep": 2400, "get_nvidia_smi": 2401, "get_gpu_info": 2402, "torch_available": 2403, "is_available": 2404, "prop": 2405, "get_device_properties": 2406, "gcnarchname": 2407, "gcnarch": 2408, "nogcnarchnameonoldpytorch": 2409, "get_device_name": 2410, "uuid_regex": 2411, "uuid": 2412, "anonymize": 2413, "gpus": 2414, "get_running_cuda_version": 2415, "get_cudnn_version": 2416, "libcudnn": 2417, "hard": 2418, "tell": 2419, "being": 2420, "system_root": 2421, "systemroot": 2422, "windows": 2423, "cuda_path": 2424, "where_cmd": 2425, "system32": 2426, "cudnn_cmd": 2427, "cudnn": 2428, "dll": 2429, "drivers": 2430, "usr": 2431, "installation": 2432, "guide": 2433, "mac": 2434, "deeplearning": 2435, "sdk": 2436, "installmac": 2437, "cudnn_library": 2438, "library": 2439, "installed": 2440, "elsewhere": 2441, "ls": 2442, "ldconfig": 2443, "rev": 2444, "cut": 2445, "f1": 2446, "permission": 2447, "realpath": 2448, "files_set": 2449, "eliminate": 2450, "symbolic": 2451, "links": 2452, "alphabetize": 2453, "probably": 2454, "linux": 2455, "program_files_root": 2456, "programfiles": 2457, "program": 2458, "legacy_path": 2459, "corporation": 2460, "nvsmi": 2461, "new_path": 2462, "smis": 2463, "candidate_smi": 2464, "hipcc": 2465, "get_neuron_sdk_version": 2466, "script": 2467, "changes": 2468, "git_sha": 2469, "date": 2470, "summarize_vllm_build_flags": 2471, "constant": 2472, "archs": 2473, "torch_cuda_arch_list": 2474, "neuron_cores": 2475, "get_gpu_topo": 2476, "showtopo": 2477, "get_cpu_info": 2478, "lscpu": 2479, "wmic": 2480, "manufacturer": 2481, "family": 2482, "architecture": 2483, "processortype": 2484, "deviceid": 2485, "currentclockspeed": 2486, "maxclockspeed": 2487, "l2cachesize": 2488, "l2cachespeed": 2489, "revision": 2490, "sysctl": 2491, "machdep": 2492, "brand_string": 2493, "cpu_info": 2494, "cygwin": 2495, "get_mac_version": 2496, "sw_vers": 2497, "productversion": 2498, "get_windows_version": 2499, "wmic_cmd": 2500, "wbem": 2501, "findstr_cmd": 2502, "findstr": 2503, "caption": 2504, "get_lsb_version": 2505, "lsb_release": 2506, "description": 2507, "check_release_file": 2508, "pretty_name": 2509, "get_os": 2510, "machine": 2511, "macos": 2512, "ubuntu": 2513, "debian": 2514, "desc": 2515, "reading": 2516, "get_python_platform": 2517, "get_libc_version": 2518, "libc_ver": 2519, "get_pip_packages": 2520, "pip": 2521, "packages": 2522, "default_pip_patterns": 2523, "run_with_pip": 2524, "pip_spec": 2525, "find_spec": 2526, "pip_available": 2527, "importerror": 2528, "mpip": 2529, "freeze": 2530, "uv": 2531, "collect": 2532, "pip_version": 2533, "pip3": 2534, "get_cachingallocator_config": 2535, "ca_config": 2536, "pytorch_cuda_alloc_conf": 2537, "get_cuda_module_loading_config": 2538, "cuda_module_loading": 2539, "is_xnnpack_available": 2540, "xnnpack": 2541, "attr": 2542, "get_env_vars": 2543, "secret_terms": 2544, "secret": 2545, "access": 2546, "password": 2547, "report_prefix": 2548, "nccl": 2549, "cublas": 2550, "omp_": 2551, "mkl_": 2552, "term": 2553, "get_env_info": 2554, "pip_list_output": 2555, "debug_mode_str": 2556, "cuda_available_str": 2557, "hip_compiled_version": 2558, "hip_runtime_version": 2559, "miopen_runtime_version": 2560, "get_version_or_na": 2561, "_lst": 2562, "rsplit": 2563, "_show_config": 2564, "miopen": 2565, "sys_version": 2566, "conda_packages": 2567, "neuron_sdk_version": 2568, "vllm_build_flags": 2569, "gpu_topo": 2570, "systemenv": 2571, "torch_version": 2572, "is_debug_build": 2573, 