{"def": 0, "find_cuda_init": 1, "fn": 2, "callable": 3, "object": 4, "none": 5, "helper": 6, "function": 7, "debug": 8, "cuda": 9, "re": 10, "initialization": 11, "errors": 12, "initializes": 13, "prints": 14, "stack": 15, "trace": 16, "how": 17, "happens": 18, "from": 19, "torch": 20, "import": 21, "_lazy_init": 22, "wrapper": 23, "nonlocal": 24, "traceback": 25, "extract_stack": 26, "return": 27, "patch": 28, "print": 29, "initialized": 30, "join": 31, "format_list": 32, "strip": 33, "load_module_from_path": 34, "module_name": 35, "path": 36, "spec": 37, "importlib": 38, "util": 39, "spec_from_file_location": 40, "module": 41, "module_from_spec": 42, "sys": 43, "modules": 44, "loader": 45, "exec_module": 46, "is_sccache_available": 47, "bool": 48, "which": 49, "sccache": 50, "int": 51, "os": 52, "getenv": 53, "vllm_disable_sccache": 54, "is_ccache_available": 55, "ccache": 56, "is_ninja_available": 57, "ninja": 58, "is_url_available": 59, "url": 60, "str": 61, "urllib": 62, "request": 63, "urlopen": 64, "status": 65, "try": 66, "except": 67, "exception": 68, "false": 69, "200": 70, "class": 71, "cmakeextension": 72, "extension": 73, "__init__": 74, "self": 75, "name": 76, "cmake_lists_dir": 77, "kwa": 78, "super": 79, "sources": 80, "py_limited_api": 81, "true": 82, "abspath": 83, "compute_num_jobs": 84, "num_jobs": 85, "either": 86, "value": 87, "max_jobs": 88, "environment": 89, "variable": 90, "defined": 91, "number": 92, "cpus": 93, "available": 94, "envs": 95, "logger": 96, "info": 97, "using": 98, "jobs": 99, "else": 100, "sched_getaffinity": 101, "isn": 102, "universally": 103, "so": 104, "fall": 105, "back": 106, "cpu_count": 107, "we": 108, "get": 109, "error": 110, "here": 111, "len": 112, "attributeerror": 113, "nvcc_threads": 114, "_is_cuda": 115, "get_nvcc_cuda_version": 116, "version": 117, "11": 118, "when": 119, "set": 120, "reduce": 121, "avoid": 122, "overloading": 123, "system": 124, "nvcc": 125, "threads": 126, "max": 127, "configure": 128, "ext": 129, "ve": 130, "already": 131, "configured": 132, "cmakelists": 133, "txt": 134, "exit": 135, "early": 136, "cmake_build_ext": 137, "did_config": 138, "select": 139, "build": 140, "type": 141, "note": 142, "optimization": 143, "level": 144, "default_cfg": 145, "relwithdebinfo": 146, "cfg": 147, "cmake_build_type": 148, "cmake_args": 149, "dcmake_build_type": 150, "format": 151, "dvllm_target_device": 152, "vllm_target_device": 153, "verbose": 154, "dcmake_verbose_makefile": 155, "dcmake_c_compiler_launcher": 156, "dcmake_cxx_compiler_launcher": 157, "dcmake_cuda_compiler_launcher": 158, "dcmake_hip_compiler_launcher": 159, "elif": 160, "pass": 161, "python": 162, "executable": 163, "cmake": 164, "can": 165, "find": 166, "exact": 167, "match": 168, "dvllm_python_executable": 169, "reuse": 170, "dependencies": 171, "subsequent": 172, "calls": 173, "dvllm_python_path": 174, "override": 175, "base": 176, "directory": 177, "fetchcontent": 178, "downloads": 179, "root": 180, "deps": 181, "allows": 182, "sharing": 183, "between": 184, "profiles": 185, "plays": 186, "more": 187, "nicely": 188, "fetchcontent_base_dir": 189, "fc_base_dir": 190, "root_dir": 191, "environ": 192, "dfetchcontent_base_dir": 193, "setup": 194, "parallelism": 195, "tool": 196, "dnvcc_threads": 197, "build_tool": 198, "dcmake_job_pool_compile": 199, "string": 200, "compile": 201, "dcmake_job_pools": 202, "default": 203, "whatever": 204, "picks": 205, "make": 206, "sure": 207, "use": 208, "cuda_home": 209, "dcmake_cuda_compiler": 210, "bin": 211, "subprocess": 212, "check_call": 213, "cwd": 214, "build_temp": 215, "build_extensions": 216, "ensure": 217, "present": 218, "working": 219, "check_output": 220, "oserror": 221, "raise": 222, "runtimeerror": 223, "cannot": 224, "create": 225, "does": 226, "exist": 227, "exists": 228, "makedirs": 229, "targets": 230, "target_name": 231, "removeprefix": 232, "vllm": 233, "vllm_flash_attn": 234, "all": 235, "extensions": 236, "append": 237, "build_args": 238, "target": 239, "install": 240, "libraries": 241, "proper": 242, "location": 243, "outdir": 244, "get_ext_fullpath": 245, "parent": 246, "absolute": 247, "skip": 248, "same": 249, "continue": 250, "appends": 251, "prefix": 252, "contains": 253, "need": 254, "remove": 255, "range": 256, "count": 257, "should": 258, "actually": 259, "components": 260, "install_args": 261, "component": 262, "run": 263, "first": 264, "standard": 265, "build_ext": 266, "command": 267, "copy": 268, "py": 269, "build_lib": 270, "current": 271, "included": 272, "editable": 273, "glob": 274, "files": 275, "recursive": 276, "file": 277, "dst_file": 278, "split": 279, "copying": 280, "dirname": 281, "exist_ok": 282, "copy_file": 283, "precompiled_build_ext": 284, "disables": 285, "building": 286, "precompiled": 287, "binaries": 288, "assert": 289, "vllm_use_precompiled": 290, "only": 291, "supported": 292, "builds": 293, "skipping": 294, "extract_precompiled_and_patch_package": 295, "wheel_url_or_path": 296, "dict": 297, "tempfile": 298, "zipfile": 299, "temp_dir": 300, "isfile": 301, "wheel_filename": 302, "mkdtemp": 303, "wheels": 304, "wheel_path": 305, "downloading": 306, "wheel": 307, "urlretrieve": 308, "filename": 309, "existing": 310, "package_data_patch": 311, "files_to_copy": 312, "_c": 313, "abi3": 314, "_moe_c": 315, "_flashmla_c": 316, "_vllm_fa2_c": 317, "_vllm_fa3_c": 318, "cumem_allocator": 319, "compiled_regex": 320, "file_members": 321, "list": 322, "filter": 323, "lambda": 324, "filelist": 325, "extract": 326, "target_path": 327, "open": 328, "src": 329, "wb": 330, "dst": 331, "shutil": 332, "copyfileobj": 333, "pkg": 334, "replace": 335, "setdefault": 336, "basename": 337, "finally": 338, "removing": 339, "temporary": 340, "rmtree": 341, "get_base_commit_in_main_branch": 342, "force": 343, "nightly": 344, "mainly": 345, "used": 346, "ci": 347, "testing": 348, "vllm_test_use_precompiled_nightly_wheel": 349, "latest": 350, "commit": 351, "hash": 352, "upstream": 353, "main": 354, "branch": 355, "resp_json": 356, "curl": 357, "https": 358, "api": 359, "github": 360, "com": 361, "repos": 362, "project": 363, "commits": 364, "decode": 365, "utf": 366, "upstream_main_commit": 367, "json": 368, "loads": 369, "sha": 370, "docker": 371, "context": 372, "git": 373, "may": 374, "immutable": 375, "missing": 376, "vllm_docker_build_context": 377, "check": 378, "local": 379, "repo": 380, "cat": 381, "calledprocesserror": 382, "fetch": 383, "remote": 384, "repository": 385, "update": 386, "any": 387, "branches": 388, "ensures": 389, "ref": 390, "its": 391, "history": 392, "our": 393, "current_branch": 394, "show": 395, "base_commit": 396, "merge": 397, "valueerror": 398, "err": 399, "warning": 400, "failed": 401, "compatible": 402, "your": 403, "dev": 404, "_no_device": 405, "empty": 406, "has_cuda": 407, "_is_neuron": 408, "_is_tpu": 409, "_is_hip": 410, "rocm": 411, "hip": 412, "neuron": 413, "tpu": 414, "_is_cpu": 415, "cpu": 416, "_is_xpu": 417, "xpu": 418, "_build_custom_ops": 419, "get_rocm_version": 420, "rocm_home": 421, "librocm": 422, "core": 423, "see": 424, "blob": 425, "d11f5c20d500f729c393680a01fa902ebf92094b": 426, "rocm_version": 427, "cpp": 428, "l21": 429, "librocm_core_file": 430, "lib": 431, "is_file": 432, "librocm_core": 433, "ctypes": 434, "cdll": 435, "vererrors": 436, "c_uint32": 437, "get_rocm_core_version": 438, "getrocmversion": 439, "restype": 440, "argtypes": 441, "pointer": 442, "major": 443, "minor": 444, "byref": 445, "get_neuronxcc_version": 446, "sysconfig": 447, "site_dir": 448, "get_paths": 449, "purelib": 450, "version_file": 451, "neuronxcc": 452, "executed": 453, "successfully": 454, "fp": 455, "content": 456, "read": 457, "regular": 458, "expression": 459, "search": 460, "__version__": 461, "group": 462, "could": 463, "output": 464, "adapted": 465, "nvidia": 466, "apex": 467, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 468, "nvcc_output": 469, "universal_newlines": 470, "release_idx": 471, "index": 472, "release": 473, "nvcc_cuda_version": 474, "parse": 475, "get_gaudi_sw_version": 476, "returns": 477, "driver": 478, "enable": 479, "console": 480, "printing": 481, "hl": 482, "smi": 483, "shell": 484, "text": 485, "capture_output": 486, "env": 487, "enable_console": 488, "returncode": 489, "stdout": 490, "get_vllm_version": 491, "get_version": 492, "write_to": 493, "_version": 494, "sep": 495, "versions": 496, "might": 497, "contain": 498, "cuda_version": 499, "main_cuda_version": 500, "cuda_version_str": 501, "source": 502, "tarball": 503, "required": 504, "pypi": 505, "sdist": 506, "argv": 507, "cu": 508, "neuron_version": 509, "neuron_version_str": 510, "unknown": 511, "runtime": 512, "get_requirements": 513, "package": 514, "requirements": 515, "requirements_dir": 516, "_read_requirements": 517, "resolved_requirements": 518, "line": 519, "startswith": 520, "common": 521, "cuda_major": 522, "cuda_minor": 523, "modified_requirements": 524, "req": 525, "flash": 526, "attn": 527, "12": 528, "built": 529, "other": 530, "unsupported": 531, "platform": 532, "please": 533, "print_top_10_largest_files": 534, "zip_file": 535, "top": 536, "10": 537, "largest": 538, "given": 539, "zip": 540, "file_sizes": 541, "getinfo": 542, "file_size": 543, "namelist": 544, "sort": 545, "key": 546, "reverse": 547, "size": 548, "1024": 549, "2f": 550, "mbs": 551, "uncompressed": 552, "check_wheel_size": 553, "whl": 554, "walk": 555, "file_name": 556, "endswith": 557, "wheel_size_mb": 558, "getsize": 559, "vllm_max_size_mb": 560, "allowed": 561, "larger": 562, "mb": 563, "than": 564, "limit": 565, "within": 566, "_is_internal": 567, "_fail": 568, "violations": 569, "iterable": 570, "tuple": 571, "disallowed": 572, "eager": 573, "imports": 574, "stderr": 575, "lineno": 576, "msg": 577, "is_python_file": 578, "scan_file": 579, "encoding": 580, "pickle_re": 581, "load_gitignore": 582, "repo_root": 583, "gitignore_path": 584, "gitignore": 585, "patterns": 586, "splitlines": 587, "always": 588, "ignore": 589, "pathspec": 590, "from_lines": 591, "gitwildmatch": 592, "__file__": 593, "bad_files": 594, "dirpath": 595, "filenames": 596, "abs_path": 597, "rel_path": 598, "relpath": 599, "ignored": 600, "match_file": 601, "allowed_files": 602, "nerror": 603, "following": 604, "pickle": 605, "cloudpickle": 606, "nif": 607, "intentional": 608, "tools": 609, "check_pickle_imports": 610, "test_regex": 611, "test_cases": 612, "pkl": 613, "cpkl": 614, "dumps": 615, "timport": 616, "somethingelse": 617, "pickleas": 618, "asdf": 619, "should_match": 620, "enumerate": 621, "result": 622, "test": 623, "case": 624, "expected": 625, "got": 626, "regex": 627, "tests": 628, "passed": 629, "spdxstatus": 630, "enum": 631, "spdx": 632, "header": 633, "enumeration": 634, "complete": 635, "missing_license": 636, "has": 637, "copyright": 638, "missing_copyright": 639, "license": 640, "missing_both": 641, "check_spdx_header_status": 642, "file_path": 643, "lines": 644, "readlines": 645, "shebang": 646, "start_idx": 647, "has_license": 648, "has_copyright": 649, "headers": 650, "just": 651, "two": 652, "license_line": 653, "copyright_line": 654, "determine": 655, "based": 656, "what": 657, "found": 658, "completely": 659, "both": 660, "add_header": 661, "add": 662, "supplement": 663, "seek": 664, "truncate": 665, "preserve": 666, "write": 667, "full_spdx_header": 668, "writelines": 669, "directly": 670, "after": 671, "insert": 672, "break": 673, "before": 674, "files_missing_both": 675, "files_missing_copyright": 676, "files_missing_license": 677, "collect": 678, "fixing": 679, "all_files_to_fix": 680, "is_allowed_file": 681, "current_file": 682, "is_forbidden_import": 683, "stripped": 684, "forbidden_import_re": 685, "allowed_lines": 686, "parse_diff": 687, "diff": 688, "current_lineno": 689, "skip_allowed_file": 690, "next": 691, "code_line": 692, "get_diff": 693, "diff_type": 694, "staged": 695, "cached": 696, "unified": 697, "unstaged": 698, "all_violations": 699, "diff_output": 700, "extend": 701, "forbidden": 702, "direct": 703, "triton": 704, "detected": 705, "triton_utils": 706, "instead": 707, "get_staged_python_files": 708, "am": 709, "forbidden_patterns": 710, "pattern": 711, "allowed_patterns": 712, "check_file": 713, "filepath": 714, "line_num": 715, "unicodedecodeerror": 716, "total_violations": 717, "violation": 718, "also": 719, "noqa": 720, "e501": 721, "get_python_executable": 722, "script": 723, "get_cpu_cores": 724, "cores": 725, "multiprocessing": 726, "start": 727, "end": 728, "creates": 729, "passing": 730, "times": 731, "seconds": 732, "float": 733, "appended": 734, "owner": 735, "weighted_duration": 736, "duration": 737, "task": 738, "setweightedduration": 739, "sets": 740, "weightedduration": 741, "weighted": 742, "takes": 743, "elapsed": 744, "time": 745, "divides": 746, "many": 747, "tasks": 748, "were": 749, "running": 750, "thus": 751, "represents": 752, "approximate": 753, "impact": 754, "total": 755, "serialized": 756, "serializing": 757, "steps": 758, "typically": 759, "ending": 760, "up": 761, "much": 762, "longer": 763, "durations": 764, "shorter": 765, "allow": 766, "modest": 767, "floating": 768, "point": 769, "epsilon": 770, "000002": 771, "describetargets": 772, "printable": 773, "summarizes": 774, "some": 775, "generate": 776, "dozens": 777, "outputs": 778, "handle": 779, "them": 780, "sanely": 781, "max_length": 782, "chosen": 783, "fit": 784, "most": 785, "long": 786, "single": 787, "names": 788, "while": 789, "minimizing": 790, "word": 791, "wrapping": 792, "65": 793, "getextension": 794, "extra_patterns": 795, "best": 796, "multiple": 797, "important": 798, "consistent": 799, "canonical": 800, "ultimately": 801, "goal": 802, "fn_pattern": 803, "fnmatch": 804, "good": 805, "grouping": 806, "type_mappings": 807, "capture": 808, "example": 809, "javac": 810, "jar": 811, "distinguished": 812, "interface": 813, "ext1": 814, "splitext": 815, "ext2": 816, "order": 817, "pdb": 818, "dll": 819, "exe": 820, "pefile": 821, "linking": 822, "grouped": 823, "together": 824, "don": 825, "cause": 826, "listed": 827, "toc": 828, "attempt": 829, "identify": 830, "identifying": 831, "obj": 832, "categorized": 833, "mojo": 834, "jars": 835, "java": 836, "normalize": 837, "related": 838, "mojom": 839, "log_file": 840, "ninja_log": 841, "parser": 842, "argparse": 843, "argumentparser": 844, "add_argument": 845, "dest": 846, "build_directory": 847, "help": 848, "step": 849, "types": 850, "semicolon": 851, "separated": 852, "log": 853, "specific": 854, "analyze": 855, "args": 856, "_extra_args": 857, "parse_known_args": 858, "step_types": 859, "room": 860, "extra": 861, "global": 862, "long_ext_count": 863, "entries": 864, "readtargets": 865, "summarizeentries": 866, "summary": 867, "created": 868, "errno": 869, "enoent": 870, "get_attr_docs": 871, "cls_node": 872, "ast": 873, "classdef": 874, "docstrings": 875, "placed": 876, "attribute": 877, "assignments": 878, "body": 879, "davidism": 880, "mit": 881, "pairwise": 882, "manually": 883, "implement": 884, "docs": 885, "org": 886, "library": 887, "itertools": 888, "html": 889, "removed": 890, "support": 891, "dropped": 892, "iterator": 893, "iter": 894, "yield": 895, "out": 896, "consider": 897, "each": 898, "pair": 899, "nodes": 900, "must": 901, "assignment": 902, "constant": 903, "isinstance": 904, "assign": 905, "annassign": 906, "expr": 907, "doc": 908, "inspect": 909, "cleandoc": 910, "have": 911, "annotated": 912, "one": 913, "assigning": 914, "plain": 915, "id": 916, "configvalidator": 917, "nodevisitor": 918, "visit_classdef": 919, "node": 920, "validate": 921, "config": 922, "dataclass": 923, "decorators": 924, "decorator_list": 925, "call": 926, "func": 927, "validate_class": 928, "fail": 929, "decorator": 930, "generic_visit": 931, "validate_ast": 932, "tree": 933, "stmt": 934, "visit": 935, "validate_file": 936, "validating": 937, "dataclasses": 938, "systemexit": 939, "message": 940, "paged_attention_v1": 941, "tensor": 942, "query": 943, "key_cache": 944, "value_cache": 945, "num_kv_heads": 946, "scale": 947, "block_tables": 948, "seq_lens": 949, "block_size": 950, "max_seq_len": 951, "alibi_slopes": 952, "optional": 953, "kv_cache_dtype": 954, "k_scale": 955, "v_scale": 956, "tp_rank": 957, "blocksparse_local_blocks": 958, "blocksparse_vert_stride": 959, "blocksparse_block_size": 960, "64": 961, "blocksparse_head_sliding_step": 962, "ops": 963, "paged_attention_v2": 964, "exp_sum": 965, "max_logits": 966, "tmp_out": 967, "paged_attention_rocm": 968, "query_start_loc": 969, "fp8_out_scale": 970, "_rocm_c": 971, "paged_attention": 972, "mla_decode_kvcache_cpu": 973, "kv_cache": 974, "_c_cpu": 975, "mla_decode_kvcache": 976, "merge_attn_states": 977, "prefix_output": 978, "prefix_lse": 979, "suffix_output": 980, "suffix_lse": 981, "output_lse": 982, "convert_vertical_slash_indexes": 983, "q_seqlens": 984, "batch": 985, "kv_seqlens": 986, "vertical_indexes": 987, "n_heads": 988, "nnz_v": 989, "slash_indexes": 990, "nnz_s": 991, "context_size": 992, "block_size_m": 993, "block_size_n": 994, "causal": 995, "batch_size": 996, "num_heads": 997, "nnz_slash": 998, "nnz_vertical": 999, "num_rows": 1000, "block_count": 1001, "zeros": 1002, "dtype": 1003, "device": 1004, "block_offset": 1005, "column_count": 1006, "column_index": 1007, "rotary_embedding": 1008, "positions": 1009, "head_size": 1010, "cos_sin_cache": 1011, "is_neox": 1012, "batched_rotary_embedding": 1013, "rot_dim": 1014, "cos_sin_cache_offsets": 1015, "rms_norm": 1016, "input": 1017, "weight": 1018, "todo": 1019, "contiguous": 1020, "kernel": 1021, "updated": 1022, "non": 1023, "input_contiguous": 1024, "fused_add_rms_norm": 1025, "residual": 1026, "apply_repetition_penalties_torch": 1027, "logits": 1028, "prompt_mask": 1029, "output_mask": 1030, "repetition_penalties": 1031, "unsqueeze": 1032, "dim": 1033, "repeat": 1034, "token": 1035, "appears": 1036, "prompt": 1037, "apply": 1038, "otherwise": 1039, "op": 1040, "penalties": 1041, "where": 1042, "positive": 1043, "divide": 1044, "penalty": 1045, "multiply": 1046, "scaling": 1047, "apply_repetition_penalties_cuda": 1048, "apply_repetition_penalties_": 1049, "apply_repetition_penalties": 1050, "repetition": 1051, "place": 1052, "shape": 1053, "num_seqs": 1054, "vocab_size": 1055, "boolean": 1056, "indicating": 1057, "tokens": 1058, "appear": 1059, "is_cuda": 1060, "is_contiguous": 1061, "rms_norm_dynamic_per_token_quant": 1062, "quant_dtype": 1063, "scale_ub": 1064, "empty_like": 1065, "scales": 1066, "numel": 1067, "float32": 1068, "awq_dequantize": 1069, "qweight": 1070, "split_k_iters": 1071, "thx": 1072, "thy": 1073, "vllm_use_triton_awq": 1074, "model_executor": 1075, "layers": 1076, "quantization": 1077, "awq_triton": 1078, "awq_dequantize_triton": 1079, "awq_gemm": 1080, "qzeros": 1081, "awq_gemm_triton": 1082, "gptq_gemm": 1083, "b_q_weight": 1084, "b_gptq_qzeros": 1085, "b_gptq_scales": 1086, "b_g_idx": 1087, "use_exllama": 1088, "bit": 1089, "gptq_shuffle": 1090, "q_weight": 1091, "q_perm": 1092, "marlin_gemm": 1093, "b_scales": 1094, "workspace": 1095, "size_m": 1096, "size_n": 1097, "size_k": 1098, "gptq_marlin_24_gemm": 1099, "b_meta": 1100, "b_q_type": 1101, "scalartype": 1102, "cutlass_scaled_mm_supports_fp4": 1103, "cuda_device_capability": 1104, "cutlass_blockwise_scaled_grouped_mm": 1105, "scales_a": 1106, "scales_b": 1107, "problem_sizes": 1108, "expert_offsets": 1109, "cutlass_scaled_fp4_mm": 1110, "block_scale_a": 1111, "block_scale_b": 1112, "alpha": 1113, "out_dtype": 1114, "ndim": 1115, "cutlass_scaled_mm_supports_fp8": 1116, "cutlass_scaled_mm_supports_block_fp8": 1117, "cutlass_scaled_mm_azp": 1118, "scale_a": 1119, "scale_b": 1120, "azp_adj": 1121, "azp": 1122, "bias": 1123, "param": 1124, "per": 1125, "include": 1126, "channel": 1127, "16": 1128, "bfloat16": 1129, "float16": 1130, "massage": 1131, "2d": 1132, "target_shape": 1133, "view": 1134, "cutlass_sparse_scaled_mm_supported": 1135, "cutlass_group_gemm_supported": 1136, "cutlass_sparse_compress": 1137, "compresses": 1138, "sparse": 1139, "matrix": 1140, "cutlass": 1141, "operations": 1142, "dense": 1143, "zero": 1144, "elements": 1145, "metadata": 1146, "compressed": 1147, "representation": 1148, "kernels": 1149, "data": 1150, "int8": 1151, "float8_e4m3fn": 1152, "containing": 1153, "a_nzs": 1154, "a_meta": 1155, "raises": 1156, "compression": 1157, "operation": 1158, "fails": 1159, "notes": 1160, "uint8": 1161, "element": 1162, "encodes": 1163, "sparsity": 1164, "elemspermetaelem": 1165, "dimensions": 1166, "8b": 1167, "2b_per_nz": 1168, "cutlass_scaled_sparse_mm": 1169, "bt_nzs": 1170, "bt_meta": 1171, "performs": 1172, "scaled": 1173, "multiplication": 1174, "randn": 1175, "prune": 1176, "along": 1177, "specified": 1178, "dimension": 1179, "prune_to_2_4": 1180, "compress": 1181, "transposed": 1182, "perform": 1183, "applying": 1184, "factors": 1185, "shuffle_rows": 1186, "input_tensor": 1187, "dst2src_map": 1188, "shuffle": 1189, "expand": 1190, "according": 1191, "store": 1192, "output_tensor": 1193, "moe": 1194, "permute": 1195, "performing": 1196, "multiplications": 1197, "num_tokens_permuted": 1198, "get_cutlass_pplx_moe_mm_data": 1199, "problem_sizes1": 1200, "problem_sizes2": 1201, "expert_num_tokens": 1202, "num_local_experts": 1203, "padded_m": 1204, "prepare": 1205, "necessary": 1206, "fused": 1207, "expert": 1208, "non_zero_expert_idxs": 1209, "consecutive": 1210, "indices": 1211, "experts": 1212, "counts": 1213, "uses": 1214, "compute": 1215, "mark": 1216, "begins": 1217, "computation": 1218, "mxnxk": 1219, "sizes": 1220, "mms": 1221, "cutlass_moe_mm": 1222, "out_tensors": 1223, "a_tensors": 1224, "b_tensors": 1225, "a_scales": 1226, "a_strides": 1227, "b_strides": 1228, "c_strides": 1229, "per_act_token": 1230, "per_out_ch": 1231, "executes": 1232, "fp8": 1233, "quantized": 1234, "ab": 1235, "computed": 1236, "strides": 1237, "cutlass_fp4_moe_mm": 1238, "alphas": 1239, "sf_offsets": 1240, "fp4": 1241, "blockscaled": 1242, "gemm": 1243, "runs": 1244, "gemms": 1245, "combination": 1246, "problem": 1247, "during": 1248, "nvfp4": 1249, "fusedmoe": 1250, "forward": 1251, "a_ptrs": 1252, "b_ptrs": 1253, "tensors": 1254, "weights": 1255, "a_": 1256, "blockscales": 1257, "e4m3": 1258, "precision": 1259, "sf_size": 1260, "sf_offset": 1261, "cutlass_fp4_group_mm": 1262, "gptq_marlin_repack": 1263, "perm": 1264, "num_bits": 1265, "awq_marlin_repack": 1266, "gptq_marlin_moe_repack": 1267, "num_experts": 1268, "awq_marlin_moe_repack": 1269, "gptq_marlin_gemm": 1270, "b_bias": 1271, "global_scale": 1272, "b_zeros": 1273, "g_idx": 1274, "is_k_full": 1275, "use_atomic_add": 1276, "use_fp32_reduce": 1277, "is_zp_float": 1278, "machete_supported_schedules": 1279, "a_type": 1280, "b_type": 1281, "group_scales_type": 1282, "group_zeros_type": 1283, "channel_scales_type": 1284, "token_scales_type": 1285, "out_type": 1286, "machete_mm": 1287, "b_q": 1288, "returned": 1289, "machete_prepack_b": 1290, "b_group_scales": 1291, "b_group_zeros": 1292, "b_group_size": 1293, "b_channel_scales": 1294, "a_token_scales": 1295, "schedule": 1296, "permute_cols": 1297, "allspark_repack_weight": 1298, "zero_point": 1299, "has_zp": 1300, "rearrange": 1301, "asymmetric": 1302, "n32k16": 1303, "ampere": 1304, "w8a16": 1305, "original": 1306, "fp16": 1307, "bf16": 1308, "provided": 1309, "symmetric": 1310, "rearranged": 1311, "optionally": 1312, "n_32align": 1313, "32": 1314, "qweight_reorder": 1315, "scale_reorder": 1316, "zero_point_reorder": 1317, "rearrange_kn_weight_as_n32k16_order": 1318, "allspark_w8a16_gemm": 1319, "b_qweight": 1320, "b_qzeros": 1321, "group_size": 1322, "sm_count": 1323, "sm_version": 1324, "cublas_m_threshold": 1325, "n32k16_reorder": 1326, "scaled_int8_quant": 1327, "quantize": 1328, "maybe": 1329, "factor": 1330, "invoke": 1331, "dynamic": 1332, "whether": 1333, "static": 1334, "static_scaled_int8_quant": 1335, "input_scales": 1336, "input_azp": 1337, "int32": 1338, "dynamic_scaled_int8_quant": 1339, "marlin_qqq_gemm": 1340, "s_tok": 1341, "s_ch": 1342, "s_group": 1343, "ggml_dequantize": 1344, "quant_type": 1345, "ggml_mul_mat_vec_a8": 1346, "row": 1347, "ggml_mul_mat_a8": 1348, "ggml_moe_a8": 1349, "sorted_token_ids": 1350, "expert_ids": 1351, "num_tokens_post_padded": 1352, "top_k": 1353, "ggml_moe_a8_vec": 1354, "topk_ids": 1355, "symint": 1356, "ggml_moe_get_block_size": 1357, "selective_scan_fwd": 1358, "delta": 1359, "d_": 1360, "z_": 1361, "delta_bias_": 1362, "delta_softplus": 1363, "cache_indices": 1364, "has_initial_state": 1365, "ssm_states": 1366, "pad_slot_id": 1367, "llmm1": 1368, "rows_per_block": 1369, "wvsplitk": 1370, "cu_count": 1371, "wvsplitkq": 1372, "moe_sum": 1373, "moe_align_block_size": 1374, "experts_ids": 1375, "num_tokens_post_pad": 1376, "moe_wna16_gemm": 1377, "topk_weights": 1378, "block_size_k": 1379, "current_platform": 1380, "notimplementederror": 1381, "optimized": 1382, "platforms": 1383, "topk_softmax": 1384, "token_expert_indices": 1385, "gating_output": 1386, "moe_wna16_marlin_gemm": 1387, "num_tokens_past_padded": 1388, "moe_block_size": 1389, "mul_topk_weights": 1390, "is_ep": 1391, "reshape_and_cache": 1392, "slot_mapping": 1393, "_c_cache_ops": 1394, "reshape_and_cache_flash": 1395, "concat_and_cache_mla": 1396, "kv_c": 1397, "k_pe": 1398, "copy_blocks": 1399, "key_caches": 1400, "value_caches": 1401, "block_mapping": 1402, "copy_blocks_mla": 1403, "kv_caches": 1404, "swap_blocks": 1405, "convert_fp8": 1406, "kv_dtype": 1407, "gather_cache": 1408, "src_cache": 1409, "block_table": 1410, "cu_seq_lens": 1411, "seq_starts": 1412, "get_device_attribute": 1413, "_c_cuda_utils": 1414, "get_max_shared_memory_per_block_device_attribute": 1415, "ruff": 1416, "init_custom_ar": 1417, "ipc_tensors": 1418, "rank_data": 1419, "rank": 1420, "fully_connected": 1421, "_c_custom_ar": 1422, "all_reduce": 1423, "fa": 1424, "inp": 1425, "reg_buffer": 1426, "reg_buffer_sz_bytes": 1427, "dispose": 1428, "meta_size": 1429, "register_buffer": 1430, "get_graph_buffer_ipc_meta": 1431, "register_graph_buffers": 1432, "handles": 1433, "offsets": 1434, "allocate_shared_buffer_and_handle": 1435, "open_mem_handle": 1436, "mem_handle": 1437, "free_shared_buffer": 1438, "ptr": 1439, "init_custom_qr": 1440, "world_size": 1441, "qr_max_size": 1442, "qr_destroy": 1443, "qr_all_reduce": 1444, "quant_level": 1445, "cast_bf2half": 1446, "qr_get_handle": 1447, "qr_open_handles": 1448, "get_flash_mla_metadata": 1449, "cache_seqlens": 1450, "num_heads_per_head_k": 1451, "num_heads_k": 1452, "arguments": 1453, "equals": 1454, "seq_len_q": 1455, "num_heads_q": 1456, "tile_scheduler_metadata": 1457, "num_sm_parts": 1458, "tileschedulermetadatasize": 1459, "num_splits": 1460, "flash_mla_with_kvcache": 1461, "k_cache": 1462, "head_dim_v": 1463, "softmax_scale": 1464, "head_dim": 1465, "num_blocks": 1466, "page_block_size": 1467, "max_num_blocks_per_seq": 1468, "get_mla_metadata": 1469, "qk": 1470, "softmax": 1471, "sqrt": 1472, "attention": 1473, "mask": 1474, "softmax_lse": 1475, "flash_mla_fwd_kvcache": 1476, "cutlass_mla_decode": 1477, "q_nope": 1478, "q_pe": 1479, "kv_c_and_k_pe_cache": 1480, "page_table": 1481, "sm100_cutlass_mla_decode": 1482, "num_kv_splits": 1483, "sm100_cutlass_mla_get_workspace_size": 1484, "num_batches": 1485, "_reshape_activation_tensor": 1486, "num": 1487, "reshape": 1488, "x1": 1489, "x2": 1490, "chunk": 1491, "chunks": 1492, "silu_and_mul": 1493, "ipex": 1494, "llm": 1495, "functional": 1496, "gelu_and_mul": 1497, "gelu_tanh_and_mul": 1498, "gelu_fast": 1499, "nn": 1500, "gelu": 1501, "gelu_new": 1502, "gelu_quick": 1503, "context_lens": 1504, "max_context_len": 1505, "auto": 1506, "num_queries_per_tokens": 1507, "pagedattention": 1508, "single_query_kv_attention": 1509, "view_as": 1510, "seq_len": 1511, "cos_sin_dim": 1512, "rotary_embedding_batched": 1513, "tmp": 1514, "add_rms_norm": 1515, "copy_": 1516, "varlen_attention": 1517, "seqlen_q": 1518, "seqlen_k": 1519, "max_seqlen_q": 1520, "max_seqlen_k": 1521, "pdropout": 1522, "zero_tensors": 1523, "is_causal": 1524, "return_softmax": 1525, "gen_": 1526, "generator": 1527, "window_size_left": 1528, "window_size_right": 1529, "logits_soft_cap": 1530, "k_scale_float": 1531, "v_scale_float": 1532, "kv": 1533, "cache": 1534, "flash_attn_varlen_func": 1535, "cu_seqlens_q": 1536, "seqused_k": 1537, "window_size": 1538, "softcap": 1539, "cu_seqlens_k": 1540, "parameters": 1541, "currently": 1542, "keep": 1543, "scheduler_metadata": 1544, "fa_version": 1545, "q_descale": 1546, "k_descale": 1547, "v_descale": 1548, "s_aux": 1549, "cumsum": 1550, "real_window_size": 1551, "get_scheduler_metadata": 1552, "num_heads_kv": 1553, "headdim": 1554, "qkv_dtype": 1555, "headdim_v": 1556, "cu_seqlens_k_new": 1557, "cache_leftpad": 1558, "page_size": 1559, "max_seqlen_k_new": 1560, "means": 1561, "infinite": 1562, "window": 1563, "has_softcap": 1564, "tuned": 1565, "speed": 1566, "pack_gqa": 1567, "sm_margin": 1568, "sms": 1569, "communication": 1570, "warning_once": 1571, "implemented": 1572, "ipex_ops": 1573, "returning": 1574, "beamsearchsequence": 1575, "sequence": 1576, "beam": 1577, "keeps": 1578, "track": 1579, "probability": 1580, "field": 1581, "filled": 1582, "about": 1583, "user": 1584, "includes": 1585, "logprobs": 1586, "logprob": 1587, "lora_request": 1588, "lorarequest": 1589, "cum_logprob": 1590, "finish_reason": 1591, "stop_reason": 1592, "union": 1593, "multi_modal_data": 1594, "multimodaldatadict": 1595, "mm_processor_kwargs": 1596, "beamsearchoutput": 1597, "sequences": 1598, "length": 1599, "equal": 1600, "width": 1601, "beamsearchinstance": 1602, "prompt_tokens": 1603, "kwargs": 1604, "beams": 1605, "completed": 1606, "get_beam_search_score": 1607, "cumulative_logprob": 1608, "eos_token_id": 1609, "length_penalty": 1610, "calculate": 1611, "score": 1612, "huggingface": 1613, "transformers": 1614, "ccb92be23def445f2afdea94c31286f84b89eb5b": 1615, "generation": 1616, "beam_search": 1617, "l938": 1618, "create_sort_beams_key_function": 1619, "sort_beams_key": 1620, "code": 1621, "popen": 1622, "pipe": 1623, "raw_output": 1624, "raw_err": 1625, "communicate": 1626, "rc": 1627, "get_platform": 1628, "win32": 1629, "enc": 1630, "oem": 1631, "locale": 1632, "getpreferredencoding": 1633, "topo": 1634, "leading": 1635, "whitespace": 1636, "because": 1637, "meaningful": 1638, "rstrip": 1639, "filenotfounderror": 1640, "cmd_str": 1641, "127": 1642, "run_and_read_all": 1643, "run_lambda": 1644, "reads": 1645, "entire": 1646, "run_and_parse_first_match": 1647, "run_and_return_first_line": 1648, "get_conda_packages": 1649, "default_conda_patterns": 1650, "conda": 1651, "conda_exe": 1652, "get_gcc_version": 1653, "gcc": 1654, "get_clang_version": 1655, "clang": 1656, "get_cmake_version": 1657, "get_nvidia_driver_version": 1658, "darwin": 1659, "cmd": 1660, "kextstat": 1661, "grep": 1662, "get_nvidia_smi": 1663, "get_gpu_info": 1664, "torch_available": 1665, "hasattr": 1666, "is_available": 1667, "prop": 1668, "get_device_properties": 1669, "gcnarchname": 1670, "gcnarch": 1671, "nogcnarchnameonoldpytorch": 1672, "get_device_name": 1673, "uuid_regex": 1674, "uuid": 1675, "anonymize": 1676, "gpus": 1677, "sub": 1678, "get_running_cuda_version": 1679, "get_cudnn_version": 1680, "libcudnn": 1681, "hard": 1682, "tell": 1683, "being": 1684, "system_root": 1685, "systemroot": 1686, "windows": 1687, "cuda_path": 1688, "where_cmd": 1689, "system32": 1690, "cudnn_cmd": 1691, "cudnn": 1692, "drivers": 1693, "usr": 1694, "installation": 1695, "guide": 1696, "mac": 1697, "deeplearning": 1698, "sdk": 1699, "installmac": 1700, "cudnn_library": 1701, "installed": 1702, "elsewhere": 1703, "ls": 1704, "ldconfig": 1705, "rev": 1706, "cut": 1707, "f1": 1708, "permission": 1709, "realpath": 1710, "files_set": 1711, "eliminate": 1712, "symbolic": 1713, "links": 1714, "alphabetize": 1715, "deterministic": 1716, "sorted": 1717, "probably": 1718, "linux": 1719, "program_files_root": 1720, "programfiles": 1721, "program": 1722, "legacy_path": 1723, "corporation": 1724, "nvsmi": 1725, "new_path": 1726, "smis": 1727, "candidate_smi": 1728, "hipcc": 1729, "get_neuron_sdk_version": 1730, "__version_tuple__": 1731, "version_str": 1732, "changes": 1733, "git_sha": 1734, "date": 1735, "without": 1736, "summarize_vllm_build_flags": 1737, "method": 1738, "flags": 1739, "you": 1740, "variables": 1741, "etc": 1742, "archs": 1743, "torch_cuda_arch_list": 1744, "enabled": 1745, "disabled": 1746, "neuron_cores": 1747, "get_gpu_topo": 1748, "showtopo": 1749, "get_cpu_info": 1750, "lscpu": 1751, "wmic": 1752, "manufacturer": 1753, "family": 1754, "architecture": 1755, "processortype": 1756, "deviceid": 1757, "currentclockspeed": 1758, "maxclockspeed": 1759, "l2cachesize": 1760, "l2cachespeed": 1761, "revision": 1762, "sysctl": 1763, "machdep": 1764, "brand_string": 1765, "cpu_info": 1766, "cygwin": 1767, "get_mac_version": 1768, "sw_vers": 1769, "productversion": 1770, "get_windows_version": 1771, "wmic_cmd": 1772, "wbem": 1773, "findstr_cmd": 1774, "findstr": 1775, "caption": 1776, "get_lsb_version": 1777, "lsb_release": 1778, "description": 1779, "check_release_file": 1780, "pretty_name": 1781, "get_os": 1782, "machine": 1783, "macos": 1784, "ubuntu": 1785, "debian": 1786, "desc": 1787, "reading": 1788, "get_python_platform": 1789, "get_libc_version": 1790, "libc_ver": 1791, "get_pip_packages": 1792, "pip": 1793, "pytorch": 1794, "numpy": 1795, "packages": 1796, "default_pip_patterns": 1797, "run_with_pip": 1798, "pip_spec": 1799, "find_spec": 1800, "pip_available": 1801, "importerror": 1802, "mpip": 1803, "freeze": 1804, "uv": 1805, "pip_version": 1806, "pip3": 1807, "get_cachingallocator_config": 1808, "ca_config": 1809, "pytorch_cuda_alloc_conf": 1810, "get_cuda_module_loading_config": 1811, "init": 1812, "cuda_module_loading": 1813, "is_xnnpack_available": 1814, "backends": 1815, "xnnpack": 1816, "attr": 1817, "get_env_vars": 1818, "env_vars": 1819, "secret_terms": 1820, "secret": 1821, "access": 1822, "password": 1823, "report_prefix": 1824, "nccl": 1825, "cublas": 1826, "omp_": 1827, "mkl_": 1828, "items": 1829, "term": 1830, "lower": 1831, "environment_variables": 1832, "replace_nones": 1833, "dct": 1834, "replacement": 1835, "keys": 1836, "replace_bools": 1837, "yes": 1838, "prepend": 1839, "tag": 1840, "updated_lines": 1841, "replace_if_empty": 1842, "relevant": 1843, "maybe_start_on_next_line": 1844, "multiline": 1845, "get_pretty_env_info": 1846, "pretty_str": 1847, "get_env_info": 1848, "collecting": 1849, "information": 1850, "utils": 1851, "_crash_handler": 1852, "minidump_dir": 1853, "default_minidump_dir": 1854, "dump": 1855, "listdir": 1856, "getctime": 1857, "ctime": 1858, "creation_time": 1859, "datetime": 1860, "fromtimestamp": 1861, "strftime": 1862, "minidump": 1863, "bug": 1864, "report": 1865, "reuse_client": 1866, "_sync_client": 1867, "requests": 1868, "session": 1869, "_async_client": 1870, "aiohttp": 1871, "clientsession": 1872, "get_sync_client": 1873, "async": 1874, "get_async_client": 1875, "trust_env": 1876, "_validate_http_url": 1877, "parsed_url": 1878, "urlparse": 1879, "scheme": 1880, "http": 1881, "invalid": 1882, "valid": 1883, "_headers": 1884, "extras": 1885, "mutablemapping": 1886, "agent": 1887, "vllm_version": 1888, "get_response": 1889, "stream": 1890, "timeout": 1891, "extra_headers": 1892, "mapping": 1893, "client": 1894, "get_async_response": 1895, "await": 1896, "get_bytes": 1897, "bytes": 1898, "raise_for_status": 1899, "async_get_bytes": 1900, "get_text": 1901, "async_get_text": 1902, "get_json": 1903, "async_get_json": 1904, "download_file": 1905, "save_path": 1906, "chunk_size": 1907, "128": 1908, "iter_content": 1909, "async_download_file": 1910, "iter_chunked": 1911, "get_default_cache_root": 1912, "xdg_cache_home": 1913, "expanduser": 1914, "get_default_config_root": 1915, "xdg_config_home": 1916, "maybe_convert_int": 1917, "maybe_convert_bool": 1918, "get_vllm_port": 1919, "port": 1920, "vllm_port": 1921, "integer": 1922, "uri": 1923, "suggest": 1924, "k8s": 1925, "service": 1926, "discovery": 1927, "issue": 1928, "parsed": 1929, "caused": 1930, "kubernetes": 1931, "ai": 1932, "en": 1933, "stable": 1934, "serving": 1935, "__getattr__": 1936, "lazy": 1937, "evaluation": 1938, "__name__": 1939, "__dir__": 1940, "is_set": 1941, "explicitly": 1942, "set_vllm_use_v1": 1943, "use_v1": 1944, "vllm_use_v1": 1945, "batchdescriptor": 1946, "namedtuple": 1947, "descriptor": 1948, "cudagraph": 1949, "dispatching": 1950, "minimal": 1951, "possible": 1952, "properly": 1953, "uniquely": 1954, "describe": 1955, "padded": 1956, "num_tokens": 1957, "uniform_decode": 1958, "uniform": 1959, "dispatch": 1960, "supporting": 1961, "batches": 1962, "property": 1963, "non_uniform": 1964, "_compute_chunked_local_num_tokens": 1965, "num_tokens_across_dp_cpu": 1966, "max_num_tokens": 1967, "chunk_idx": 1968, "dp_size": 1969, "local_size": 1970, "dp_tokens": 1971, "min": 1972, "lockstep": 1973, "even": 1974, "done": 1975, "num_tokens_across_dp": 1976, "dp_rank": 1977, "gather": 1978, "across": 1979, "dp": 1980, "ranks": 1981, "results": 1982, "num_tokens_tensor": 1983, "distributed": 1984, "parallel_state": 1985, "get_dp_group": 1986, "dist": 1987, "cpu_group": 1988, "parallel_config": 1989, "parallelconfig": 1990, "attn_metadata": 1991, "dpmetadata": 1992, "data_parallel_size": 1993, "data_parallel_rank": 1994, "num_prefill_tokens": 1995, "v0": 1996, "batchsize": 1997, "num_decode_tokens": 1998, "v1": 1999, "max_tokens_across_dp_cpu": 2000, "cu_tokens_across_dp_cpu": 2001, "chunked_sizes": 2002, "max_chunk_size_per_rank": 2003, "manager": 2004, "temporarily": 2005, "chunked": 2006, "execution": 2007, "parallel": 2008, "processes": 2009, "designated": 2010, "portion": 2011, "others": 2012, "uneven": 2013, "local_sizes": 2014, "process": 2015, "cumulative": 2016, "derive": 2017, "wise": 2018, "inside": 2019, "cu_sizes": 2020, "item": 2021, "get_chunk_sizes_across_dp_rank": 2022, "forwardcontext": 2023, "vllm_config": 2024, "compilation_config": 2025, "static_forward_context": 2026, "no_compile_layers": 2027, "attentionmetadata": 2028, "map": 2029, "layer_name": 2030, "layer": 2031, "dynamically": 2032, "making": 2033, "virtual_engines": 2034, "share": 2035, "virtual_engine": 2036, "dp_metadata": 2037, "style": 2038, "full": 2039, "piecewise": 2040, "cudagraph_runtime_mode": 2041, "cudagraphmode": 2042, "batch_descriptor": 2043, "__post_init__": 2044, "mode": 2045, "get_forward_context": 2046, "_forward_context": 2047, "set_forward_context": 2048, "_print_debug_once": 2049, "hashable": 2050, "stacklevel": 2051, "caller": 2052, "_print_info_once": 2053, "_print_warning_once": 2054, "_vllmlogger": 2055, "provide": 2056, "methods": 2057, "logging": 2058, "instance": 2059, "conflicting": 2060, "intel_extension_for_pytorch": 2061, "_logger": 2062, "debug_once": 2063, "silently": 2064, "info_once": 2065, "_configure_vllm_root_logger": 2066, "logging_config": 2067, "vllm_configure_logging": 2068, "vllm_logging_config_path": 2069, "evaluated": 2070, "implies": 2071, "unset": 2072, "default_logging_config": 2073, "load": 2074, "custom_config": 2075, "formatter": 2076, "formatters": 2077, "values": 2078, "provides": 2079, "backwards": 2080, "compatibility": 2081, "10134": 2082, "newlineformatter": 2083, "logging_utils": 2084, "dictconfig": 2085, "init_logger": 2086, "purpose": 2087, "loggers": 2088, "retrieved": 2089, "way": 2090, "been": 2091, "getlogger": 2092, "method_name": 2093, "_methods_to_patch": 2094, "setattr": 2095, "methodtype": 2096, "cast": 2097, "_trace_calls": 2098, "log_path": 2099, "frame": 2100, "event": 2101, "arg": 2102, "f_code": 2103, "co_filename": 2104, "f_lineno": 2105, "func_name": 2106, "co_name": 2107, "functions": 2108, "every": 2109, "last_frame": 2110, "f_back": 2111, "last_filename": 2112, "last_lineno": 2113, "last_func_name": 2114, "initial": 2115, "ts": 2116, "now": 2117, "nameerror": 2118, "deleted": 2119, "shutdown": 2120, "partial": 2121, "enable_trace_function_call": 2122, "log_file_path": 2123, "tracing": 2124, "under": 2125, "useful": 2126, "debugging": 2127, "hangs": 2128, "crashes": 2129, "thread": 2130, "calling": 2131, "affected": 2132, "vllm_trace_function": 2133, "record": 2134, "slow": 2135, "down": 2136, "suggested": 2137, "hang": 2138, "saved": 2139, "settrace": 2140, "get_bad_words_logits_processors": 2141, "bad_words": 2142, "tokenizer": 2143, "anytokenizer": 2144, "logitsprocessor": 2145, "bad_words_ids": 2146, "bad_word": 2147, "prohibit": 2148, "words": 2149, "beginning": 2150, "middle": 2151, "add_prefix_space": 2152, "parameter": 2153, "lstrip": 2154, "prompt_token_ids": 2155, "encode": 2156, "add_special_tokens": 2157, "space": 2158, "produces": 2159, "new": 2160, "nobadwordslogitsprocessor": 2161, "word_bias": 2162, "floattensor": 2163, "__call__": 2164, "past_tokens_ids": 2165, "_init_word_bias": 2166, "last_token_bias": 2167, "zeros_like": 2168, "bad_word_ids": 2169, "processed": 2170, "prefix_length": 2171, "last_token_id": 2172, "actual_prefix": 2173, "expected_prefix": 2174, "is_match": 2175, "_smallest_logit": 2176, "_neutral_logit": 2177, "sequencebiaslogitsprocessor": 2178, "logits_process": 2179, "_check_token_ids_bounds": 2180, "bad_word_id": 2181, "invalid_token_ids": 2182, "token_id": 2183, "model": 2184, "vocabulary": 2185, "bad": 2186, "integers": 2187, "satisfying": 2188, "completionoutput": 2189, "completion": 2190, "generated": 2191, "token_ids": 2192, "ids": 2193, "probabilities": 2194, "position": 2195, "requested": 2196, "reason": 2197, "why": 2198, "finished": 2199, "stop": 2200, "including": 2201, "encountering": 2202, "eos": 2203, "lora": 2204, "genericsequence": 2205, "samplelogprobs": 2206, "__repr__": 2207, "poolingoutput": 2208, "pooling": 2209, "extracted": 2210, "hidden": 2211, "states": 2212, "__eq__": 2213, "__class__": 2214, "request_id": 2215, "prompt_logprobs": 2216, "promptlogprobs": 2217, "metrics": 2218, "requestmetrics": 2219, "encoder_prompt": 2220, "encoder_prompt_token_ids": 2221, "num_cached_tokens": 2222, "multi_modal_placeholders": 2223, "multimodalplaceholderdict": 2224, "kv_transfer_params": 2225, "added": 2226, "still": 2227, "older": 2228, "breaking": 2229, "requestoutput": 2230, "ignoring": 2231, "next_output": 2232, "aggregate": 2233, "next_completion": 2234, "mutablesequence": 2235, "from_seq_group": 2236, "cls": 2237, "seq_group": 2238, "sequencegroup": 2239, "use_cache": 2240, "seq_id_to_seq_group": 2241, "sequencegroupbase": 2242, "is_finished": 2243, "assembled_seq_group": 2244, "maybe_assemble_group": 2245, "finish_seq": 2246, "clear": 2247, "seq": 2248, "to_be_finished": 2249, "sub_request_id": 2250, "seq_id_to_index": 2251, "del": 2252, "sampling_params": 2253, "sampling": 2254, "completionrequest": 2255, "output_kind": 2256, "requestoutputkind": 2257, "final_only": 2258, "needed": 2259, "cached_request_output": 2260, "top_n_seqs": 2261, "get_seqs": 2262, "omit": 2263, "sampled": 2264, "include_logprobs": 2265, "text_buffer_length": 2266, "output_text_buffer_length": 2267, "include_prompt": 2268, "output_text": 2269, "get_output_text_to_return": 2270, "output_token_ids": 2271, "get_output_token_ids_to_return": 2272, "num_output_tokens": 2273, "get_num_cached_tokens": 2274, "output_logprobs": 2275, "slice": 2276, "applicable": 2277, "finishes": 2278, "get_output_len": 2279, "cached_outputs": 2280, "get_cumulative_logprob": 2281, "sequencestatus": 2282, "get_finished_reason": 2283, "finished_time": 2284, "set_finished_time": 2285, "init_kwargs": 2286, "request_output": 2287, "poolingrequestoutput": 2288, "generic": 2289, "_o": 2290, "unique": 2291, "identifier": 2292, "flag": 2293, "staticmethod": 2294, "pooled_data": 2295, "requestoutputfactory": 2296, "embeddingoutput": 2297, "embedding": 2298, "vector": 2299, "floats": 2300, "depends": 2301, "from_base": 2302, "pooling_output": 2303, "tolist": 2304, "hidden_size": 2305, "embeddingrequestoutput": 2306, "classificationoutput": 2307, "classification": 2308, "probs": 2309, "classes": 2310, "num_classes": 2311, "classificationrequestoutput": 2312, "scoringoutput": 2313, "scoring": 2314, "similarity": 2315, "scalar": 2316, "classify": 2317, "embed": 2318, "squeeze": 2319, "scoringrequestoutput": 2320, "all_parameters": 2321, "activation": 2322, "step_tag_id": 2323, "returned_token_ids": 2324, "valid_parameters": 2325, "clone": 2326, "poolingparams": 2327, "deep": 2328, "deepcopy": 2329, "verify": 2330, "poolingtask": 2331, "model_config": 2332, "modelconfig": 2333, "overwrite": 2334, "validation": 2335, "needs": 2336, "against": 2337, "_merge_default_parameters": 2338, "_set_default_parameters": 2339, "_verify_valid_parameters": 2340, "pooler_config": 2341, "getattr": 2342, "is_matryoshka": 2343, "served_model_name": 2344, "matryoshka": 2345, "changing": 2346, "lead": 2347, "poor": 2348, "mds": 2349, "matryoshka_dimensions": 2350, "supports": 2351, "greater": 2352, "invalid_parameters": 2353, "requires_token_ids": 2354, "extra_kwargs": 2355, "samplingtype": 2356, "intenum": 2357, "greedy": 2358, "random": 2359, "random_seed": 2360, "from_optional": 2361, "basemodel": 2362, "choice": 2363, "grammar": 2364, "json_object": 2365, "backend": 2366, "whitespace_pattern": 2367, "structural_tag": 2368, "guideddecodingparams": 2369, "schemas": 2370, "pydantic": 2371, "models": 2372, "model_json_schema": 2373, "fields": 2374, "mutually": 2375, "exclusive": 2376, "guide_count": 2377, "sum": 2378, "kind": 2379, "guided": 2380, "decoding": 2381, "__dict__": 2382, "far": 2383, "deltas": 2384, "do": 2385, "intermediate": 2386, "best_of": 2387, "presence_penalty": 2388, "frequency_penalty": 2389, "repetition_penalty": 2390, "temperature": 2391, "top_p": 2392, "min_p": 2393, "seed": 2394, "stop_token_ids": 2395, "include_stop_str_in_output": 2396, "ignore_eos": 2397, "max_tokens": 2398, "min_tokens": 2399, "detokenize": 2400, "skip_special_tokens": 2401, "spaces_between_special_tokens": 2402, "logits_processors": 2403, "truncate_prompt_tokens": 2404, "msgspec": 2405, "meta": 2406, "ge": 2407, "guided_decoding": 2408, "logit_bias": 2409, "allowed_token_ids": 2410, "extra_args": 2411, "samplingparams": 2412, "convert": 2413, "clamp": 2414, "100": 2415, "openai": 2416, "deal": 2417, "_real_n": 2418, "_max_temp": 2419, "less": 2420, "numerical": 2421, "nan": 2422, "inf": 2423, "maxed": 2424, "characters": 2425, "hold": 2426, "until": 2427, "_verify_args": 2428, "_sampling_eps": 2429, "_verify_greedy_sampling": 2430, "engine": 2431, "_all_stop_token_ids": 2432, "least": 2433, "negative": 2434, "quietly": 2435, "accept": 2436, "prefer": 2437, "disable": 2438, "typeerror": 2439, "st_id": 2440, "stop_str": 2441, "strings": 2442, "update_from_generation_config": 2443, "generation_config": 2444, "model_eos_token_id": 2445, "processing": 2446, "eos_ids": 2447, "primary": 2448, "since": 2449, "handled": 2450, "separately": 2451, "stopping": 2452, "purposes": 2453, "discard": 2454, "update_from_tokenizer": 2455, "_bad_words_token_ids": 2456, "bad_words_token_ids": 2457, "max_token_id": 2458, "sampling_type": 2459, "all_stop_token_ids": 2460, "internal": 2461, "backward": 2462, "guaranteed": 2463, "objects": 2464, "arbitrary": 2465, "nontrivial": 2466, "amount": 2467, "expensive": 2468, "however": 2469, "copied": 2470, "processor": 2471, "issues": 2472, "3087": 2473, "logit_processor_refs": 2474, "lp": 2475, "memo": 2476, "beamsearchparams": 2477, "struct": 2478, "omit_defaults": 2479, "cached_property": 2480, "beam_width": 2481, "nanrepr": 2482, "nans": 2483, "ieee_754": 2484, "exp": 2485, "1s": 2486, "mantissa": 2487, "0s": 2488, "extd_range_max_min": 2489, "_floating_point_max_int": 2490, "52": 2491, "exponent": 2492, "represent": 2493, "double": 2494, "__str__": 2495, "max_mantissa": 2496, "nan_repr": 2497, "max_exponent": 2498, "adjust": 2499, "assume": 2500, "bits": 2501, "precedent": 2502, "biases": 2503, "float8_e4m3b11fnuz": 2504, "jax": 2505, "ml": 2506, "ml_dtypes": 2507, "premature": 2508, "over": 2509, "complication": 2510, "assuming": 2511, "exponent_bias": 2512, "exponent_bias_double": 2513, "max_exponent_double": 2514, "shift": 2515, "ieee": 2516, "bitwise": 2517, "_floating_point_max": 2518, "double_raw": 2519, "unpack": 2520, "pack": 2521, "_raw_max": 2522, "is_floating_point": 2523, "size_bits": 2524, "is_signed": 2525, "_raw_min": 2526, "signed": 2527, "sign_bit_double": 2528, "63": 2529, "max_raw": 2530, "min_raw": 2531, "int64_t": 2532, "custom": 2533, "layout": 2534, "kept": 2535, "sync": 2536, "from_id": 2537, "val": 2538, "offset": 2539, "or_and_advance": 2540, "member": 2541, "bit_width": 2542, "bit_mask": 2543, "_finite_values_only": 2544, "too": 2545, "big": 2546, "int64": 2547, "_scalar_types_id_map": 2548, "representable": 2549, "accounting": 2550, "sign": 2551, "consistency": 2552, "is_integer": 2553, "has_bias": 2554, "has_infs": 2555, "infinity": 2556, "has_nans": 2557, "is_ieee_754": 2558, "follows": 2559, "754": 2560, "conventions": 2561, "naming": 2562, "generally": 2563, "_e": 2564, "exponent_bits": 2565, "mantissa_bits": 2566, "finite": 2567, "infinities": 2568, "ret": 2569, "uint": 2570, "__len__": 2571, "int_": 2572, "b018": 2573, "unsigned": 2574, "float_ieee754": 2575, "float_": 2576, "finite_values_only": 2577, "follow": 2578, "constructor": 2579, "scalar_type_id": 2580, "doesn": 2581, "scalar_types": 2582, "int4": 2583, "uint4": 2584, "float8_e5m2": 2585, "float8_e8m0fnu": 2586, "float16_e8m7": 2587, "float16_e5m10": 2588, "fp6": 2589, "usyd": 2590, "fsalab": 2591, "fp6_llm": 2592, "float6_e3m2f": 2593, "www": 2594, "opencompute": 2595, "documents": 2596, "ocp": 2597, "microscaling": 2598, "formats": 2599, "mx": 2600, "final": 2601, "pdf": 2602, "float4_e2m1f": 2603, "gptq": 2604, "uint2b2": 2605, "uint3b4": 2606, "uint4b8": 2607, "uint8b128": 2608, "colloquial": 2609, "scripts": 2610, "deprecated": 2611, "entrypoints": 2612, "cli": 2613, 