{"def": 0, "load_module_from_path": 1, "module_name": 2, "path": 3, "spec": 4, "importlib": 5, "util": 6, "spec_from_file_location": 7, "module": 8, "module_from_spec": 9, "sys": 10, "modules": 11, "loader": 12, "exec_module": 13, "return": 14, "is_sccache_available": 15, "bool": 16, "which": 17, "sccache": 18, "none": 19, "int": 20, "os": 21, "getenv": 22, "vllm_disable_sccache": 23, "is_ccache_available": 24, "ccache": 25, "is_ninja_available": 26, "ninja": 27, "is_url_available": 28, "url": 29, "str": 30, "from": 31, "urllib": 32, "request": 33, "import": 34, "urlopen": 35, "status": 36, "try": 37, "except": 38, "exception": 39, "false": 40, "200": 41, "class": 42, "cmakeextension": 43, "extension": 44, "__init__": 45, "self": 46, "name": 47, "cmake_lists_dir": 48, "kwa": 49, "super": 50, "sources": 51, "py_limited_api": 52, "true": 53, "abspath": 54, "compute_num_jobs": 55, "num_jobs": 56, "either": 57, "value": 58, "max_jobs": 59, "environment": 60, "variable": 61, "defined": 62, "number": 63, "cpus": 64, "available": 65, "envs": 66, "logger": 67, "info": 68, "using": 69, "jobs": 70, "else": 71, "sched_getaffinity": 72, "isn": 73, "universally": 74, "so": 75, "fall": 76, "back": 77, "cpu_count": 78, "we": 79, "get": 80, "error": 81, "here": 82, "len": 83, "attributeerror": 84, "nvcc_threads": 85, "_is_cuda": 86, "get_nvcc_cuda_version": 87, "version": 88, "11": 89, "when": 90, "set": 91, "reduce": 92, "avoid": 93, "overloading": 94, "system": 95, "nvcc": 96, "threads": 97, "max": 98, "configure": 99, "ext": 100, "ve": 101, "already": 102, "configured": 103, "cmakelists": 104, "txt": 105, "exit": 106, "early": 107, "cmake_build_ext": 108, "did_config": 109, "select": 110, "build": 111, "type": 112, "note": 113, "optimization": 114, "level": 115, "debug": 116, "default_cfg": 117, "relwithdebinfo": 118, "cfg": 119, "cmake_build_type": 120, "cmake_args": 121, "dcmake_build_type": 122, "format": 123, "dvllm_target_device": 124, "vllm_target_device": 125, "verbose": 126, "dcmake_verbose_makefile": 127, "dcmake_c_compiler_launcher": 128, "dcmake_cxx_compiler_launcher": 129, "dcmake_cuda_compiler_launcher": 130, "dcmake_hip_compiler_launcher": 131, "elif": 132, "pass": 133, "python": 134, "executable": 135, "cmake": 136, "can": 137, "find": 138, "exact": 139, "match": 140, "dvllm_python_executable": 141, "reuse": 142, "dependencies": 143, "subsequent": 144, "calls": 145, "dvllm_python_path": 146, "join": 147, "override": 148, "base": 149, "directory": 150, "fetchcontent": 151, "downloads": 152, "root": 153, "deps": 154, "allows": 155, "sharing": 156, "between": 157, "profiles": 158, "plays": 159, "more": 160, "nicely": 161, "fetchcontent_base_dir": 162, "fc_base_dir": 163, "root_dir": 164, "environ": 165, "dfetchcontent_base_dir": 166, "setup": 167, "parallelism": 168, "tool": 169, "dnvcc_threads": 170, "build_tool": 171, "dcmake_job_pool_compile": 172, "string": 173, "compile": 174, "dcmake_job_pools": 175, "default": 176, "whatever": 177, "picks": 178, "make": 179, "sure": 180, "use": 181, "cuda_home": 182, "dcmake_cuda_compiler": 183, "bin": 184, "subprocess": 185, "check_call": 186, "cwd": 187, "build_temp": 188, "build_extensions": 189, "ensure": 190, "present": 191, "working": 192, "check_output": 193, "oserror": 194, "raise": 195, "runtimeerror": 196, "cannot": 197, "create": 198, "does": 199, "exist": 200, "exists": 201, "makedirs": 202, "targets": 203, "target_name": 204, "removeprefix": 205, "vllm": 206, "vllm_flash_attn": 207, "all": 208, "extensions": 209, "append": 210, "build_args": 211, "target": 212, "install": 213, "libraries": 214, "proper": 215, "location": 216, "outdir": 217, "get_ext_fullpath": 218, "parent": 219, "absolute": 220, "skip": 221, "same": 222, "continue": 223, "appends": 224, "prefix": 225, "contains": 226, "need": 227, "remove": 228, "range": 229, "count": 230, "should": 231, "actually": 232, "components": 233, "install_args": 234, "component": 235, "run": 236, "first": 237, "standard": 238, "build_ext": 239, "command": 240, "copy": 241, "py": 242, "build_lib": 243, "current": 244, "included": 245, "editable": 246, "glob": 247, "files": 248, "recursive": 249, "file": 250, "dst_file": 251, "split": 252, "print": 253, "copying": 254, "dirname": 255, "exist_ok": 256, "copy_file": 257, "precompiled_build_ext": 258, "disables": 259, "building": 260, "precompiled": 261, "binaries": 262, "assert": 263, "vllm_use_precompiled": 264, "only": 265, "supported": 266, "cuda": 267, "builds": 268, "skipping": 269, "extract_precompiled_and_patch_package": 270, "wheel_url_or_path": 271, "dict": 272, "tempfile": 273, "zipfile": 274, "temp_dir": 275, "isfile": 276, "wheel_filename": 277, "mkdtemp": 278, "wheels": 279, "wheel_path": 280, "downloading": 281, "wheel": 282, "urlretrieve": 283, "filename": 284, "existing": 285, "package_data_patch": 286, "files_to_copy": 287, "_c": 288, "abi3": 289, "_moe_c": 290, "_flashmla_c": 291, "_vllm_fa2_c": 292, "_vllm_fa3_c": 293, "cumem_allocator": 294, "compiled_regex": 295, "re": 296, "file_members": 297, "list": 298, "filter": 299, "lambda": 300, "filelist": 301, "extract": 302, "target_path": 303, "open": 304, "src": 305, "wb": 306, "dst": 307, "shutil": 308, "copyfileobj": 309, "pkg": 310, "replace": 311, "setdefault": 312, "basename": 313, "finally": 314, "removing": 315, "temporary": 316, "rmtree": 317, "get_base_commit_in_main_branch": 318, "force": 319, "nightly": 320, "mainly": 321, "used": 322, "ci": 323, "testing": 324, "vllm_test_use_precompiled_nightly_wheel": 325, "latest": 326, "commit": 327, "hash": 328, "upstream": 329, "main": 330, "branch": 331, "resp_json": 332, "curl": 333, "https": 334, "api": 335, "github": 336, "com": 337, "repos": 338, "project": 339, "commits": 340, "decode": 341, "utf": 342, "upstream_main_commit": 343, "json": 344, "loads": 345, "sha": 346, "docker": 347, "context": 348, "git": 349, "may": 350, "immutable": 351, "missing": 352, "vllm_docker_build_context": 353, "check": 354, "local": 355, "repo": 356, "cat": 357, "calledprocesserror": 358, "fetch": 359, "remote": 360, "repository": 361, "update": 362, "any": 363, "branches": 364, "ensures": 365, "ref": 366, "its": 367, "history": 368, "our": 369, "current_branch": 370, "show": 371, "strip": 372, "base_commit": 373, "merge": 374, "valueerror": 375, "err": 376, "warning": 377, "failed": 378, "compatible": 379, "your": 380, "dev": 381, "_no_device": 382, "empty": 383, "has_cuda": 384, "torch": 385, "_is_neuron": 386, "_is_tpu": 387, "_is_hip": 388, "rocm": 389, "hip": 390, "neuron": 391, "tpu": 392, "_is_cpu": 393, "cpu": 394, "_is_xpu": 395, "xpu": 396, "_build_custom_ops": 397, "get_rocm_version": 398, "rocm_home": 399, "librocm": 400, "core": 401, "see": 402, "blob": 403, "d11f5c20d500f729c393680a01fa902ebf92094b": 404, "rocm_version": 405, "cpp": 406, "l21": 407, "librocm_core_file": 408, "lib": 409, "is_file": 410, "librocm_core": 411, "ctypes": 412, "cdll": 413, "vererrors": 414, "c_uint32": 415, "get_rocm_core_version": 416, "getrocmversion": 417, "restype": 418, "argtypes": 419, "pointer": 420, "major": 421, "minor": 422, "patch": 423, "byref": 424, "get_neuronxcc_version": 425, "sysconfig": 426, "site_dir": 427, "get_paths": 428, "purelib": 429, "version_file": 430, "neuronxcc": 431, "executed": 432, "successfully": 433, "fp": 434, "content": 435, "read": 436, "regular": 437, "expression": 438, "search": 439, "__version__": 440, "group": 441, "could": 442, "output": 443, "adapted": 444, "nvidia": 445, "apex": 446, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 447, "nvcc_output": 448, "universal_newlines": 449, "release_idx": 450, "index": 451, "release": 452, "nvcc_cuda_version": 453, "parse": 454, "get_gaudi_sw_version": 455, "returns": 456, "driver": 457, "enable": 458, "console": 459, "printing": 460, "hl": 461, "smi": 462, "shell": 463, "text": 464, "capture_output": 465, "env": 466, "enable_console": 467, "returncode": 468, "stdout": 469, "get_vllm_version": 470, "get_version": 471, "write_to": 472, "_version": 473, "sep": 474, "versions": 475, "might": 476, "contain": 477, "cuda_version": 478, "main_cuda_version": 479, "cuda_version_str": 480, "source": 481, "tarball": 482, "required": 483, "pypi": 484, "sdist": 485, "argv": 486, "cu": 487, "neuron_version": 488, "neuron_version_str": 489, "unknown": 490, "runtime": 491, "get_requirements": 492, "package": 493, "requirements": 494, "requirements_dir": 495, "_read_requirements": 496, "resolved_requirements": 497, "line": 498, "startswith": 499, "common": 500, "cuda_major": 501, "cuda_minor": 502, "modified_requirements": 503, "req": 504, "flash": 505, "attn": 506, "12": 507, "built": 508, "other": 509, "unsupported": 510, "platform": 511, "please": 512, "find_cuda_init": 513, "fn": 514, "callable": 515, "object": 516, "helper": 517, "function": 518, "initialization": 519, "errors": 520, "initializes": 521, "prints": 522, "stack": 523, "trace": 524, "how": 525, "happens": 526, "_lazy_init": 527, "wrapper": 528, "nonlocal": 529, "traceback": 530, "extract_stack": 531, "initialized": 532, "format_list": 533, "samplingtype": 534, "intenum": 535, "greedy": 536, "random": 537, "random_seed": 538, "from_optional": 539, "optional": 540, "union": 541, "basemodel": 542, "regex": 543, "choice": 544, "grammar": 545, "json_object": 546, "backend": 547, "whitespace_pattern": 548, "structural_tag": 549, "guideddecodingparams": 550, "arg": 551, "schemas": 552, "pydantic": 553, "models": 554, "isinstance": 555, "model_json_schema": 556, "__post_init__": 557, "validate": 558, "some": 559, "fields": 560, "mutually": 561, "exclusive": 562, "guide_count": 563, "sum": 564, "you": 565, "one": 566, "kind": 567, "guided": 568, "decoding": 569, "multiple": 570, "specified": 571, "__dict__": 572, "requestoutputkind": 573, "enum": 574, "entire": 575, "far": 576, "every": 577, "requestoutput": 578, "cumulative": 579, "deltas": 580, "each": 581, "delta": 582, "do": 583, "intermediate": 584, "final_only": 585, "best_of": 586, "presence_penalty": 587, "float": 588, "frequency_penalty": 589, "repetition_penalty": 590, "temperature": 591, "top_p": 592, "top_k": 593, "min_p": 594, "seed": 595, "stop": 596, "stop_token_ids": 597, "bad_words": 598, "include_stop_str_in_output": 599, "ignore_eos": 600, "max_tokens": 601, "16": 602, "min_tokens": 603, "logprobs": 604, "prompt_logprobs": 605, "detokenize": 606, "skip_special_tokens": 607, "spaces_between_special_tokens": 608, "logits_processors": 609, "logitsprocessor": 610, "truncate_prompt_tokens": 611, "annotated": 612, "msgspec": 613, "meta": 614, "ge": 615, "output_kind": 616, "guided_decoding": 617, "logit_bias": 618, "allowed_token_ids": 619, "extra_args": 620, "samplingparams": 621, "convert": 622, "token_id": 623, "integer": 624, "clamp": 625, "bias": 626, "100": 627, "per": 628, "openai": 629, "token": 630, "min": 631, "items": 632, "deal": 633, "_real_n": 634, "original": 635, "result": 636, "results": 637, "must": 638, "greater": 639, "than": 640, "equal": 641, "got": 642, "_max_temp": 643, "less": 644, "cause": 645, "numerical": 646, "nan": 647, "inf": 648, "tensors": 649, "have": 650, "maxed": 651, "out": 652, "characters": 653, "hold": 654, "evaluation": 655, "until": 656, "sequence": 657, "finished": 658, "output_text_buffer_length": 659, "_verify_args": 660, "_sampling_eps": 661, "zero": 662, "means": 663, "sampling": 664, "_verify_greedy_sampling": 665, "eos_token_id": 666, "added": 667, "engine": 668, "_all_stop_token_ids": 669, "least": 670, "non": 671, "negative": 672, "quietly": 673, "accept": 674, "disabled": 675, "prefer": 676, "disable": 677, "typeerror": 678, "__name__": 679, "st_id": 680, "integers": 681, "stop_str": 682, "strings": 683, "update_from_generation_config": 684, "generation_config": 685, "model_eos_token_id": 686, "values": 687, "add": 688, "eos": 689, "id": 690, "sampling_params": 691, "support": 692, "processing": 693, "generation": 694, "eos_ids": 695, "don": 696, "include": 697, "primary": 698, "since": 699, "handled": 700, "separately": 701, "stopping": 702, "purposes": 703, "discard": 704, "update_from_tokenizer": 705, "tokenizer": 706, "anytokenizer": 707, "_bad_words_token_ids": 708, "bad_word": 709, "prohibit": 710, "words": 711, "both": 712, "beginning": 713, "middle": 714, "related": 715, "add_prefix_space": 716, "parameter": 717, "prompt": 718, "lstrip": 719, "prompt_token_ids": 720, "encode": 721, "add_special_tokens": 722, "space": 723, "produces": 724, "new": 725, "word": 726, "invalid_token_ids": 727, "bad_words_token_ids": 728, "max_token_id": 729, "model": 730, "vocabulary": 731, "size": 732, "following": 733, "tokens": 734, "were": 735, "bad": 736, "satisfying": 737, "sampling_type": 738, "all_stop_token_ids": 739, "internal": 740, "backward": 741, "compatibility": 742, "guaranteed": 743, "clone": 744, "deep": 745, "maybe": 746, "objects": 747, "arbitrary": 748, "nontrivial": 749, "amount": 750, "data": 751, "expensive": 752, "however": 753, "copied": 754, "processor": 755, "needs": 756, "parallel": 757, "sequences": 758, "issues": 759, "3087": 760, "logit_processor_refs": 761, "lp": 762, "hasattr": 763, "deepcopy": 764, "memo": 765, "__repr__": 766, "beamsearchparams": 767, "struct": 768, "omit_defaults": 769, "ignore": 770, "call": 771, "cached_property": 772, "beam": 773, "parameters": 774, "beam_width": 775, "length_penalty": 776, "all_parameters": 777, "dimensions": 778, "normalize": 779, "activation": 780, "softmax": 781, "step_tag_id": 782, "returned_token_ids": 783, "valid_parameters": 784, "embed": 785, "classify": 786, "score": 787, "poolingparams": 788, "instance": 789, "verify": 790, "task": 791, "poolingtask": 792, "model_config": 793, "modelconfig": 794, "msg": 795, "overwrite": 796, "validation": 797, "done": 798, "against": 799, "config": 800, "method": 801, "_merge_default_parameters": 802, "_set_default_parameters": 803, "_verify_valid_parameters": 804, "pooler_config": 805, "getattr": 806, "setattr": 807, "is_matryoshka": 808, "served_model_name": 809, "matryoshka": 810, "representation": 811, "changing": 812, "lead": 813, "poor": 814, "mds": 815, "matryoshka_dimensions": 816, "supports": 817, "pooling": 818, "invalid_parameters": 819, "requires_token_ids": 820, "extra_kwargs": 821, "has": 822, "get_default_cache_root": 823, "xdg_cache_home": 824, "expanduser": 825, "cache": 826, "get_default_config_root": 827, "xdg_config_home": 828, "maybe_convert_int": 829, "maybe_convert_bool": 830, "get_vllm_port": 831, "port": 832, "vllm_port": 833, "otherwise": 834, "raises": 835, "uri": 836, "suggest": 837, "k8s": 838, "service": 839, "discovery": 840, "issue": 841, "urlparse": 842, "parsed": 843, "scheme": 844, "appears": 845, "caused": 846, "kubernetes": 847, "docs": 848, "ai": 849, "en": 850, "stable": 851, "serving": 852, "env_vars": 853, "html": 854, "valid": 855, "__getattr__": 856, "lazy": 857, "variables": 858, "environment_variables": 859, "attribute": 860, "__dir__": 861, "keys": 862, "is_set": 863, "explicitly": 864, "set_vllm_use_v1": 865, "use_v1": 866, "vllm_use_v1": 867, "user": 868, "_reshape_activation_tensor": 869, "tensor": 870, "tuple": 871, "num": 872, "reshape": 873, "x1": 874, "x2": 875, "chunk": 876, "chunks": 877, "dim": 878, "silu_and_mul": 879, "ipex": 880, "llm": 881, "functional": 882, "gelu_and_mul": 883, "gelu_tanh_and_mul": 884, "gelu_fast": 885, "nn": 886, "gelu": 887, "gelu_new": 888, "gelu_quick": 889, "paged_attention_v1": 890, "query": 891, "key_cache": 892, "value_cache": 893, "num_kv_heads": 894, "scale": 895, "block_tables": 896, "context_lens": 897, "block_size": 898, "max_context_len": 899, "alibi_slopes": 900, "kv_cache_dtype": 901, "k_scale": 902, "v_scale": 903, "tp_rank": 904, "blocksparse_local_blocks": 905, "blocksparse_vert_stride": 906, "blocksparse_block_size": 907, "64": 908, "blocksparse_head_sliding_step": 909, "auto": 910, "num_heads": 911, "num_queries_per_tokens": 912, "pagedattention": 913, "single_query_kv_attention": 914, "contiguous": 915, "view_as": 916, "paged_attention_v2": 917, "exp_sum": 918, "max_logits": 919, "tmp_out": 920, "rotary_embedding": 921, "positions": 922, "batch_size": 923, "seq_len": 924, "head_size": 925, "key": 926, "cos_sin_cache": 927, "cos_sin_dim": 928, "rot_dim": 929, "is_neox": 930, "rotary_embedding_batched": 931, "batched_rotary_embedding": 932, "cos_sin_cache_offsets": 933, "rms_norm": 934, "input": 935, "weight": 936, "epsilon": 937, "fused_add_rms_norm": 938, "residual": 939, "tmp": 940, "add_rms_norm": 941, "copy_": 942, "varlen_attention": 943, "seqlen_q": 944, "seqlen_k": 945, "max_seqlen_q": 946, "max_seqlen_k": 947, "pdropout": 948, "softmax_scale": 949, "zero_tensors": 950, "is_causal": 951, "return_softmax": 952, "gen_": 953, "generator": 954, "window_size_left": 955, "window_size_right": 956, "logits_soft_cap": 957, "endswith": 958, "reshape_and_cache": 959, "slot_mapping": 960, "reshape_and_cache_flash": 961, "k_scale_float": 962, "v_scale_float": 963, "todo": 964, "fp8": 965, "kv": 966, "flash_attn_varlen_func": 967, "cu_seqlens_q": 968, "seqused_k": 969, "kernel": 970, "causal": 971, "block_table": 972, "window_size": 973, "softcap": 974, "cu_seqlens_k": 975, "currently": 976, "keep": 977, "scheduler_metadata": 978, "fa_version": 979, "q_descale": 980, "k_descale": 981, "v_descale": 982, "num_splits": 983, "s_aux": 984, "cumsum": 985, "device": 986, "dtype": 987, "int32": 988, "real_window_size": 989, "get_scheduler_metadata": 990, "num_heads_q": 991, "num_heads_kv": 992, "headdim": 993, "cache_seqlens": 994, "qkv_dtype": 995, "bfloat16": 996, "headdim_v": 997, "cu_seqlens_k_new": 998, "cache_leftpad": 999, "page_size": 1000, "max_seqlen_k_new": 1001, "infinite": 1002, "window": 1003, "has_softcap": 1004, "tuned": 1005, "speed": 1006, "pack_gqa": 1007, "sm_margin": 1008, "sms": 1009, "communication": 1010, "warning_once": 1011, "implemented": 1012, "ipex_ops": 1013, "returning": 1014, "copy_blocks": 1015, "key_caches": 1016, "value_caches": 1017, "block_mapping": 1018, "swap_blocks": 1019, "beamsearchsequence": 1020, "keeps": 1021, "track": 1022, "log": 1023, "probability": 1024, "field": 1025, "filled": 1026, "about": 1027, "returned": 1028, "includes": 1029, "logprob": 1030, "lora_request": 1031, "lorarequest": 1032, "cum_logprob": 1033, "finish_reason": 1034, "stop_reason": 1035, "multi_modal_data": 1036, "multimodaldatadict": 1037, "mm_processor_kwargs": 1038, "beamsearchoutput": 1039, "best": 1040, "length": 1041, "width": 1042, "beamsearchinstance": 1043, "prompt_tokens": 1044, "kwargs": 1045, "beams": 1046, "completed": 1047, "get_beam_search_score": 1048, "cumulative_logprob": 1049, "calculate": 1050, "penalty": 1051, "huggingface": 1052, "transformers": 1053, "ccb92be23def445f2afdea94c31286f84b89eb5b": 1054, "beam_search": 1055, "l938": 1056, "create_sort_beams_key_function": 1057, "sort_beams_key": 1058, "_prev_minor_version_was": 1059, "version_str": 1060, "whether": 1061, "given": 1062, "matches": 1063, "previous": 1064, "example": 1065, "supplied": 1066, "hidden": 1067, "metrics": 1068, "anything": 1069, "tree": 1070, "__version_tuple__": 1071, "won": 1072, "right": 1073, "thing": 1074, "_prev_minor_version": 1075, "purpose": 1076, "work": 1077, "fine": 1078, "nanrepr": 1079, "nans": 1080, "ieee_754": 1081, "exp": 1082, "1s": 1083, "mantissa": 1084, "0s": 1085, "extd_range_max_min": 1086, "_floating_point_max_int": 1087, "52": 1088, "exponent": 1089, "represent": 1090, "double": 1091, "__str__": 1092, "max_mantissa": 1093, "nan_repr": 1094, "max_exponent": 1095, "adjust": 1096, "now": 1097, "assume": 1098, "where": 1099, "bits": 1100, "precedent": 1101, "biases": 1102, "float8_e4m3b11fnuz": 1103, "jax": 1104, "ml": 1105, "ml_dtypes": 1106, "premature": 1107, "over": 1108, "complication": 1109, "just": 1110, "assuming": 1111, "exponent_bias": 1112, "exponent_bias_double": 1113, "10": 1114, "max_exponent_double": 1115, "shift": 1116, "ieee": 1117, "bitwise": 1118, "them": 1119, "together": 1120, "_floating_point_max": 1121, "double_raw": 1122, "unpack": 1123, "pack": 1124, "_raw_max": 1125, "is_floating_point": 1126, "size_bits": 1127, "is_signed": 1128, "_raw_min": 1129, "floating": 1130, "point": 1131, "types": 1132, "signed": 1133, "sign_bit_double": 1134, "63": 1135, "max_raw": 1136, "min_raw": 1137, "int64_t": 1138, "scalartype": 1139, "passed": 1140, "pytorch": 1141, "custom": 1142, "ops": 1143, "layout": 1144, "kept": 1145, "sync": 1146, "from_id": 1147, "val": 1148, "offset": 1149, "or_and_advance": 1150, "member": 1151, "bit_width": 1152, "bit_mask": 1153, "32": 1154, "_finite_values_only": 1155, "too": 1156, "big": 1157, "fit": 1158, "int64": 1159, "_scalar_types_id_map": 1160, "representable": 1161, "scalar": 1162, "accounting": 1163, "sign": 1164, "bit": 1165, "consistency": 1166, "org": 1167, "generated": 1168, "is_integer": 1169, "has_bias": 1170, "has_infs": 1171, "infinity": 1172, "has_nans": 1173, "is_ieee_754": 1174, "follows": 1175, "754": 1176, "conventions": 1177, "naming": 1178, "generally": 1179, "leading": 1180, "_e": 1181, "exponent_bits": 1182, "mantissa_bits": 1183, "flags": 1184, "finite": 1185, "infinities": 1186, "encoding": 1187, "ret": 1188, "uint": 1189, "__len__": 1190, "int_": 1191, "cls": 1192, "noqa": 1193, "b018": 1194, "cached": 1195, "unsigned": 1196, "float_ieee754": 1197, "float_": 1198, "finite_values_only": 1199, "follow": 1200, "constructor": 1201, "scalar_type_id": 1202, "doesn": 1203, "scalar_types": 1204, "int4": 1205, "uint4": 1206, "int8": 1207, "uint8": 1208, "float8_e4m3fn": 1209, "float8_e5m2": 1210, "float8_e8m0fnu": 1211, "float16_e8m7": 1212, "float16_e5m10": 1213, "fp6": 1214, "usyd": 1215, "fsalab": 1216, "fp6_llm": 1217, "float6_e3m2f": 1218, "fp4": 1219, "www": 1220, "opencompute": 1221, "documents": 1222, "ocp": 1223, "microscaling": 1224, "formats": 1225, "mx": 1226, "v1": 1227, "final": 1228, "pdf": 1229, "float4_e2m1f": 1230, "gptq": 1231, "uint2b2": 1232, "uint3b4": 1233, "uint4b8": 1234, "uint8b128": 1235, "128": 1236, "colloquial": 1237, "names": 1238, "float16": 1239, "seq_lens": 1240, "max_seq_len": 1241, "paged_attention_rocm": 1242, "query_start_loc": 1243, "fp8_out_scale": 1244, "_rocm_c": 1245, "paged_attention": 1246, "mla_decode_kvcache_cpu": 1247, "kv_cache": 1248, "_c_cpu": 1249, "mla_decode_kvcache": 1250, "merge_attn_states": 1251, "prefix_output": 1252, "prefix_lse": 1253, "suffix_output": 1254, "suffix_lse": 1255, "output_lse": 1256, "convert_vertical_slash_indexes": 1257, "q_seqlens": 1258, "batch": 1259, "kv_seqlens": 1260, "vertical_indexes": 1261, "n_heads": 1262, "nnz_v": 1263, "slash_indexes": 1264, "nnz_s": 1265, "context_size": 1266, "block_size_m": 1267, "block_size_n": 1268, "nnz_slash": 1269, "nnz_vertical": 1270, "num_rows": 1271, "block_count": 1272, "zeros": 1273, "block_offset": 1274, "column_count": 1275, "column_index": 1276, "updated": 1277, "input_contiguous": 1278, "apply_repetition_penalties_torch": 1279, "logits": 1280, "prompt_mask": 1281, "output_mask": 1282, "repetition_penalties": 1283, "unsqueeze": 1284, "repeat": 1285, "apply": 1286, "op": 1287, "penalties": 1288, "positive": 1289, "divide": 1290, "multiply": 1291, "scaling": 1292, "apply_repetition_penalties_cuda": 1293, "apply_repetition_penalties_": 1294, "apply_repetition_penalties": 1295, "repetition": 1296, "place": 1297, "args": 1298, "shape": 1299, "num_seqs": 1300, "vocab_size": 1301, "boolean": 1302, "indicating": 1303, "appear": 1304, "is_cuda": 1305, "is_contiguous": 1306, "rms_norm_dynamic_per_token_quant": 1307, "quant_dtype": 1308, "scale_ub": 1309, "empty_like": 1310, "scales": 1311, "numel": 1312, "float32": 1313, "awq_dequantize": 1314, "qweight": 1315, "split_k_iters": 1316, "thx": 1317, "thy": 1318, "vllm_use_triton_awq": 1319, "model_executor": 1320, "layers": 1321, "quantization": 1322, "awq_triton": 1323, "awq_dequantize_triton": 1324, "awq_gemm": 1325, "qzeros": 1326, "awq_gemm_triton": 1327, "gptq_gemm": 1328, "b_q_weight": 1329, "b_gptq_qzeros": 1330, "b_gptq_scales": 1331, "b_g_idx": 1332, "use_exllama": 1333, "gptq_shuffle": 1334, "q_weight": 1335, "q_perm": 1336, "marlin_gemm": 1337, "b_scales": 1338, "workspace": 1339, "size_m": 1340, "size_n": 1341, "size_k": 1342, "gptq_marlin_24_gemm": 1343, "b_meta": 1344, "b_q_type": 1345, "cutlass_scaled_mm_supports_fp4": 1346, "cuda_device_capability": 1347, "cutlass_blockwise_scaled_grouped_mm": 1348, "scales_a": 1349, "scales_b": 1350, "problem_sizes": 1351, "expert_offsets": 1352, "cutlass_scaled_fp4_mm": 1353, "block_scale_a": 1354, "block_scale_b": 1355, "alpha": 1356, "out_dtype": 1357, "ndim": 1358, "cutlass_scaled_mm_supports_fp8": 1359, "cutlass_scaled_mm_supports_block_fp8": 1360, "cutlass_scaled_mm_azp": 1361, "scale_a": 1362, "scale_b": 1363, "azp_adj": 1364, "azp": 1365, "param": 1366, "case": 1367, "always": 1368, "channel": 1369, "massage": 1370, "2d": 1371, "target_shape": 1372, "view": 1373, "cutlass_sparse_scaled_mm_supported": 1374, "cutlass_group_gemm_supported": 1375, "cutlass_sparse_compress": 1376, "compresses": 1377, "sparse": 1378, "matrix": 1379, "cutlass": 1380, "operations": 1381, "takes": 1382, "dense": 1383, "two": 1384, "elements": 1385, "metadata": 1386, "compressed": 1387, "kernels": 1388, "containing": 1389, "a_nzs": 1390, "a_meta": 1391, "compression": 1392, "operation": 1393, "fails": 1394, "notes": 1395, "element": 1396, "encodes": 1397, "sparsity": 1398, "elemspermetaelem": 1399, "8b": 1400, "2b_per_nz": 1401, "cutlass_scaled_sparse_mm": 1402, "bt_nzs": 1403, "bt_meta": 1404, "performs": 1405, "scaled": 1406, "multiplication": 1407, "steps": 1408, "randn": 1409, "prune": 1410, "along": 1411, "dimension": 1412, "prune_to_2_4": 1413, "compress": 1414, "transposed": 1415, "perform": 1416, "applying": 1417, "factors": 1418, "shuffle_rows": 1419, "input_tensor": 1420, "dst2src_map": 1421, "shuffle": 1422, "expand": 1423, "according": 1424, "store": 1425, "output_tensor": 1426, "moe": 1427, "permute": 1428, "before": 1429, "performing": 1430, "grouped": 1431, "multiplications": 1432, "num_tokens_permuted": 1433, "get_cutlass_pplx_moe_mm_data": 1434, "problem_sizes1": 1435, "problem_sizes2": 1436, "expert_num_tokens": 1437, "num_local_experts": 1438, "padded_m": 1439, "prepare": 1440, "necessary": 1441, "based": 1442, "fused": 1443, "expert": 1444, "non_zero_expert_idxs": 1445, "consecutive": 1446, "indices": 1447, "experts": 1448, "counts": 1449, "uses": 1450, "compute": 1451, "mark": 1452, "begins": 1453, "computation": 1454, "mxnxk": 1455, "sizes": 1456, "mms": 1457, "cutlass_moe_mm": 1458, "out_tensors": 1459, "a_tensors": 1460, "b_tensors": 1461, "a_scales": 1462, "a_strides": 1463, "b_strides": 1464, "c_strides": 1465, "per_act_token": 1466, "per_out_ch": 1467, "single": 1468, "executes": 1469, "quantized": 1470, "ab": 1471, "computed": 1472, "strides": 1473, "cutlass_fp4_moe_mm": 1474, "alphas": 1475, "sf_offsets": 1476, "blockscaled": 1477, "gemm": 1478, "runs": 1479, "gemms": 1480, "combination": 1481, "problem": 1482, "during": 1483, "nvfp4": 1484, "fusedmoe": 1485, "forward": 1486, "a_ptrs": 1487, "b_ptrs": 1488, "weights": 1489, "a_": 1490, "blockscales": 1491, "e4m3": 1492, "precision": 1493, "sf_size": 1494, "sf_offset": 1495, "cutlass_fp4_group_mm": 1496, "gptq_marlin_repack": 1497, "perm": 1498, "num_bits": 1499, "awq_marlin_repack": 1500, "gptq_marlin_moe_repack": 1501, "num_experts": 1502, "awq_marlin_moe_repack": 1503, "gptq_marlin_gemm": 1504, "b_bias": 1505, "global_scale": 1506, "b_zeros": 1507, "g_idx": 1508, "is_k_full": 1509, "use_atomic_add": 1510, "use_fp32_reduce": 1511, "is_zp_float": 1512, "machete_supported_schedules": 1513, "a_type": 1514, "b_type": 1515, "group_scales_type": 1516, "group_zeros_type": 1517, "channel_scales_type": 1518, "token_scales_type": 1519, "out_type": 1520, "machete_mm": 1521, "b_q": 1522, "machete_prepack_b": 1523, "b_group_scales": 1524, "b_group_zeros": 1525, "b_group_size": 1526, "b_channel_scales": 1527, "a_token_scales": 1528, "schedule": 1529, "permute_cols": 1530, "allspark_repack_weight": 1531, "zero_point": 1532, "has_zp": 1533, "rearrange": 1534, "asymmetric": 1535, "n32k16": 1536, "ampere": 1537, "w8a16": 1538, "fp16": 1539, "bf16": 1540, "provided": 1541, "symmetric": 1542, "rearranged": 1543, "optionally": 1544, "n_32align": 1545, "qweight_reorder": 1546, "scale_reorder": 1547, "zero_point_reorder": 1548, "rearrange_kn_weight_as_n32k16_order": 1549, "allspark_w8a16_gemm": 1550, "b_qweight": 1551, "b_qzeros": 1552, "group_size": 1553, "sm_count": 1554, "sm_version": 1555, "cublas_m_threshold": 1556, "n32k16_reorder": 1557, "scaled_int8_quant": 1558, "quantize": 1559, "factor": 1560, "invoke": 1561, "dynamic": 1562, "ignored": 1563, "static": 1564, "static_scaled_int8_quant": 1565, "input_scales": 1566, "input_azp": 1567, "dynamic_scaled_int8_quant": 1568, "marlin_qqq_gemm": 1569, "s_tok": 1570, "s_ch": 1571, "s_group": 1572, "ggml_dequantize": 1573, "quant_type": 1574, "ggml_mul_mat_vec_a8": 1575, "row": 1576, "ggml_mul_mat_a8": 1577, "ggml_moe_a8": 1578, "sorted_token_ids": 1579, "expert_ids": 1580, "num_tokens_post_padded": 1581, "ggml_moe_a8_vec": 1582, "topk_ids": 1583, "symint": 1584, "ggml_moe_get_block_size": 1585, "selective_scan_fwd": 1586, "d_": 1587, "z_": 1588, "delta_bias_": 1589, "delta_softplus": 1590, "cache_indices": 1591, "has_initial_state": 1592, "ssm_states": 1593, "pad_slot_id": 1594, "llmm1": 1595, "rows_per_block": 1596, "wvsplitk": 1597, "cu_count": 1598, "wvsplitkq": 1599, "moe_sum": 1600, "moe_align_block_size": 1601, "experts_ids": 1602, "num_tokens_post_pad": 1603, "moe_wna16_gemm": 1604, "topk_weights": 1605, "block_size_k": 1606, "current_platform": 1607, "notimplementederror": 1608, "optimized": 1609, "platforms": 1610, "topk_softmax": 1611, "token_expert_indices": 1612, "gating_output": 1613, "moe_wna16_marlin_gemm": 1614, "num_tokens_past_padded": 1615, "moe_block_size": 1616, "mul_topk_weights": 1617, "is_ep": 1618, "_c_cache_ops": 1619, "concat_and_cache_mla": 1620, "kv_c": 1621, "k_pe": 1622, "copy_blocks_mla": 1623, "kv_caches": 1624, "convert_fp8": 1625, "kv_dtype": 1626, "gather_cache": 1627, "src_cache": 1628, "cu_seq_lens": 1629, "seq_starts": 1630, "get_device_attribute": 1631, "_c_cuda_utils": 1632, "get_max_shared_memory_per_block_device_attribute": 1633, "ruff": 1634, "e501": 1635, "init_custom_ar": 1636, "ipc_tensors": 1637, "rank_data": 1638, "rank": 1639, "fully_connected": 1640, "_c_custom_ar": 1641, "all_reduce": 1642, "fa": 1643, "inp": 1644, "reg_buffer": 1645, "reg_buffer_sz_bytes": 1646, "dispose": 1647, "meta_size": 1648, "register_buffer": 1649, "get_graph_buffer_ipc_meta": 1650, "register_graph_buffers": 1651, "handles": 1652, "offsets": 1653, "allocate_shared_buffer_and_handle": 1654, "open_mem_handle": 1655, "mem_handle": 1656, "free_shared_buffer": 1657, "ptr": 1658, "init_custom_qr": 1659, "world_size": 1660, "qr_max_size": 1661, "qr_destroy": 1662, "qr_all_reduce": 1663, "quant_level": 1664, "cast_bf2half": 1665, "qr_get_handle": 1666, "qr_open_handles": 1667, "get_flash_mla_metadata": 1668, "num_heads_per_head_k": 1669, "num_heads_k": 1670, "arguments": 1671, "equals": 1672, "seq_len_q": 1673, "tile_scheduler_metadata": 1674, "num_sm_parts": 1675, "tileschedulermetadatasize": 1676, "flash_mla_with_kvcache": 1677, "k_cache": 1678, "head_dim_v": 1679, "head_dim": 1680, "num_blocks": 1681, "page_block_size": 1682, "max_num_blocks_per_seq": 1683, "get_mla_metadata": 1684, "qk": 1685, "sqrt": 1686, "attention": 1687, "mask": 1688, "softmax_lse": 1689, "flash_mla_fwd_kvcache": 1690, "cutlass_mla_decode": 1691, "q_nope": 1692, "q_pe": 1693, "kv_c_and_k_pe_cache": 1694, "page_table": 1695, "sm100_cutlass_mla_decode": 1696, "num_kv_splits": 1697, "sm100_cutlass_mla_get_workspace_size": 1698, "num_batches": 1699, "_print_debug_once": 1700, "hashable": 1701, "stacklevel": 1702, "caller": 1703, "_print_info_once": 1704, "_print_warning_once": 1705, "_vllmlogger": 1706, "provide": 1707, "information": 1708, "methods": 1709, "directly": 1710, "logging": 1711, "conflicting": 1712, "intel_extension_for_pytorch": 1713, "utils": 1714, "_logger": 1715, "debug_once": 1716, "message": 1717, "silently": 1718, "dropped": 1719, "info_once": 1720, "_configure_vllm_root_logger": 1721, "logging_config": 1722, "vllm_configure_logging": 1723, "vllm_logging_config_path": 1724, "evaluated": 1725, "implies": 1726, "unset": 1727, "default_logging_config": 1728, "load": 1729, "custom_config": 1730, "invalid": 1731, "expected": 1732, "formatter": 1733, "formatters": 1734, "provides": 1735, "backwards": 1736, "after": 1737, "10134": 1738, "newlineformatter": 1739, "logging_utils": 1740, "dictconfig": 1741, "init_logger": 1742, "loggers": 1743, "retrieved": 1744, "way": 1745, "been": 1746, "getlogger": 1747, "method_name": 1748, "_methods_to_patch": 1749, "methodtype": 1750, "cast": 1751, "_trace_calls": 1752, "log_path": 1753, "frame": 1754, "event": 1755, "code": 1756, "f_code": 1757, "co_filename": 1758, "lineno": 1759, "f_lineno": 1760, "func_name": 1761, "co_name": 1762, "functions": 1763, "last_frame": 1764, "f_back": 1765, "last_filename": 1766, "last_lineno": 1767, "last_func_name": 1768, "initial": 1769, "ts": 1770, "datetime": 1771, "strftime": 1772, "write": 1773, "nameerror": 1774, "deleted": 1775, "shutdown": 1776, "partial": 1777, "enable_trace_function_call": 1778, "log_file_path": 1779, "tracing": 1780, "under": 1781, "useful": 1782, "debugging": 1783, "hangs": 1784, "crashes": 1785, "thread": 1786, "calling": 1787, "enabled": 1788, "affected": 1789, "vllm_trace_function": 1790, "record": 1791, "slow": 1792, "down": 1793, "suggested": 1794, "hang": 1795, "saved": 1796, "__file__": 1797, "settrace": 1798, "reuse_client": 1799, "_sync_client": 1800, "requests": 1801, "session": 1802, "_async_client": 1803, "aiohttp": 1804, "clientsession": 1805, "get_sync_client": 1806, "async": 1807, "get_async_client": 1808, "trust_env": 1809, "_validate_http_url": 1810, "parsed_url": 1811, "http": 1812, "_headers": 1813, "extras": 1814, "mutablemapping": 1815, "agent": 1816, "vllm_version": 1817, "get_response": 1818, "stream": 1819, "timeout": 1820, "extra_headers": 1821, "mapping": 1822, "client": 1823, "headers": 1824, "get_async_response": 1825, "await": 1826, "get_bytes": 1827, "bytes": 1828, "raise_for_status": 1829, "async_get_bytes": 1830, "get_text": 1831, "async_get_text": 1832, "get_json": 1833, "async_get_json": 1834, "download_file": 1835, "save_path": 1836, "chunk_size": 1837, "iter_content": 1838, "async_download_file": 1839, "iter_chunked": 1840, "batchdescriptor": 1841, "namedtuple": 1842, "descriptor": 1843, "cudagraph": 1844, "dispatching": 1845, "minimal": 1846, "possible": 1847, "properly": 1848, "uniquely": 1849, "describe": 1850, "padded": 1851, "num_tokens": 1852, "uniform_decode": 1853, "also": 1854, "uniform": 1855, "dispatch": 1856, "supporting": 1857, "batches": 1858, "property": 1859, "non_uniform": 1860, "_compute_chunked_local_num_tokens": 1861, "num_tokens_across_dp_cpu": 1862, "max_num_tokens": 1863, "chunk_idx": 1864, "dp_size": 1865, "local_size": 1866, "dp_tokens": 1867, "lockstep": 1868, "even": 1869, "num_tokens_across_dp": 1870, "dp_rank": 1871, "gather": 1872, "across": 1873, "dp": 1874, "ranks": 1875, "num_tokens_tensor": 1876, "distributed": 1877, "parallel_state": 1878, "get_dp_group": 1879, "dist": 1880, "cpu_group": 1881, "parallel_config": 1882, "parallelconfig": 1883, "attn_metadata": 1884, "dpmetadata": 1885, "data_parallel_size": 1886, "data_parallel_rank": 1887, "num_prefill_tokens": 1888, "v0": 1889, "backends": 1890, "batchsize": 1891, "num_decode_tokens": 1892, "max_tokens_across_dp_cpu": 1893, "cu_tokens_across_dp_cpu": 1894, "chunked_sizes": 1895, "max_chunk_size_per_rank": 1896, "manager": 1897, "temporarily": 1898, "specific": 1899, "chunked": 1900, "execution": 1901, "processes": 1902, "designated": 1903, "portion": 1904, "others": 1905, "uneven": 1906, "break": 1907, "up": 1908, "total": 1909, "most": 1910, "sets": 1911, "local_sizes": 1912, "process": 1913, "derive": 1914, "determine": 1915, "wise": 1916, "inside": 1917, "allowed": 1918, "cu_sizes": 1919, "item": 1920, "yield": 1921, "get_chunk_sizes_across_dp_rank": 1922, "forwardcontext": 1923, "vllm_config": 1924, "compilation_config": 1925, "static_forward_context": 1926, "no_compile_layers": 1927, "attentionmetadata": 1928, "map": 1929, "layer_name": 1930, "layer": 1931, "dynamically": 1932, "making": 1933, "virtual_engines": 1934, "share": 1935, "virtual_engine": 1936, "dp_metadata": 1937, "style": 1938, "full": 1939, "piecewise": 1940, "cudagraph_runtime_mode": 1941, "cudagraphmode": 1942, "batch_descriptor": 1943, "mode": 1944, "get_forward_context": 1945, "_forward_context": 1946, "set_forward_context": 1947, "completionoutput": 1948, "completion": 1949, "token_ids": 1950, "ids": 1951, "probabilities": 1952, "top": 1953, "position": 1954, "requested": 1955, "reason": 1956, "why": 1957, "including": 1958, "encountering": 1959, "lora": 1960, "generate": 1961, "genericsequence": 1962, "samplelogprobs": 1963, "poolingoutput": 1964, "extracted": 1965, "states": 1966, "__eq__": 1967, "__class__": 1968, "request_id": 1969, "promptlogprobs": 1970, "outputs": 1971, "requestmetrics": 1972, "encoder_prompt": 1973, "encoder_prompt_token_ids": 1974, "num_cached_tokens": 1975, "multi_modal_placeholders": 1976, "multimodalplaceholderdict": 1977, "kv_transfer_params": 1978, "still": 1979, "older": 1980, "without": 1981, "breaking": 1982, "ignoring": 1983, "extra": 1984, "next_output": 1985, "aggregate": 1986, "next_completion": 1987, "enumerate": 1988, "mutablesequence": 1989, "extend": 1990, "from_seq_group": 1991, "seq_group": 1992, "sequencegroup": 1993, "use_cache": 1994, "seq_id_to_seq_group": 1995, "sequencegroupbase": 1996, "is_finished": 1997, "assembled_seq_group": 1998, "maybe_assemble_group": 1999, "finish_seq": 2000, "clear": 2001, "seq": 2002, "to_be_finished": 2003, "sub_request_id": 2004, "seq_id_to_index": 2005, "del": 2006, "completionrequest": 2007, "init": 2008, "needed": 2009, "cached_request_output": 2010, "top_n_seqs": 2011, "get_seqs": 2012, "omit": 2013, "because": 2014, "sampled": 2015, "include_logprobs": 2016, "text_buffer_length": 2017, "include_prompt": 2018, "output_text": 2019, "get_output_text_to_return": 2020, "output_token_ids": 2021, "get_output_token_ids_to_return": 2022, "num_output_tokens": 2023, "get_num_cached_tokens": 2024, "output_logprobs": 2025, "slice": 2026, "applicable": 2027, "finishes": 2028, "get_output_len": 2029, "cached_outputs": 2030, "get_cumulative_logprob": 2031, "sequencestatus": 2032, "get_finished_reason": 2033, "finished_time": 2034, "time": 2035, "set_finished_time": 2036, "init_kwargs": 2037, "request_output": 2038, "poolingrequestoutput": 2039, "generic": 2040, "_o": 2041, "unique": 2042, "identifier": 2043, "flag": 2044, "staticmethod": 2045, "pooled_data": 2046, "requestoutputfactory": 2047, "embeddingoutput": 2048, "embedding": 2049, "vector": 2050, "floats": 2051, "depends": 2052, "from_base": 2053, "pooling_output": 2054, "tolist": 2055, "hidden_size": 2056, "embeddingrequestoutput": 2057, "classificationoutput": 2058, "classification": 2059, "probs": 2060, "classes": 2061, "num_classes": 2062, "classificationrequestoutput": 2063, "scoringoutput": 2064, "scoring": 2065, "similarity": 2066, "squeeze": 2067, "scoringrequestoutput": 2068, "stderr": 2069, "popen": 2070, "pipe": 2071, "raw_output": 2072, "raw_err": 2073, "communicate": 2074, "rc": 2075, "get_platform": 2076, "win32": 2077, "enc": 2078, "oem": 2079, "locale": 2080, "getpreferredencoding": 2081, "topo": 2082, "whitespace": 2083, "meaningful": 2084, "rstrip": 2085, "filenotfounderror": 2086, "cmd_str": 2087, "127": 2088, "found": 2089, "run_and_read_all": 2090, "run_lambda": 2091, "reads": 2092, "run_and_parse_first_match": 2093, "run_and_return_first_line": 2094, "get_conda_packages": 2095, "patterns": 2096, "default_conda_patterns": 2097, "conda": 2098, "conda_exe": 2099, "splitlines": 2100, "get_gcc_version": 2101, "gcc": 2102, "get_clang_version": 2103, "clang": 2104, "get_cmake_version": 2105, "get_nvidia_driver_version": 2106, "darwin": 2107, "cmd": 2108, "kextstat": 2109, "grep": 2110, "get_nvidia_smi": 2111, "get_gpu_info": 2112, "torch_available": 2113, "is_available": 2114, "prop": 2115, "get_device_properties": 2116, "gcnarchname": 2117, "gcnarch": 2118, "nogcnarchnameonoldpytorch": 2119, "get_device_name": 2120, "uuid_regex": 2121, "uuid": 2122, "anonymize": 2123, "gpus": 2124, "sub": 2125, "get_running_cuda_version": 2126, "get_cudnn_version": 2127, "libcudnn": 2128, "hard": 2129, "tell": 2130, "being": 2131, "system_root": 2132, "systemroot": 2133, "windows": 2134, "cuda_path": 2135, "where_cmd": 2136, "system32": 2137, "cudnn_cmd": 2138, "cudnn": 2139, "dll": 2140, "drivers": 2141, "usr": 2142, "installation": 2143, "guide": 2144, "mac": 2145, "deeplearning": 2146, "sdk": 2147, "installmac": 2148, "cudnn_library": 2149, "library": 2150, "installed": 2151, "elsewhere": 2152, "ls": 2153, "ldconfig": 2154, "rev": 2155, "cut": 2156, "f1": 2157, "permission": 2158, "realpath": 2159, "files_set": 2160, "eliminate": 2161, "symbolic": 2162, "links": 2163, "alphabetize": 2164, "order": 2165, "deterministic": 2166, "sorted": 2167, "probably": 2168, "linux": 2169, "program_files_root": 2170, "programfiles": 2171, "program": 2172, "legacy_path": 2173, "corporation": 2174, "nvsmi": 2175, "new_path": 2176, "smis": 2177, "candidate_smi": 2178, "hipcc": 2179, "get_neuron_sdk_version": 2180, "script": 2181, "changes": 2182, "git_sha": 2183, "date": 2184, "summarize_vllm_build_flags": 2185, "constant": 2186, "etc": 2187, "archs": 2188, "torch_cuda_arch_list": 2189, "neuron_cores": 2190, "get_gpu_topo": 2191, "showtopo": 2192, "get_cpu_info": 2193, "lscpu": 2194, "wmic": 2195, "manufacturer": 2196, "family": 2197, "architecture": 2198, "processortype": 2199, "deviceid": 2200, "currentclockspeed": 2201, "maxclockspeed": 2202, "l2cachesize": 2203, "l2cachespeed": 2204, "revision": 2205, "sysctl": 2206, "machdep": 2207, "brand_string": 2208, "cpu_info": 2209, "cygwin": 2210, "get_mac_version": 2211, "sw_vers": 2212, "productversion": 2213, "get_windows_version": 2214, "wmic_cmd": 2215, "wbem": 2216, "findstr_cmd": 2217, "findstr": 2218, "caption": 2219, "get_lsb_version": 2220, "lsb_release": 2221, "description": 2222, "check_release_file": 2223, "pretty_name": 2224, "get_os": 2225, "machine": 2226, "macos": 2227, "ubuntu": 2228, "debian": 2229, "desc": 2230, "reading": 2231, "get_python_platform": 2232, "get_libc_version": 2233, "libc_ver": 2234, "get_pip_packages": 2235, "pip": 2236, "numpy": 2237, "packages": 2238, "default_pip_patterns": 2239, "run_with_pip": 2240, "pip_spec": 2241, "find_spec": 2242, "pip_available": 2243, "importerror": 2244, "mpip": 2245, "freeze": 2246, "uv": 2247, "collect": 2248, "pip_version": 2249, "pip3": 2250, "get_cachingallocator_config": 2251, "ca_config": 2252, "pytorch_cuda_alloc_conf": 2253, "get_cuda_module_loading_config": 2254, "cuda_module_loading": 2255, "is_xnnpack_available": 2256, "xnnpack": 2257, "attr": 2258, "get_env_vars": 2259, "secret_terms": 2260, "secret": 2261, "access": 2262, "password": 2263, "report_prefix": 2264, "nccl": 2265, "cublas": 2266, "omp_": 2267, "mkl_": 2268, "term": 2269, "lower": 2270, "replace_nones": 2271, "dct": 2272, "replacement": 2273, "replace_bools": 2274, "yes": 2275, "prepend": 2276, "tag": 2277, "lines": 2278, "updated_lines": 2279, "replace_if_empty": 2280, "relevant": 2281, "maybe_start_on_next_line": 2282, "multiline": 2283, "get_pretty_env_info": 2284, "pretty_str": 2285, "get_env_info": 2286, "collecting": 2287, "_crash_handler": 2288, "minidump_dir": 2289, "default_minidump_dir": 2290, "dumps": 2291, "dump": 2292, "listdir": 2293, "getctime": 2294, "ctime": 2295, "creation_time": 2296, "fromtimestamp": 2297, "detected": 2298, "minidump": 2299, "created": 2300, "bug": 2301, "report": 2302, "array_full": 2303, "array": 2304, "equivalent": 2305, "vllm_token_id_array_type": 2306, "infos": 2307, "attributes": 2308, "chosen": 2309, "vocab": 2310, "decoded_token": 2311, "decoded": 2312, "waiting": 2313, "running": 2314, "swapped": 2315, "considered": 2316, "finished_stopped": 2317, "finished_length_capped": 2318, "finished_aborted": 2319, "finished_ignored": 2320, "abort": 2321, "whose": 2322, "lengths": 2323, "longer": 2324, "cap": 2325, "therefore": 2326, "sequencestage": 2327, "prefill": 2328, "associated": 2329, "arrival_time": 2330, "arrived": 2331, "first_scheduled_time": 2332, "scheduled": 2333, "first_token_time": 2334, "time_in_queue": 2335, "spent": 2336, "queue": 2337, "scheduler_time": 2338, "scheduler": 2339, "model_forward_time": 2340, "model_execute_time": 2341, "execute": 2342, "block": 2343, "workers": 2344, "gpu": 2345, "last_token_time": 2346, "sequencedatadelta": 2347, "array_like": 2348, "sequencedata": 2349, "send": 2350, "step": 2351, "appended": 2352, "new_output_token_ids": 2353, "overwriting": 2354, "new_cumulative_logprob": 2355, "num_computed_tokens": 2356, "new_num_computed_tokens": 2357, "stage": 2358, "new_stage": 2359, "from_prompt_token_counts": 2360, "token_counts": 2361, "construct": 2362, "concatenating": 2363, "represents": 2364, "expressed": 2365, "form": 2366, "from_seqs": 2367, "prompt_token_ids_arr": 2368, "__iadd__": 2369, "prompt_embeds": 2370, "_prompt_embeds": 2371, "output_token_ids_arr": 2372, "_output_token_ids": 2373, "_prompt_token_ids": 2374, "typecode": 2375, "_prompt_token_ids_tuple": 2376, "_update_cached_all_tokens": 2377, "_update_cached_all_token_embeds": 2378, "_cached_all_token_ids": 2379, "_cached_all_token_embeds": 2380, "_output_embeds": 2381, "_cumulative_logprob": 2382, "new_prompt_token_ids": 2383, "prompt_token_ids_array": 2384, "long": 2385, "vs": 2386, "beware": 2387, "usage": 2388, "output_embeds": 2389, "new_output_token_embeds": 2390, "_output_token_embeds": 2391, "output_token_ids_array": 2392, "mrope_position_delta": 2393, "_mrope_position_delta": 2394, "new_mrope_position_delta": 2395, "append_token_id": 2396, "token_embed": 2397, "_new_appended_tokens": 2398, "detach": 2399, "get_len": 2400, "get_prompt_len": 2401, "get_token_ids": 2402, "get_token_embeddings": 2403, "get_prefix_token_ids": 2404, "prompt_length": 2405, "get_num_computed_tokens": 2406, "_num_computed_tokens": 2407, "update_num_computed_tokens": 2408, "num_new_computed_tokens": 2409, "phase": 2410, "get_num_uncomputed_tokens": 2411, "_stage": 2412, "hit": 2413, "_num_cached_tokens": 2414, "update_num_cached_tokens": 2415, "reset_state_for_recompute": 2416, "reset": 2417, "supposed": 2418, "called": 2419, "started": 2420, "again": 2421, "preempted": 2422, "prompt_len": 2423, "output_len": 2424, "instead": 2425, "recompute": 2426, "get_last_token_id": 2427, "get_prompt_token_ids": 2428, "get_output_token_ids": 2429, "get_delta_and_reset": 2430, "state": 2431, "apply_delta": 2432, "seq_id": 2433, "inputs": 2434, "singletoninputs": 2435, "embeds": 2436, "_last_output_token_ids_offset": 2437, "_last_output_text_offset": 2438, "incremental": 2439, "detokenization": 2440, "prefix_offset": 2441, "read_offset": 2442, "n_blocks": 2443, "token_type_ids": 2444, "multimodalkwargs": 2445, "multimodal": 2446, "mm_kwargs": 2447, "mm_placeholders": 2448, "lora_int_id": 2449, "buffer_length": 2450, "last": 2451, "truncate": 2452, "last_offset": 2453, "num_new_tokens": 2454, "what": 2455, "hash_of_block": 2456, "logical_idx": 2457, "produce": 2458, "incorrect": 2459, "hashing": 2460, "optimize": 2461, "future": 2462, "num_hashed_tokens_of_block": 2463, "hashed_tokens": 2464, "extra_hash": 2465, "computes": 2466, "specifically": 2467, "designed": 2468, "caching": 2469, "determined": 2470, "blocks": 2471, "additional": 2472, "influencing": 2473, "aside": 2474, "recomputation": 2475, "fork": 2476, "new_seq_id": 2477, "new_seq": 2478, "get_num_new_tokens": 2479, "remaining": 2480, "is_prefill": 2481, "sequencegroupstate": 2482, "mutable": 2483, "tied": 2484, "multi": 2485, "num_steps": 2486, "current_step": 2487, "remaining_steps": 2488, "seqs": 2489, "pooling_params": 2490, "encoder_seq": 2491, "trace_headers": 2492, "priority": 2493, "draft_size": 2494, "first_seq": 2495, "is_single_seq": 2496, "seqs_dict": 2497, "last_token_latency": 2498, "encoder": 2499, "distinct": 2500, "decoder": 2501, "set_last_token_time": 2502, "timings": 2503, "assertion": 2504, "get_last_token_latency": 2505, "latency": 2506, "maybe_set_first_token_time": 2507, "sequence_group": 2508, "recomputed": 2509, "iterations": 2510, "counted": 2511, "tpot": 2512, "rather": 2513, "recalculating": 2514, "ttft": 2515, "pov": 2516, "simply": 2517, "delay": 2518, "maybe_set_first_scheduled_time": 2519, "get_max_num_running_seqs": 2520, "maximum": 2521, "lifetime": 2522, "num_finished_seqs": 2523, "is_encoder_decoder": 2524, "get_encoder_seq": 2525, "get_finished_seqs": 2526, "num_uncomputed_tokens": 2527, "uses_prompt_embeds": 2528, "sequencegroupmetadatadelta": 2529, "sequencegroupmetadata": 2530, "sending": 2531, "sends": 2532, "payload": 2533, "seq_data_delta": 2534, "is_prompt": 2535, "do_sample": 2536, "token_chunk_size": 2537, "computed_block_nums": 2538, "default_factory": 2539, "seq_data": 2540, "next": 2541, "iter": 2542, "is_single_step_prompt": 2543, "indicates": 2544, "finish": 2545, "execute_model": 2546, "get_first_seq_id": 2547, "efficient": 2548, "fetching": 2549, "know": 2550, "sequence_group_metadata_delta": 2551, "finish_step": 2552, "sequenceoutput": 2553, "parent_seq_id": 2554, "forking": 2555, "output_token": 2556, "logp": 2557, "x_i": 2558, "x_0": 2559, "output_embed": 2560, "output_embed_shape": 2561, "log_probs_equal": 2562, "sequencegroupoutput": 2563, "abc": 2564, "abstractmethod": 2565, "completionsequencegroupoutput": 2566, "__metaclass__": 2567, "samples": 2568, "step_index": 2569, "poolingsequencegroupoutput": 2570, "actual": 2571, "get_data_nbytes": 2572, 