{"data": 0, "raw": 1, "vllm": 2, "10": 3, "setup": 4, "py": 5, "def": 6, "load_module_from_path": 7, "module_name": 8, "path": 9, "spec": 10, "importlib": 11, "util": 12, "spec_from_file_location": 13, "module": 14, "module_from_spec": 15, "sys": 16, "modules": 17, "loader": 18, "exec_module": 19, "return": 20, "is_sccache_available": 21, "bool": 22, "which": 23, "sccache": 24, "none": 25, "int": 26, "os": 27, "getenv": 28, "vllm_disable_sccache": 29, "is_ccache_available": 30, "ccache": 31, "is_ninja_available": 32, "ninja": 33, "is_url_available": 34, "url": 35, "str": 36, "from": 37, "urllib": 38, "request": 39, "import": 40, "urlopen": 41, "status": 42, "try": 43, "except": 44, "exception": 45, "false": 46, "200": 47, "class": 48, "cmakeextension": 49, "extension": 50, "__init__": 51, "self": 52, "name": 53, "cmake_lists_dir": 54, "kwa": 55, "super": 56, "sources": 57, "py_limited_api": 58, "true": 59, "abspath": 60, "compute_num_jobs": 61, "num_jobs": 62, "either": 63, "value": 64, "max_jobs": 65, "environment": 66, "variable": 67, "defined": 68, "number": 69, "cpus": 70, "available": 71, "envs": 72, "logger": 73, "info": 74, "using": 75, "jobs": 76, "else": 77, "sched_getaffinity": 78, "isn": 79, "universally": 80, "so": 81, "fall": 82, "back": 83, "cpu_count": 84, "we": 85, "get": 86, "error": 87, "here": 88, "len": 89, "attributeerror": 90, "nvcc_threads": 91, "_is_cuda": 92, "get_nvcc_cuda_version": 93, "version": 94, "11": 95, "when": 96, "set": 97, "reduce": 98, "avoid": 99, "overloading": 100, "system": 101, "nvcc": 102, "threads": 103, "max": 104, "configure": 105, "ext": 106, "ve": 107, "already": 108, "configured": 109, "cmakelists": 110, "txt": 111, "exit": 112, "early": 113, "cmake_build_ext": 114, "did_config": 115, "select": 116, "build": 117, "type": 118, "note": 119, "optimization": 120, "level": 121, "debug": 122, "default_cfg": 123, "relwithdebinfo": 124, "cfg": 125, "cmake_build_type": 126, "cmake_args": 127, "dcmake_build_type": 128, "format": 129, "dvllm_target_device": 130, "vllm_target_device": 131, "verbose": 132, "dcmake_verbose_makefile": 133, "dcmake_c_compiler_launcher": 134, "dcmake_cxx_compiler_launcher": 135, "dcmake_cuda_compiler_launcher": 136, "dcmake_hip_compiler_launcher": 137, "elif": 138, "pass": 139, "python": 140, "executable": 141, "cmake": 142, "can": 143, "find": 144, "exact": 145, "match": 146, "dvllm_python_executable": 147, "reuse": 148, "dependencies": 149, "subsequent": 150, "calls": 151, "dvllm_python_path": 152, "join": 153, "override": 154, "base": 155, "directory": 156, "fetchcontent": 157, "downloads": 158, "root": 159, "deps": 160, "allows": 161, "sharing": 162, "between": 163, "profiles": 164, "plays": 165, "more": 166, "nicely": 167, "fetchcontent_base_dir": 168, "fc_base_dir": 169, "root_dir": 170, "environ": 171, "dfetchcontent_base_dir": 172, "parallelism": 173, "tool": 174, "dnvcc_threads": 175, "build_tool": 176, "dcmake_job_pool_compile": 177, "string": 178, "compile": 179, "dcmake_job_pools": 180, "default": 181, "whatever": 182, "picks": 183, "make": 184, "sure": 185, "use": 186, "cuda_home": 187, "dcmake_cuda_compiler": 188, "bin": 189, "subprocess": 190, "check_call": 191, "cwd": 192, "build_temp": 193, "build_extensions": 194, "ensure": 195, "present": 196, "working": 197, "check_output": 198, "oserror": 199, "raise": 200, "runtimeerror": 201, "cannot": 202, "create": 203, "does": 204, "exist": 205, "exists": 206, "makedirs": 207, "targets": 208, "target_name": 209, "removeprefix": 210, "vllm_flash_attn": 211, "all": 212, "extensions": 213, "append": 214, "build_args": 215, "target": 216, "install": 217, "libraries": 218, "proper": 219, "location": 220, "outdir": 221, "get_ext_fullpath": 222, "parent": 223, "absolute": 224, "skip": 225, "same": 226, "continue": 227, "appends": 228, "prefix": 229, "contains": 230, "need": 231, "remove": 232, "range": 233, "count": 234, "should": 235, "actually": 236, "components": 237, "install_args": 238, "component": 239, "run": 240, "first": 241, "standard": 242, "build_ext": 243, "command": 244, "copy": 245, "build_lib": 246, "current": 247, "included": 248, "editable": 249, "glob": 250, "files": 251, "recursive": 252, "file": 253, "dst_file": 254, "split": 255, "print": 256, "copying": 257, "dirname": 258, "exist_ok": 259, "copy_file": 260, "precompiled_build_ext": 261, "disables": 262, "building": 263, "precompiled": 264, "binaries": 265, "assert": 266, "vllm_use_precompiled": 267, "only": 268, "supported": 269, "cuda": 270, "builds": 271, "skipping": 272, "extract_precompiled_and_patch_package": 273, "wheel_url_or_path": 274, "dict": 275, "tempfile": 276, "zipfile": 277, "temp_dir": 278, "isfile": 279, "wheel_filename": 280, "mkdtemp": 281, "wheels": 282, "wheel_path": 283, "downloading": 284, "wheel": 285, "urlretrieve": 286, "filename": 287, "existing": 288, "package_data_patch": 289, "files_to_copy": 290, "_c": 291, "abi3": 292, "_moe_c": 293, "_flashmla_c": 294, "_vllm_fa2_c": 295, "_vllm_fa3_c": 296, "cumem_allocator": 297, "compiled_regex": 298, "re": 299, "file_members": 300, "list": 301, "filter": 302, "lambda": 303, "filelist": 304, "extract": 305, "target_path": 306, "open": 307, "src": 308, "_path": 309, "wb": 310, "dst": 311, "shutil": 312, "copyfileobj": 313, "pkg": 314, "replace": 315, "setdefault": 316, "basename": 317, "finally": 318, "removing": 319, "temporary": 320, "rmtree": 321, "get_base_commit_in_main_branch": 322, "force": 323, "nightly": 324, "mainly": 325, "used": 326, "ci": 327, "testing": 328, "vllm_test_use_precompiled_nightly_wheel": 329, "latest": 330, "commit": 331, "hash": 332, "upstream": 333, "main": 334, "branch": 335, "resp_json": 336, "curl": 337, "https": 338, "api": 339, "github": 340, "com": 341, "repos": 342, "project": 343, "commits": 344, "decode": 345, "utf": 346, "upstream_main_commit": 347, "json": 348, "loads": 349, "sha": 350, "docker": 351, "context": 352, "git": 353, "may": 354, "immutable": 355, "missing": 356, "vllm_docker_build_context": 357, "check": 358, "local": 359, "repo": 360, "cat": 361, "calledprocesserror": 362, "fetch": 363, "remote": 364, "repository": 365, "update": 366, "any": 367, "branches": 368, "ensures": 369, "ref": 370, "its": 371, "history": 372, "our": 373, "current_branch": 374, "show": 375, "strip": 376, "base_commit": 377, "merge": 378, "valueerror": 379, "err": 380, "warning": 381, "failed": 382, "compatible": 383, "your": 384, "dev": 385, "_no_device": 386, "empty": 387, "has_cuda": 388, "torch": 389, "_is_neuron": 390, "_is_tpu": 391, "_is_hip": 392, "rocm": 393, "hip": 394, "neuron": 395, "tpu": 396, "_is_cpu": 397, "cpu": 398, "_is_xpu": 399, "xpu": 400, "_build_custom_ops": 401, "get_rocm_version": 402, "rocm_home": 403, "librocm": 404, "core": 405, "see": 406, "blob": 407, "d11f5c20d500f729c393680a01fa902ebf92094b": 408, "rocm_version": 409, "cpp": 410, "l21": 411, "librocm_core_file": 412, "lib": 413, "is_file": 414, "librocm_core": 415, "ctypes": 416, "cdll": 417, "vererrors": 418, "c_uint32": 419, "get_rocm_core_version": 420, "getrocmversion": 421, "restype": 422, "argtypes": 423, "pointer": 424, "major": 425, "minor": 426, "patch": 427, "byref": 428, "get_neuronxcc_version": 429, "sysconfig": 430, "site_dir": 431, "get_paths": 432, "purelib": 433, "version_file": 434, "neuronxcc": 435, "executed": 436, "successfully": 437, "fp": 438, "content": 439, "read": 440, "regular": 441, "expression": 442, "search": 443, "__version__": 444, "group": 445, "could": 446, "output": 447, "adapted": 448, "nvidia": 449, "apex": 450, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 451, "nvcc_output": 452, "universal_newlines": 453, "release_idx": 454, "index": 455, "release": 456, "nvcc_cuda_version": 457, "parse": 458, "get_gaudi_sw_version": 459, "returns": 460, "driver": 461, "enable": 462, "console": 463, "printing": 464, "hl": 465, "smi": 466, "shell": 467, "text": 468, "capture_output": 469, "env": 470, "enable_console": 471, "returncode": 472, "stdout": 473, "get_vllm_version": 474, "get_version": 475, "write_to": 476, "_version": 477, "sep": 478, "versions": 479, "might": 480, "contain": 481, "cuda_version": 482, "main_cuda_version": 483, "cuda_version_str": 484, "source": 485, "tarball": 486, "required": 487, "pypi": 488, "sdist": 489, "argv": 490, "cu": 491, "neuron_version": 492, "neuron_version_str": 493, "unknown": 494, "runtime": 495, "get_requirements": 496, "package": 497, "requirements": 498, "requirements_dir": 499, "_read_requirements": 500, "resolved_requirements": 501, "line": 502, "startswith": 503, "common": 504, "cuda_major": 505, "cuda_minor": 506, "modified_requirements": 507, "req": 508, "flash": 509, "attn": 510, "12": 511, "built": 512, "other": 513, "unsupported": 514, "platform": 515, "please": 516, "find_cuda_init": 517, "fn": 518, "callable": 519, "object": 520, "helper": 521, "function": 522, "initialization": 523, "errors": 524, "initializes": 525, "prints": 526, "stack": 527, "trace": 528, "how": 529, "happens": 530, "_lazy_init": 531, "wrapper": 532, "nonlocal": 533, "traceback": 534, "extract_stack": 535, "initialized": 536, "format_list": 537, "scripts": 538, "deprecated": 539, "entrypoints": 540, "cli": 541, "instead": 542, "vllm_main": 543, "scalar_type": 544, "nanrepr": 545, "enum": 546, "nans": 547, "ieee_754": 548, "exp": 549, "1s": 550, "mantissa": 551, "0s": 552, "extd_range_max_min": 553, "_floating_point_max_int": 554, "52": 555, "exponent": 556, "represent": 557, "min": 558, "double": 559, "__str__": 560, "max_mantissa": 561, "nan_repr": 562, "max_exponent": 563, "adjust": 564, "now": 565, "assume": 566, "bias": 567, "where": 568, "bits": 569, "some": 570, "precedent": 571, "non": 572, "biases": 573, "example": 574, "float8_e4m3b11fnuz": 575, "jax": 576, "ml": 577, "ml_dtypes": 578, "premature": 579, "over": 580, "complication": 581, "just": 582, "assuming": 583, "until": 584, "support": 585, "exponent_bias": 586, "exponent_bias_double": 587, "max_exponent_double": 588, "shift": 589, "positions": 590, "ieee": 591, "bitwise": 592, "them": 593, "together": 594, "_floating_point_max": 595, "float": 596, "double_raw": 597, "struct": 598, "unpack": 599, "pack": 600, "_raw_max": 601, "union": 602, "is_floating_point": 603, "size_bits": 604, "64": 605, "is_signed": 606, "_raw_min": 607, "currently": 608, "floating": 609, "point": 610, "types": 611, "signed": 612, "sign_bit_double": 613, "63": 614, "max_raw": 615, "min_raw": 616, "int64_t": 617, "id": 618, "convert": 619, "scalartype": 620, "passed": 621, "pytorch": 622, "custom": 623, "ops": 624, "layout": 625, "must": 626, "kept": 627, "sync": 628, "from_id": 629, "method": 630, "val": 631, "offset": 632, "or_and_advance": 633, "member": 634, "bit_width": 635, "bit_mask": 636, "32": 637, "_finite_values_only": 638, "fields": 639, "too": 640, "big": 641, "fit": 642, "int64": 643, "_scalar_types_id_map": 644, "representable": 645, "scalar": 646, "accounting": 647, "one": 648, "has": 649, "sign": 650, "bit": 651, "added": 652, "consistency": 653, "org": 654, "docs": 655, "stable": 656, "generated": 657, "tensor": 658, "html": 659, "is_integer": 660, "integer": 661, "has_bias": 662, "zero": 663, "has_infs": 664, "supports": 665, "infinity": 666, "has_nans": 667, "is_ieee_754": 668, "follows": 669, "754": 670, "conventions": 671, "naming": 672, "generally": 673, "leading": 674, "scheme": 675, "_e": 676, "exponent_bits": 677, "mantissa_bits": 678, "flags": 679, "means": 680, "finite": 681, "values": 682, "infinities": 683, "encoding": 684, "ret": 685, "uint": 686, "__repr__": 687, "__len__": 688, "typeerror": 689, "int_": 690, "cls": 691, "optional": 692, "includes": 693, "noqa": 694, "b018": 695, "cached": 696, "unsigned": 697, "float_ieee754": 698, "float_": 699, "finite_values_only": 700, "follow": 701, "constructor": 702, "scalar_type_id": 703, "doesn": 704, "scalar_types": 705, "int4": 706, "uint4": 707, "int8": 708, "uint8": 709, "float8_e4m3fn": 710, "float8_e5m2": 711, "float8_e8m0fnu": 712, "float16_e8m7": 713, "float16_e5m10": 714, "fp6": 715, "usyd": 716, "fsalab": 717, "fp6_llm": 718, "tree": 719, "float6_e3m2f": 720, "fp4": 721, "www": 722, "opencompute": 723, "documents": 724, "ocp": 725, "microscaling": 726, "formats": 727, "mx": 728, "v1": 729, "final": 730, "pdf": 731, "float4_e2m1f": 732, "gptq": 733, "uint2b2": 734, "uint3b4": 735, "uint4b8": 736, "uint8b128": 737, "128": 738, "colloquial": 739, "names": 740, "bfloat16": 741, "float16": 742, "_prev_minor_version_was": 743, "version_str": 744, "whether": 745, "given": 746, "matches": 747, "previous": 748, "supplied": 749, "hidden": 750, "metrics": 751, "anything": 752, "__version_tuple__": 753, "won": 754, "do": 755, "right": 756, "thing": 757, "isinstance": 758, "_prev_minor_version": 759, "purpose": 760, "work": 761, "fine": 762, "_ipex_ops": 763, "_reshape_activation_tensor": 764, "tuple": 765, "num": 766, "size": 767, "reshape": 768, "x1": 769, "x2": 770, "chunk": 771, "chunks": 772, "dim": 773, "silu_and_mul": 774, "out": 775, "ipex": 776, "llm": 777, "functional": 778, "gelu_and_mul": 779, "gelu_tanh_and_mul": 780, "gelu_fast": 781, "nn": 782, "gelu": 783, "gelu_new": 784, "gelu_quick": 785, "paged_attention_v1": 786, "query": 787, "key_cache": 788, "value_cache": 789, "num_kv_heads": 790, "scale": 791, "block_tables": 792, "context_lens": 793, "block_size": 794, "max_context_len": 795, "alibi_slopes": 796, "kv_cache_dtype": 797, "k_scale": 798, "v_scale": 799, "tp_rank": 800, "blocksparse_local_blocks": 801, "blocksparse_vert_stride": 802, "blocksparse_block_size": 803, "blocksparse_head_sliding_step": 804, "auto": 805, "num_heads": 806, "num_queries_per_tokens": 807, "pagedattention": 808, "single_query_kv_attention": 809, "contiguous": 810, "view_as": 811, "paged_attention_v2": 812, "exp_sum": 813, "max_logits": 814, "tmp_out": 815, "rotary_embedding": 816, "batch_size": 817, "seq_len": 818, "head_size": 819, "key": 820, "cos_sin_cache": 821, "cos_sin_dim": 822, "rot_dim": 823, "is_neox": 824, "rotary_embedding_batched": 825, "batched_rotary_embedding": 826, "cos_sin_cache_offsets": 827, "rms_norm": 828, "input": 829, "weight": 830, "epsilon": 831, "fused_add_rms_norm": 832, "residual": 833, "tmp": 834, "add_rms_norm": 835, "copy_": 836, "varlen_attention": 837, "seqlen_q": 838, "seqlen_k": 839, "max_seqlen_q": 840, "max_seqlen_k": 841, "pdropout": 842, "softmax_scale": 843, "zero_tensors": 844, "is_causal": 845, "return_softmax": 846, "gen_": 847, "generator": 848, "window_size_left": 849, "window_size_right": 850, "logits_soft_cap": 851, "endswith": 852, "reshape_and_cache": 853, "slot_mapping": 854, "reshape_and_cache_flash": 855, "k_scale_float": 856, "v_scale_float": 857, "todo": 858, "fp8": 859, "kv": 860, "cache": 861, "flash_attn_varlen_func": 862, "cu_seqlens_q": 863, "seqused_k": 864, "don": 865, "kernel": 866, "causal": 867, "block_table": 868, "window_size": 869, "softcap": 870, "cu_seqlens_k": 871, "following": 872, "parameters": 873, "keep": 874, "scheduler_metadata": 875, "fa_version": 876, "q_descale": 877, "k_descale": 878, "v_descale": 879, "num_splits": 880, "s_aux": 881, "cumsum": 882, "device": 883, "dtype": 884, "int32": 885, "real_window_size": 886, "get_scheduler_metadata": 887, "num_heads_q": 888, "num_heads_kv": 889, "headdim": 890, "cache_seqlens": 891, "qkv_dtype": 892, "headdim_v": 893, "cu_seqlens_k_new": 894, "cache_leftpad": 895, "page_size": 896, "max_seqlen_k_new": 897, "infinite": 898, "window": 899, "has_softcap": 900, "tuned": 901, "speed": 902, "pack_gqa": 903, "sm_margin": 904, "sms": 905, "communication": 906, "warning_once": 907, "implemented": 908, "ipex_ops": 909, "returning": 910, "copy_blocks": 911, "key_caches": 912, "value_caches": 913, "block_mapping": 914, "ignore": 915, "swap_blocks": 916, "_custom_ops": 917, "seq_lens": 918, "max_seq_len": 919, "paged_attention_rocm": 920, "query_start_loc": 921, "fp8_out_scale": 922, "_rocm_c": 923, "paged_attention": 924, "mla_decode_kvcache_cpu": 925, "kv_cache": 926, "_c_cpu": 927, "mla_decode_kvcache": 928, "merge_attn_states": 929, "prefix_output": 930, "prefix_lse": 931, "suffix_output": 932, "suffix_lse": 933, "output_lse": 934, "convert_vertical_slash_indexes": 935, "q_seqlens": 936, "batch": 937, "kv_seqlens": 938, "vertical_indexes": 939, "n_heads": 940, "nnz_v": 941, "slash_indexes": 942, "nnz_s": 943, "context_size": 944, "block_size_m": 945, "block_size_n": 946, "nnz_slash": 947, "nnz_vertical": 948, "num_rows": 949, "block_count": 950, "zeros": 951, "block_offset": 952, "column_count": 953, "column_index": 954, "convert_vertical_slash_indexes_mergehead": 955, "different": 956, "head": 957, "indices": 958, "vertical_indices_count": 959, "slash_indices_count": 960, "call": 961, "updated": 962, "input_contiguous": 963, "apply_repetition_penalties_torch": 964, "logits": 965, "prompt_mask": 966, "output_mask": 967, "repetition_penalties": 968, "unsqueeze": 969, "repeat": 970, "token": 971, "appears": 972, "prompt": 973, "apply": 974, "otherwise": 975, "op": 976, "penalties": 977, "positive": 978, "divide": 979, "penalty": 980, "multiply": 981, "scaling": 982, "apply_repetition_penalties_cuda": 983, "apply_repetition_penalties_": 984, "apply_repetition_penalties": 985, "repetition": 986, "place": 987, "args": 988, "shape": 989, "num_seqs": 990, "vocab_size": 991, "boolean": 992, "indicating": 993, "tokens": 994, "appear": 995, "is_cuda": 996, "is_contiguous": 997, "rms_norm_dynamic_per_token_quant": 998, "quant_dtype": 999, "scale_ub": 1000, "empty_like": 1001, "scales": 1002, "numel": 1003, "float32": 1004, "awq_dequantize": 1005, "qweight": 1006, "split_k_iters": 1007, "thx": 1008, "thy": 1009, "vllm_use_triton_awq": 1010, "model_executor": 1011, "layers": 1012, "quantization": 1013, "awq_triton": 1014, "awq_dequantize_triton": 1015, "awq_gemm": 1016, "qzeros": 1017, "awq_gemm_triton": 1018, "gptq_gemm": 1019, "b_q_weight": 1020, "b_gptq_qzeros": 1021, "b_gptq_scales": 1022, "b_g_idx": 1023, "use_exllama": 1024, "gptq_shuffle": 1025, "q_weight": 1026, "q_perm": 1027, "marlin_gemm": 1028, "b_scales": 1029, "workspace": 1030, "size_m": 1031, "size_n": 1032, "size_k": 1033, "gptq_marlin_24_gemm": 1034, "b_meta": 1035, "b_q_type": 1036, "cutlass_scaled_mm_supports_fp4": 1037, "cuda_device_capability": 1038, "cutlass_blockwise_scaled_grouped_mm": 1039, "scales_a": 1040, "scales_b": 1041, "problem_sizes": 1042, "expert_offsets": 1043, "cutlass_scaled_fp4_mm": 1044, "block_scale_a": 1045, "block_scale_b": 1046, "alpha": 1047, "out_dtype": 1048, "ndim": 1049, "cutlass_scaled_mm_supports_fp8": 1050, "cutlass_scaled_mm_supports_block_fp8": 1051, "cutlass_scaled_mm": 1052, "scale_a": 1053, "scale_b": 1054, "implements": 1055, "fused": 1056, "mm": 1057, "numpy": 1058, "style": 1059, "broadcasting": 1060, "order": 1061, "blockwise": 1062, "like": 1063, "found": 1064, "deepseek": 1065, "v3": 1066, "also": 1067, "extended": 1068, "broadcast": 1069, "rules": 1070, "extend": 1071, "rule": 1072, "extent": 1073, "dimension": 1074, "corresponding": 1075, "each": 1076, "element": 1077, "along": 1078, "src_shape": 1079, "target_shape": 1080, "times": 1081, "consecutively": 1082, "have": 1083, "would": 1084, "expand": 1085, "case": 1086, "massage": 1087, "2d": 1088, "view": 1089, "cutlass_compatible_b": 1090, "16": 1091, "current_platform": 1092, "is_rocm": 1093, "compressed_tensors": 1094, "triton_scaled_mm": 1095, "cutlass_scaled_mm_azp": 1096, "azp_adj": 1097, "azp": 1098, "param": 1099, "per": 1100, "include": 1101, "always": 1102, "channel": 1103, "cutlass_sparse_scaled_mm_supported": 1104, "cutlass_group_gemm_supported": 1105, "cutlass_sparse_compress": 1106, "compresses": 1107, "sparse": 1108, "matrix": 1109, "cutlass": 1110, "operations": 1111, "takes": 1112, "dense": 1113, "two": 1114, "elements": 1115, "metadata": 1116, "compressed": 1117, "representation": 1118, "kernels": 1119, "containing": 1120, "a_nzs": 1121, "a_meta": 1122, "raises": 1123, "compression": 1124, "operation": 1125, "fails": 1126, "notes": 1127, "encodes": 1128, "sparsity": 1129, "elemspermetaelem": 1130, "dimensions": 1131, "8b": 1132, "2b_per_nz": 1133, "cutlass_scaled_sparse_mm": 1134, "bt_nzs": 1135, "bt_meta": 1136, "performs": 1137, "scaled": 1138, "multiplication": 1139, "steps": 1140, "randn": 1141, "prune": 1142, "specified": 1143, "prune_to_2_4": 1144, "compress": 1145, "transposed": 1146, "perform": 1147, "applying": 1148, "factors": 1149, "result": 1150, "get_cutlass_moe_mm_data": 1151, "topk_ids": 1152, "problem_sizes1": 1153, "problem_sizes2": 1154, "input_permutation": 1155, "output_permutation": 1156, "num_experts": 1157, "blockscale_offsets": 1158, "prepare": 1159, "necessary": 1160, "grouped": 1161, "multiplications": 1162, "based": 1163, "moe": 1164, "expert": 1165, "mapping": 1166, "uses": 1167, "compute": 1168, "mark": 1169, "begins": 1170, "computation": 1171, "after": 1172, "sorted": 1173, "computed": 1174, "mxnxk": 1175, "sizes": 1176, "mms": 1177, "permutation": 1178, "shuffle": 1179, "before": 1180, "executing": 1181, "argument": 1182, "block": 1183, "rows": 1184, "shuffle_rows": 1185, "input_tensor": 1186, "dst2src_map": 1187, "according": 1188, "store": 1189, "output_tensor": 1190, "permute": 1191, "performing": 1192, "num_tokens_permuted": 1193, "get_cutlass_pplx_moe_mm_data": 1194, "expert_num_tokens": 1195, "num_local_experts": 1196, "padded_m": 1197, "non_zero_expert_idxs": 1198, "consecutive": 1199, "experts": 1200, "counts": 1201, "cutlass_moe_mm": 1202, "out_tensors": 1203, "a_tensors": 1204, "b_tensors": 1205, "a_scales": 1206, "a_strides": 1207, "b_strides": 1208, "c_strides": 1209, "per_act_token": 1210, "per_out_ch": 1211, "single": 1212, "executes": 1213, "quantized": 1214, "ab": 1215, "strides": 1216, "cutlass_fp4_moe_mm": 1217, "alphas": 1218, "sf_offsets": 1219, "blockscaled": 1220, "gemm": 1221, "runs": 1222, "gemms": 1223, "combination": 1224, "problem": 1225, "during": 1226, "nvfp4": 1227, "fusedmoe": 1228, "forward": 1229, "a_ptrs": 1230, "b_ptrs": 1231, "tensors": 1232, "weights": 1233, "a_": 1234, "blockscales": 1235, "e4m3": 1236, "precision": 1237, "sf_size": 1238, "sf_offset": 1239, "cutlass_fp4_group_mm": 1240, "gptq_marlin_repack": 1241, "perm": 1242, "num_bits": 1243, "awq_marlin_repack": 1244, "gptq_marlin_moe_repack": 1245, "awq_marlin_moe_repack": 1246, "gptq_marlin_gemm": 1247, "b_bias": 1248, "global_scale": 1249, "b_zeros": 1250, "g_idx": 1251, "is_k_full": 1252, "use_atomic_add": 1253, "use_fp32_reduce": 1254, "is_zp_float": 1255, "machete_supported_schedules": 1256, "a_type": 1257, "b_type": 1258, "group_scales_type": 1259, "group_zeros_type": 1260, "channel_scales_type": 1261, "token_scales_type": 1262, "out_type": 1263, "machete_mm": 1264, "b_q": 1265, "returned": 1266, "machete_prepack_b": 1267, "b_group_scales": 1268, "b_group_zeros": 1269, "b_group_size": 1270, "b_channel_scales": 1271, "a_token_scales": 1272, "schedule": 1273, "permute_cols": 1274, "scaled_fp4_quant": 1275, "input_global_scale": 1276, "quantize": 1277, "quantizes": 1278, "last": 1279, "every": 1280, "dynamically": 1281, "factor": 1282, "shared": 1283, "stored": 1284, "swizzled": 1285, "parallel": 1286, "thread": 1287, "execution": 1288, "tcgen05": 1289, "mma": 1290, "4x": 1291, "entire": 1292, "packed": 1293, "float8_e4m3": 1294, "sizzled": 1295, "needs": 1296, "got": 1297, "other_dims": 1298, "multiple": 1299, "fp16": 1300, "bf16": 1301, "rounded": 1302, "due": 1303, "requirement": 1304, "minimum": 1305, "tile": 1306, "128x4": 1307, "pad": 1308, "multiples": 1309, "round_up": 1310, "rounded_m": 1311, "scale_n": 1312, "rounded_n": 1313, "output_scale": 1314, "scaled_fp4_experts_quant": 1315, "topk": 1316, "inputs": 1317, "offsets": 1318, "blockscale": 1319, "outputs": 1320, "output_scales": 1321, "control": 1322, "maximum": 1323, "prevent": 1324, "running": 1325, "memory": 1326, "increased": 1327, "larger": 1328, "models": 1329, "max_tokens_per_expert": 1330, "vllm_max_tokens_per_expert_fp4_moe": 1331, "m_numtopk": 1332, "less": 1333, "than": 1334, "cutlass_moe_fp4": 1335, "observed": 1336, "scales_k": 1337, "padded_k": 1338, "rch": 1339, "scaled_fp8_quant": 1340, "num_token_padding": 1341, "use_per_token_if_dynamic": 1342, "both": 1343, "static": 1344, "dynamic": 1345, "you": 1346, "provide": 1347, "omit": 1348, "determined": 1349, "padding": 1350, "downstream": 1351, "benefit": 1352, "upper": 1353, "bound": 1354, "least": 1355, "per_tensor": 1356, "per_token": 1357, "code": 1358, "assumes": 1359, "batch_dim": 1360, "num_tokens": 1361, "flattened": 1362, "mi300": 1363, "float_e3m3fnuz": 1364, "fp8_dtype": 1365, "pe": 1366, "dynamic_per_token_scaled_fp8_quant": 1367, "dynamic_scaled_fp8_quant": 1368, "static_scaled_fp8_quant": 1369, "allspark_repack_weight": 1370, "zero_point": 1371, "has_zp": 1372, "rearrange": 1373, "asymmetric": 1374, "n32k16": 1375, "ampere": 1376, "w8a16": 1377, "original": 1378, "provided": 1379, "symmetric": 1380, "rearranged": 1381, "optionally": 1382, "n_32align": 1383, "qweight_reorder": 1384, "scale_reorder": 1385, "zero_point_reorder": 1386, "rearrange_kn_weight_as_n32k16_order": 1387, "allspark_w8a16_gemm": 1388, "b_qweight": 1389, "b_qzeros": 1390, "group_size": 1391, "sm_count": 1392, "sm_version": 1393, "cublas_m_threshold": 1394, "n32k16_reorder": 1395, "scaled_int8_quant": 1396, "maybe": 1397, "invoke": 1398, "ignored": 1399, "static_scaled_int8_quant": 1400, "input_scales": 1401, "input_azp": 1402, "dynamic_scaled_int8_quant": 1403, "marlin_qqq_gemm": 1404, "s_tok": 1405, "s_ch": 1406, "s_group": 1407, "ggml_dequantize": 1408, "quant_type": 1409, "ggml_mul_mat_vec_a8": 1410, "row": 1411, "ggml_mul_mat_a8": 1412, "ggml_moe_a8": 1413, "sorted_token_ids": 1414, "expert_ids": 1415, "num_tokens_post_padded": 1416, "top_k": 1417, "ggml_moe_a8_vec": 1418, "symint": 1419, "ggml_moe_get_block_size": 1420, "selective_scan_fwd": 1421, "delta": 1422, "d_": 1423, "z_": 1424, "delta_bias_": 1425, "delta_softplus": 1426, "cache_indices": 1427, "has_initial_state": 1428, "ssm_states": 1429, "pad_slot_id": 1430, "llmm1": 1431, "rows_per_block": 1432, "wvsplitk": 1433, "cu_count": 1434, "wvsplitkq": 1435, "moe_sum": 1436, "moe_align_block_size": 1437, "experts_ids": 1438, "num_tokens_post_pad": 1439, "moe_wna16_gemm": 1440, "topk_weights": 1441, "block_size_k": 1442, "notimplementederror": 1443, "optimized": 1444, "platforms": 1445, "topk_softmax": 1446, "token_expert_indices": 1447, "gating_output": 1448, "moe_wna16_marlin_gemm": 1449, "num_tokens_past_padded": 1450, "moe_block_size": 1451, "mul_topk_weights": 1452, "is_ep": 1453, "_c_cache_ops": 1454, "concat_and_cache_mla": 1455, "kv_c": 1456, "k_pe": 1457, "copy_blocks_mla": 1458, "kv_caches": 1459, "convert_fp8": 1460, "kv_dtype": 1461, "gather_cache": 1462, "src_cache": 1463, "cu_seq_lens": 1464, "seq_starts": 1465, "get_device_attribute": 1466, "attribute": 1467, "_c_cuda_utils": 1468, "get_max_shared_memory_per_block_device_attribute": 1469, "ruff": 1470, "e501": 1471, "init_custom_ar": 1472, "ipc_tensors": 1473, "rank_data": 1474, "rank": 1475, "fully_connected": 1476, "_c_custom_ar": 1477, "all_reduce": 1478, "fa": 1479, "inp": 1480, "reg_buffer": 1481, "reg_buffer_sz_bytes": 1482, "dispose": 1483, "meta_size": 1484, "register_buffer": 1485, "get_graph_buffer_ipc_meta": 1486, "register_graph_buffers": 1487, "handles": 1488, "allocate_shared_buffer_and_handle": 1489, "open_mem_handle": 1490, "mem_handle": 1491, "free_shared_buffer": 1492, "ptr": 1493, "init_custom_qr": 1494, "world_size": 1495, "qr_max_size": 1496, "qr_destroy": 1497, "qr_all_reduce": 1498, "quant_level": 1499, "cast_bf2half": 1500, "qr_get_handle": 1501, "qr_open_handles": 1502, "get_flash_mla_metadata": 1503, "num_heads_per_head_k": 1504, "num_heads_k": 1505, "arguments": 1506, "equals": 1507, "seq_len_q": 1508, "tile_scheduler_metadata": 1509, "num_sm_parts": 1510, "tileschedulermetadatasize": 1511, "flash_mla_with_kvcache": 1512, "k_cache": 1513, "head_dim_v": 1514, "head_dim": 1515, "num_blocks": 1516, "page_block_size": 1517, "max_num_blocks_per_seq": 1518, "get_mla_metadata": 1519, "qk": 1520, "softmax": 1521, "sqrt": 1522, "attention": 1523, "mask": 1524, "softmax_lse": 1525, "flash_mla_fwd_kvcache": 1526, "cutlass_mla_decode": 1527, "q_nope": 1528, "q_pe": 1529, "kv_c_and_k_pe_cache": 1530, "page_table": 1531, "sm100_cutlass_mla_decode": 1532, "num_kv_splits": 1533, "sm100_cutlass_mla_get_workspace_size": 1534, "num_batches": 1535, "logits_process": 1536, "get_bad_words_logits_processors": 1537, "bad_words": 1538, "tokenizer": 1539, "anytokenizer": 1540, "logitsprocessor": 1541, "bad_words_ids": 1542, "bad_word": 1543, "prohibit": 1544, "words": 1545, "beginning": 1546, "middle": 1547, "related": 1548, "add_prefix_space": 1549, "parameter": 1550, "lstrip": 1551, "prompt_token_ids": 1552, "encode": 1553, "add_special_tokens": 1554, "space": 1555, "produces": 1556, "new": 1557, "word": 1558, "nobadwordslogitsprocessor": 1559, "word_bias": 1560, "floattensor": 1561, "__call__": 1562, "past_tokens_ids": 1563, "_init_word_bias": 1564, "last_token_bias": 1565, "zeros_like": 1566, "bad_word_ids": 1567, "processed": 1568, "prefix_length": 1569, "last_token_id": 1570, "actual_prefix": 1571, "expected_prefix": 1572, "is_match": 1573, "_smallest_logit": 1574, "_neutral_logit": 1575, "sequencebiaslogitsprocessor": 1576, "huggingface": 1577, "transformers": 1578, "generation": 1579, "_check_token_ids_bounds": 1580, "bad_word_id": 1581, "invalid_token_ids": 1582, "token_id": 1583, "model": 1584, "vocabulary": 1585, "were": 1586, "bad": 1587, "integers": 1588, "satisfying": 1589, "collect_env": 1590, "stderr": 1591, "popen": 1592, "pipe": 1593, "raw_output": 1594, "raw_err": 1595, "communicate": 1596, "rc": 1597, "get_platform": 1598, "win32": 1599, "enc": 1600, "oem": 1601, "locale": 1602, "getpreferredencoding": 1603, "topo": 1604, "whitespace": 1605, "because": 1606, "meaningful": 1607, "rstrip": 1608, "filenotfounderror": 1609, "cmd_str": 1610, "127": 1611, "run_and_read_all": 1612, "run_lambda": 1613, "reads": 1614, "run_and_parse_first_match": 1615, "regex": 1616, "run_and_return_first_line": 1617, "get_conda_packages": 1618, "patterns": 1619, "default_conda_patterns": 1620, "conda": 1621, "conda_exe": 1622, "splitlines": 1623, "get_gcc_version": 1624, "gcc": 1625, "get_clang_version": 1626, "clang": 1627, "get_cmake_version": 1628, "get_nvidia_driver_version": 1629, "darwin": 1630, "cmd": 1631, "kextstat": 1632, "grep": 1633, "get_nvidia_smi": 1634, "get_gpu_info": 1635, "torch_available": 1636, "hasattr": 1637, "is_available": 1638, "prop": 1639, "get_device_properties": 1640, "gcnarchname": 1641, "gcnarch": 1642, "nogcnarchnameonoldpytorch": 1643, "get_device_name": 1644, "uuid_regex": 1645, "uuid": 1646, "anonymize": 1647, "gpus": 1648, "sub": 1649, "get_running_cuda_version": 1650, "get_cudnn_version": 1651, "libcudnn": 1652, "hard": 1653, "tell": 1654, "being": 1655, "system_root": 1656, "systemroot": 1657, "windows": 1658, "cuda_path": 1659, "where_cmd": 1660, "system32": 1661, "cudnn_cmd": 1662, "cudnn": 1663, "dll": 1664, "drivers": 1665, "usr": 1666, "installation": 1667, "guide": 1668, "mac": 1669, "deeplearning": 1670, "sdk": 1671, "installmac": 1672, "cudnn_library": 1673, "library": 1674, "installed": 1675, "elsewhere": 1676, "ls": 1677, "ldconfig": 1678, "rev": 1679, "cut": 1680, "f1": 1681, "permission": 1682, "realpath": 1683, "files_set": 1684, "eliminate": 1685, "symbolic": 1686, "links": 1687, "add": 1688, "alphabetize": 1689, "deterministic": 1690, "probably": 1691, "linux": 1692, "program_files_root": 1693, "programfiles": 1694, "program": 1695, "legacy_path": 1696, "corporation": 1697, "nvsmi": 1698, "new_path": 1699, "smis": 1700, "candidate_smi": 1701, "break": 1702, "hipcc": 1703, "get_neuron_sdk_version": 1704, "script": 1705, "changes": 1706, "git_sha": 1707, "date": 1708, "without": 1709, "summarize_vllm_build_flags": 1710, "constant": 1711, "variables": 1712, "etc": 1713, "archs": 1714, "torch_cuda_arch_list": 1715, "enabled": 1716, "disabled": 1717, "neuron_cores": 1718, "get_gpu_topo": 1719, "showtopo": 1720, "get_cpu_info": 1721, "lscpu": 1722, "wmic": 1723, "manufacturer": 1724, "family": 1725, "architecture": 1726, "processortype": 1727, "deviceid": 1728, "currentclockspeed": 1729, "maxclockspeed": 1730, "l2cachesize": 1731, "l2cachespeed": 1732, "revision": 1733, "sysctl": 1734, "machdep": 1735, "brand_string": 1736, "cpu_info": 1737, "cygwin": 1738, "get_mac_version": 1739, "sw_vers": 1740, "productversion": 1741, "get_windows_version": 1742, "wmic_cmd": 1743, "wbem": 1744, "findstr_cmd": 1745, "findstr": 1746, "caption": 1747, "get_lsb_version": 1748, "lsb_release": 1749, "description": 1750, "check_release_file": 1751, "pretty_name": 1752, "get_os": 1753, "machine": 1754, "macos": 1755, "ubuntu": 1756, "debian": 1757, "desc": 1758, "reading": 1759, "get_python_platform": 1760, "get_libc_version": 1761, "libc_ver": 1762, "get_pip_packages": 1763, "pip": 1764, "packages": 1765, "default_pip_patterns": 1766, "run_with_pip": 1767, "pip_spec": 1768, "find_spec": 1769, "pip_available": 1770, "importerror": 1771, "mpip": 1772, "freeze": 1773, "uv": 1774, "collect": 1775, "pip_version": 1776, "pip3": 1777, "get_cachingallocator_config": 1778, "ca_config": 1779, "pytorch_cuda_alloc_conf": 1780, "get_cuda_module_loading_config": 1781, "init": 1782, "config": 1783, "cuda_module_loading": 1784, "is_xnnpack_available": 1785, "backends": 1786, "xnnpack": 1787, "attr": 1788, "get_env_vars": 1789, "env_vars": 1790, "secret_terms": 1791, "secret": 1792, "access": 1793, "password": 1794, "report_prefix": 1795, "nccl": 1796, "cublas": 1797, "omp_": 1798, "mkl_": 1799, "items": 1800, "term": 1801, "lower": 1802, "environment_variables": 1803, "get_env_info": 1804, "pip_list_output": 1805, "debug_mode_str": 1806, "cuda_available_str": 1807, "hip_compiled_version": 1808, "hip_runtime_version": 1809, "miopen_runtime_version": 1810, "get_version_or_na": 1811, "_lst": 1812, "rsplit": 1813, "_show_config": 1814, "miopen": 1815, "sys_version": 1816, "conda_packages": 1817, "neuron_sdk_version": 1818, "vllm_version": 1819, "vllm_build_flags": 1820, "gpu_topo": 1821, "systemenv": 1822, "torch_version": 1823, "is_debug_build": 1824, "python_version": 1825, "maxsize": 1826, "bit_length": 1827, "python_platform": 1828, "is_cuda_available": 1829, "cuda_compiled_version": 1830, "cuda_runtime_version": 1831, "get_cud": 1832, "a_module_loading_config": 1833, "nvidia_gpu_models": 1834, "nvidia_driver_version": 1835, "cudnn_version": 1836, "pip_packages": 1837, "libc_version": 1838, "gcc_version": 1839, "clang_version": 1840, "cmake_version": 1841, "caching_allocator_config": 1842, "replace_nones": 1843, "dct": 1844, "replacement": 1845, "keys": 1846, "replace_bools": 1847, "yes": 1848, "prepend": 1849, "tag": 1850, "lines": 1851, "updated_lines": 1852, "replace_if_empty": 1853, "relevant": 1854, "maybe_start_on_next_line": 1855, "multiline": 1856, "get_pretty_env_info": 1857, "pretty_str": 1858, "collecting": 1859, "information": 1860, "utils": 1861, "_crash_handler": 1862, "minidump_dir": 1863, "default_minidump_dir": 1864, "dumps": 1865, "dump": 1866, "listdir": 1867, "getctime": 1868, "ctime": 1869, "creation_time": 1870, "datetime": 1871, "fromtimestamp": 1872, "strftime": 1873, "msg": 1874, "detected": 1875, "minidump": 1876, "created": 1877, "bug": 1878, "report": 1879, "get_default_cache_root": 1880, "xdg_cache_home": 1881, "expanduser": 1882, "get_default_config_root": 1883, "xdg_config_home": 1884, "maybe_convert_int": 1885, "maybe_convert_bool": 1886, "get_vllm_port": 1887, "port": 1888, "vllm_port": 1889, "uri": 1890, "suggest": 1891, "k8s": 1892, "service": 1893, "discovery": 1894, "issue": 1895, "urlparse": 1896, "parsed": 1897, "caused": 1898, "kubernetes": 1899, "ai": 1900, "en": 1901, "serving": 1902, "valid": 1903, "__getattr__": 1904, "lazy": 1905, "evaluation": 1906, "__name__": 1907, "__dir__": 1908, "is_set": 1909, "explicitly": 1910, "set_vllm_use_v1": 1911, "use_v1": 1912, "vllm_use_v1": 1913, "user": 1914, "compute_hash": 1915, "whenever": 1916, "affects": 1917, "graph": 1918, "vllm_pp_layer_partition": 1919, "generate": 1920, "graphs": 1921, "vars": 1922, "affect": 1923, "choice": 1924, "deftruth": 1925, "factorize": 1926, "environment_variables_to_hash": 1927, "vllm_mla_disable": 1928, "vllm_use_triton_flash_attn": 1929, "vllm_dp_rank": 1930, "vllm_dp_size": 1931, "vllm_use_standalone_compile": 1932, "vllm_fused_moe_chunk_size": 1933, "vllm_flashinfer_moe_backend": 1934, "vllm_v1_use_prefill_decode_attention": 1935, "vllm_use_aiter_unified_attention": 1936, "vllm_attention_backend": 1937, "vllm_use_flashinfer_sampler": 1938, "vllm_flashinfer_force_tensor_cores": 1939, "vllm_disabled_kernels": 1940, "vllm_use_deep_gemm": 1941, "vllm_use_trtllm_fp4_gemm": 1942, "vllm_use_flashinfer_moe_fp8": 1943, "vllm_use_flashinfer_moe_fp4": 1944, "vllm_use_flashinfer_moe_mxfp4_mxfp8": 1945, "vllm_use_flashinfer_moe_mxfp4_bf16": 1946, "vllm_use_cudnn_prefill": 1947, "vllm_use_trtllm_attention": 1948, "vllm_rocm_use_aiter": 1949, "vllm_rocm_use_aiter_paged_attn": 1950, "vllm_rocm_use_aiter_linear": 1951, "vllm_rocm_use_aiter_moe": 1952, "vllm_rocm_use_aiter_rmsnorm": 1953, "vllm_rocm_use_aiter_mla": 1954, "vllm_rocm_use_aiter_mha": 1955, "vllm_rocm_use_skinny_gemm": 1956, "vllm_rocm_fp8_padding": 1957, "vllm_rocm_moe_padding": 1958, "vllm_rocm_custom_paged_attn": 1959, "vllm_rocm_quick_reduce_quantization": 1960, "vllm_rocm_quick_reduce_cast_bf16_to_fp16": 1961, "vllm_rocm_quick_reduce_max_size_bytes_mb": 1962, "goes": 1963, "hash_str": 1964, "hashlib": 1965, "md5": 1966, "usedforsecurity": 1967, "hexdigest": 1968, "sampling_params": 1969, "samplingtype": 1970, "intenum": 1971, "greedy": 1972, "random": 1973, "random_seed": 1974, "from_optional": 1975, "basemodel": 1976, "grammar": 1977, "json_object": 1978, "backend": 1979, "whitespace_pattern": 1980, "structural_tag": 1981, "guideddecodingparams": 1982, "arg": 1983, "schemas": 1984, "pydantic": 1985, "model_json_schema": 1986, "__post_init__": 1987, "validate": 1988, "mutually": 1989, "exclusive": 1990, "guide_count": 1991, "sum": 1992, "kind": 1993, "guided": 1994, "decoding": 1995, "__dict__": 1996, "requestoutputkind": 1997, "far": 1998, "requestoutput": 1999, "cumulative": 2000, "deltas": 2001, "intermediate": 2002, "final_only": 2003, "best_of": 2004, "presence_penalty": 2005, "frequency_penalty": 2006, "repetition_penalty": 2007, "temperature": 2008, "top_p": 2009, "min_p": 2010, "seed": 2011, "stop": 2012, "stop_token_ids": 2013, "include_stop_str_in_output": 2014, "ignore_eos": 2015, "max_tokens": 2016, "min_tokens": 2017, "logprobs": 2018, "prompt_logprobs": 2019, "detokenize": 2020, "skip_special_tokens": 2021, "spaces_between_special_tokens": 2022, "logits_processors": 2023, "truncate_prompt_tokens": 2024, "annotated": 2025, "msgspec": 2026, "meta": 2027, "ge": 2028, "output_kind": 2029, "guided_decoding": 2030, "logit_bias": 2031, "allowed_token_ids": 2032, "extra_args": 2033, "samplingparams": 2034, "clamp": 2035, "100": 2036, "openai": 2037, "frequency": 2038, "_penalty": 2039, "deal": 2040, "_real_n": 2041, "results": 2042, "greater": 2043, "equal": 2044, "_max_temp": 2045, "cause": 2046, "numerical": 2047, "nan": 2048, "inf": 2049, "maxed": 2050, "characters": 2051, "hold": 2052, "sequence": 2053, "finished": 2054, "output_text_buffer_length": 2055, "_verify_args": 2056, "_sampling_eps": 2057, "sampling": 2058, "_verify_greedy_sampling": 2059, "eos_token_id": 2060, "engine": 2061, "_all_stop_token_ids": 2062, "negative": 2063, "quietly": 2064, "accept": 2065, "prefer": 2066, "disable": 2067, "st_id": 2068, "stop_str": 2069, "strings": 2070, "deto": 2071, "kenize": 2072, "update_from_generation_config": 2073, "generation_config": 2074, "model_eos_token_id": 2075, "eos": 2076, "processing": 2077, "eos_ids": 2078, "primary": 2079, "since": 2080, "handled": 2081, "separately": 2082, "stopping": 2083, "purposes": 2084, "discard": 2085, "update_from_tokenizer": 2086, "_bad_words_token_ids": 2087, "bad_words_token_ids": 2088, "max_token_id": 2089, "sampling_type": 2090, "all_stop_token_ids": 2091, "internal": 2092, "backward": 2093, "compatibility": 2094, "guaranteed": 2095, "clone": 2096, "deep": 2097, "objects": 2098, "arbitrary": 2099, "nontrivial": 2100, "amount": 2101, "expensive": 2102, "however": 2103, "copied": 2104, "processor": 2105, "sequences": 2106, "issues": 2107, "3087": 2108, "logit_processor_refs": 2109, "lp": 2110, "deepcopy": 2111, "memo": 2112, "beamsearchparams": 2113, "omit_defaults": 2114, "cached_property": 2115, "beam": 2116, "beam_width": 2117, "length_penalty": 2118, "beam_search": 2119, "beamsearchsequence": 2120, "keeps": 2121, "track": 2122, "log": 2123, "probability": 2124, "field": 2125, "filled": 2126, "about": 2127, "logprob": 2128, "lora_request": 2129, "lorarequest": 2130, "cum_logprob": 2131, "finish_reason": 2132, "stop_reason": 2133, "multi_modal_data": 2134, "multimodaldatadict": 2135, "mm_processor_kwargs": 2136, "beamsearchoutput": 2137, "best": 2138, "length": 2139, "width": 2140, "beamsearchinstance": 2141, "prompt_tokens": 2142, "kwargs": 2143, "beams": 2144, "completed": 2145, "get_beam_search_score": 2146, "cumulative_logprob": 2147, "calculate": 2148, "score": 2149, "ccb92be23def445f2afdea94c31286f84b89eb5b": 2150, "l938": 2151, "create_sort_beams_key_function": 2152, "sort_beams_key": 2153, "completionoutput": 2154, "completion": 2155, "token_ids": 2156, "ids": 2157, "probabilities": 2158, "top": 2159, "position": 2160, "requested": 2161, "reason": 2162, "why": 2163, "including": 2164, "encountering": 2165, "lora": 2166, "genericsequence": 2167, "samplelogprobs": 2168, "poolingoutput": 2169, "pooling": 2170, "extracted": 2171, "states": 2172, "__eq__": 2173, "__class__": 2174, "request_id": 2175, "promptlogprobs": 2176, "requestmetrics": 2177, "encoder_prompt": 2178, "encoder_prompt_token_ids": 2179, "num_cached_tokens": 2180, "multi_modal_placeholders": 2181, "multimodalplaceholderdict": 2182, "kv_transfer_params": 2183, "still": 2184, "older": 2185, "breaking": 2186, "ignoring": 2187, "extra": 2188, "next_output": 2189, "aggregate": 2190, "next_completion": 2191, "enumerate": 2192, "mutablesequence": 2193, "from_seq_group": 2194, "seq_group": 2195, "sequencegroup": 2196, "use_cache": 2197, "seq_id_to_seq_group": 2198, "sequencegroupbase": 2199, "is_finished": 2200, "assembled_seq_group": 2201, "maybe_assemble_group": 2202, "finish_seq": 2203, "clear": 2204, "seq": 2205, "to_be_finished": 2206, "sub_request_id": 2207, "seq_id_to_index": 2208, "del": 2209, "completionrequest": 2210, "needed": 2211, "cached_request_output": 2212, "top_n_seqs": 2213, "get_seqs": 2214, "sampled": 2215, "even": 2216, "include_logprobs": 2217, "text_buffer_length": 2218, "include_prompt": 2219, "output_text": 2220, "get_output_text_to_return": 2221, "output_token_ids": 2222, "get_output_token_ids_to_return": 2223, "num_output_tokens": 2224, "get_num_cached_tokens": 2225, "output_logprobs": 2226, "slice": 2227, "applicable": 2228, "finishes": 2229, "others": 2230, "get_output_len": 2231, "cached_outputs": 2232, "get_cumulative_logprob": 2233, "sequencestatus": 2234, "get_finished_reason": 2235, "finished_time": 2236, "time": 2237, "fin": 2238, "ished": 2239, "set_finished_time": 2240, "init_kwargs": 2241, "request_output": 2242, "poolingrequestoutput": 2243, "generic": 2244, "_o": 2245, "unique": 2246, "identifier": 2247, "flag": 2248, "staticmethod": 2249, "pooled_data": 2250, "requestoutputfactory": 2251, "embeddingoutput": 2252, "embedding": 2253, "vector": 2254, "floats": 2255, "depends": 2256, "from_base": 2257, "pooling_output": 2258, "tolist": 2259, "property": 2260, "hidden_size": 2261, "embeddingrequestoutput": 2262, "classificationoutput": 2263, "classification": 2264, "probs": 2265, "classes": 2266, "num_classes": 2267, "classificationrequestoutput": 2268, "scoringoutput": 2269, "scoring": 2270, "similarity": 2271, "classify": 2272, "task": 2273, "embed": 2274, "squeeze": 2275, "item": 2276, "scoringrequestoutput": 2277, "connections": 2278, "reuse_client": 2279, "_sync_client": 2280, "requests": 2281, "session": 2282, "_async_client": 2283, "aiohttp": 2284, "clientsession": 2285, "get_sync_client": 2286, "async": 2287, "get_async_client": 2288, "trust_env": 2289, "_validate_http_url": 2290, "parsed_url": 2291, "http": 2292, "invalid": 2293, "_headers": 2294, "extras": 2295, "mutablemapping": 2296, "agent": 2297, "get_response": 2298, "stream": 2299, "timeout": 2300, "extra_headers": 2301, "client": 2302, "headers": 2303, "get_async_response": 2304, "await": 2305, "get_bytes": 2306, "bytes": 2307, "raise_for_status": 2308, "async_get_bytes": 2309, "get_text": 2310, "async_get_text": 2311, "get_json": 2312, "async_get_json": 2313, "download_file": 2314, "save_path": 2315, "chunk_size": 2316, "iter_content": 2317, "write": 2318, "async_download_file": 2319, "iter_chunked": 2320, "_print_debug_once": 2321, "hashable": 2322, "stacklevel": 2323, "caller": 2324, "_print_info_once": 2325, "_print_warning_once": 2326, "_vllmlogger": 2327, "methods": 2328, "directly": 2329, "logging": 2330, "instance": 2331, "conflicting": 2332, "intel_extension_for_pytorch": 2333, "_logger": 2334, "debug_once": 2335, "message": 2336, "silently": 2337, "dropped": 2338, "info_once": 2339, "_configure_vllm_root_logger": 2340, "logging_config": 2341, "vllm_configure_logging": 2342, "vllm_logging_config_path": 2343, "evaluated": 2344, "implies": 2345, "unset": 2346, "default_logging_config": 2347, "load": 2348, "custom_config": 2349, "expected": 2350, "formatter": 2351, "formatters": 2352, "provides": 2353, "backwards": 2354, "10134": 2355, "newlineformatter": 2356, "logging_utils": 2357, "dictconfig": 2358, "init_logger": 2359, "loggers": 2360, "retrieved": 2361, "way": 2362, "been": 2363, "getlogger": 2364, "method_name": 2365, "_methods_to_patch": 2366, "setattr": 2367, "methodtype": 2368, "cast": 2369, "_trace_calls": 2370, "log_path": 2371, "frame": 2372, "event": 2373, "f_code": 2374, "co_filename": 2375, "lineno": 2376, "f_lineno": 2377, "func_name": 2378, "co_name": 2379, "functions": 2380, "last_frame": 2381, "f_back": 2382, "last_filename": 2383, "last_lineno": 2384, "last_func_name": 2385, "initial": 2386, "ts": 2387, "nameerror": 2388, "deleted": 2389, "shutdown": 2390, "partial": 2391, "enable_trace_function_call": 2392, "log_file_path": 2393, "tracing": 2394, "under": 2395, "useful": 2396, "debugging": 2397, "hangs": 2398, "crashes": 2399, "calling": 2400, "affected": 2401, "vllm_trace_function": 2402, "record": 2403, "slow": 2404, "down": 2405, "suggested": 2406, "hang": 2407, "saved": 2408, "__file__": 2409, "settrace": 2410, "forward_context": 2411, "batchdescriptor": 2412, "namedtuple": 2413, "descriptor": 2414, "cudagraph": 2415, "dispatching": 2416, "minimal": 2417, "possible": 2418, "properly": 2419, "uniquely": 2420, "describe": 2421, "padded": 2422, "uniform_decode": 2423, "uniform": 2424, "dispatch": 2425, "supporting": 2426, "batches": 2427, "non_uniform": 2428, "_compute_chunked_local_num_tokens": 2429, "num_tokens_across_dp_cpu": 2430, "max_num_tokens": 2431, "chunk_idx": 2432, "dp_size": 2433, "local_size": 2434, "dp_tokens": 2435, "lockstep": 2436, "done": 2437, "num_tokens_across_dp": 2438, "dp_rank": 2439, "gather": 2440, "across": 2441, "dp": 2442, "ranks": 2443, "num_tokens_tensor": 2444, "distributed": 2445, "parallel_state": 2446, "get_dp_group": 2447, "dist": 2448, "cpu_group": 2449, "parallel_config": 2450, "parallelconfig": 2451, "attn_metadata": 2452, "dpmetadata": 2453, "data_parallel_size": 2454, "data_parallel_rank": 2455, "num_prefill_tokens": 2456, "v0": 2457, "batchsize": 2458, "num_decode_tokens": 2459, "max_tokens_across_dp_cpu": 2460, "cu_tokens_across_dp_cpu": 2461, "chunked_sizes": 2462, "max_chunk_size_per_rank": 2463, "manager": 2464, "temporarily": 2465, "specific": 2466, "chunked": 2467, "processes": 2468, "designated": 2469, "portion": 2470, "uneven": 2471, "up": 2472, "total": 2473, "most": 2474, "sets": 2475, "local_sizes": 2476, "process": 2477, "derive": 2478, "determine": 2479, "wise": 2480, "inside": 2481, "allowed": 2482, "cu_sizes": 2483, "yield": 2484, "get_chunk_sizes_across_dp_rank": 2485, "forwardcontext": 2486, "vllm_config": 2487, "compilation_config": 2488, "static_forward_context": 2489, "no_compile_layers": 2490, "attentionmetadata": 2491, "map": 2492, "layer_name": 2493, "layer": 2494, "making": 2495, "virtual_engines": 2496, "share": 2497, "virtual_engine": 2498, "dp_metadata": 2499, "full": 2500, "piecewise": 2501, "cudagraph_runtime_mode": 2502, "cudagraphmode": 2503, "batch_descriptor": 2504, "mode": 2505, "get_forward_context": 2506, "_forward_context": 2507, "set_forward_context": 2508, "vllmconfig": 2509, "stores": 2510, "inject": 2511, "logic": 2512, "global": 2513, "forward_start_time": 2514, "need_to_track_batchsize": 2515, "track_batchsize": 2516, "perf_counter": 2517, "prev_context": 2518, "last_logging_time": 2519, "batchsize_logging_interval": 2520, "synchronous": 2521, "scheduling": 2522, "adding": 2523, "next": 2524, "synchronize": 2525, "measurement": 2526, "milliseconds": 2527, "batchsize_forward_time": 2528, "1000": 2529, "forward_stats": 2530, "bs": 2531, "profiling": 2532, "medium": 2533, "quantile": 2534, "round": 2535, "sort": 2536, "reverse": 2537, "stats": 2538, "median_time": 2539, "ms": 2540, "pooling_params": 2541, "all_parameters": 2542, "normalize": 2543, "activation": 2544, "step_tag_id": 2545, "returned_token_ids": 2546, "valid_parameters": 2547, "poolingparams": 2548, "verify": 2549, "poolingtask": 2550, "model_config": 2551, "modelconfig": 2552, "overwrite": 2553, "validation": 2554, "against": 2555, "_merge_default_parameters": 2556, "_set_default_parameters": 2557, "_verify_valid_parameters": 2558, "pooler_config": 2559, "getattr": 2560, "is_matryoshka": 2561, 