{"data": 0, "raw": 1, "vllm": 2, "10": 3, "setup": 4, "py": 5, "def": 6, "load_module_from_path": 7, "module_name": 8, "path": 9, "spec": 10, "importlib": 11, "util": 12, "spec_from_file_location": 13, "module": 14, "module_from_spec": 15, "sys": 16, "modules": 17, "loader": 18, "exec_module": 19, "return": 20, "is_sccache_available": 21, "bool": 22, "which": 23, "sccache": 24, "none": 25, "int": 26, "os": 27, "getenv": 28, "vllm_disable_sccache": 29, "is_ccache_available": 30, "ccache": 31, "is_ninja_available": 32, "ninja": 33, "is_url_available": 34, "url": 35, "str": 36, "from": 37, "urllib": 38, "request": 39, "import": 40, "urlopen": 41, "status": 42, "try": 43, "except": 44, "exception": 45, "false": 46, "200": 47, "class": 48, "cmakeextension": 49, "extension": 50, "__init__": 51, "self": 52, "name": 53, "cmake_lists_dir": 54, "kwa": 55, "super": 56, "sources": 57, "py_limited_api": 58, "true": 59, "abspath": 60, "compute_num_jobs": 61, "num_jobs": 62, "either": 63, "value": 64, "max_jobs": 65, "environment": 66, "variable": 67, "defined": 68, "number": 69, "cpus": 70, "available": 71, "envs": 72, "logger": 73, "info": 74, "using": 75, "jobs": 76, "else": 77, "sched_getaffinity": 78, "isn": 79, "universally": 80, "so": 81, "fall": 82, "back": 83, "cpu_count": 84, "we": 85, "get": 86, "error": 87, "here": 88, "len": 89, "attributeerror": 90, "nvcc_threads": 91, "_is_cuda": 92, "get_nvcc_cuda_version": 93, "version": 94, "11": 95, "when": 96, "set": 97, "reduce": 98, "avoid": 99, "overloading": 100, "system": 101, "nvcc": 102, "threads": 103, "max": 104, "configure": 105, "ext": 106, "ve": 107, "already": 108, "configured": 109, "cmakelists": 110, "txt": 111, "exit": 112, "early": 113, "cmake_build_ext": 114, "did_config": 115, "select": 116, "build": 117, "type": 118, "note": 119, "optimization": 120, "level": 121, "debug": 122, "default_cfg": 123, "relwithdebinfo": 124, "cfg": 125, "cmake_build_type": 126, "cmake_args": 127, "dcmake_build_type": 128, "format": 129, "dvllm_target_device": 130, "vllm_target_device": 131, "verbose": 132, "dcmake_verbose_makefile": 133, "dcmake_c_compiler_launcher": 134, "dcmake_cxx_compiler_launcher": 135, "dcmake_cuda_compiler_launcher": 136, "dcmake_hip_compiler_launcher": 137, "elif": 138, "pass": 139, "python": 140, "executable": 141, "cmake": 142, "can": 143, "find": 144, "exact": 145, "match": 146, "dvllm_python_executable": 147, "reuse": 148, "dependencies": 149, "subsequent": 150, "calls": 151, "dvllm_python_path": 152, "join": 153, "override": 154, "base": 155, "directory": 156, "fetchcontent": 157, "downloads": 158, "root": 159, "deps": 160, "allows": 161, "sharing": 162, "between": 163, "profiles": 164, "plays": 165, "more": 166, "nicely": 167, "fetchcontent_base_dir": 168, "fc_base_dir": 169, "root_dir": 170, "environ": 171, "dfetchcontent_base_dir": 172, "parallelism": 173, "tool": 174, "dnvcc_threads": 175, "build_tool": 176, "dcmake_job_pool_compile": 177, "string": 178, "compile": 179, "dcmake_job_pools": 180, "default": 181, "whatever": 182, "picks": 183, "make": 184, "sure": 185, "use": 186, "cuda_home": 187, "dcmake_cuda_compiler": 188, "bin": 189, "subprocess": 190, "check_call": 191, "cwd": 192, "build_temp": 193, "build_extensions": 194, "ensure": 195, "present": 196, "working": 197, "check_output": 198, "oserror": 199, "raise": 200, "runtimeerror": 201, "cannot": 202, "create": 203, "does": 204, "exist": 205, "exists": 206, "makedirs": 207, "targets": 208, "target_name": 209, "removeprefix": 210, "vllm_flash_attn": 211, "all": 212, "extensions": 213, "append": 214, "build_args": 215, "target": 216, "install": 217, "libraries": 218, "proper": 219, "location": 220, "outdir": 221, "get_ext_fullpath": 222, "parent": 223, "absolute": 224, "skip": 225, "same": 226, "continue": 227, "appends": 228, "prefix": 229, "contains": 230, "need": 231, "remove": 232, "range": 233, "count": 234, "should": 235, "actually": 236, "components": 237, "install_args": 238, "component": 239, "run": 240, "first": 241, "standard": 242, "build_ext": 243, "command": 244, "copy": 245, "build_lib": 246, "current": 247, "included": 248, "editable": 249, "glob": 250, "files": 251, "recursive": 252, "file": 253, "dst_file": 254, "split": 255, "print": 256, "copying": 257, "dirname": 258, "exist_ok": 259, "copy_file": 260, "precompiled_build_ext": 261, "disables": 262, "building": 263, "precompiled": 264, "binaries": 265, "assert": 266, "vllm_use_precompiled": 267, "only": 268, "supported": 269, "cuda": 270, "builds": 271, "skipping": 272, "extract_precompiled_and_patch_package": 273, "wheel_url_or_path": 274, "dict": 275, "tempfile": 276, "zipfile": 277, "temp_dir": 278, "isfile": 279, "wheel_filename": 280, "mkdtemp": 281, "wheels": 282, "wheel_path": 283, "downloading": 284, "wheel": 285, "urlretrieve": 286, "filename": 287, "existing": 288, "package_data_patch": 289, "files_to_copy": 290, "_c": 291, "abi3": 292, "_moe_c": 293, "_flashmla_c": 294, "_vllm_fa2_c": 295, "_vllm_fa3_c": 296, "cumem_allocator": 297, "compiled_regex": 298, "re": 299, "file_members": 300, "list": 301, "filter": 302, "lambda": 303, "filelist": 304, "extract": 305, "target_path": 306, "open": 307, "src": 308, "_path": 309, "wb": 310, "dst": 311, "shutil": 312, "copyfileobj": 313, "pkg": 314, "replace": 315, "setdefault": 316, "basename": 317, "finally": 318, "removing": 319, "temporary": 320, "rmtree": 321, "get_base_commit_in_main_branch": 322, "force": 323, "nightly": 324, "mainly": 325, "used": 326, "ci": 327, "testing": 328, "vllm_test_use_precompiled_nightly_wheel": 329, "latest": 330, "commit": 331, "hash": 332, "upstream": 333, "main": 334, "branch": 335, "resp_json": 336, "curl": 337, "https": 338, "api": 339, "github": 340, "com": 341, "repos": 342, "project": 343, "commits": 344, "decode": 345, "utf": 346, "upstream_main_commit": 347, "json": 348, "loads": 349, "sha": 350, "docker": 351, "context": 352, "git": 353, "may": 354, "immutable": 355, "missing": 356, "vllm_docker_build_context": 357, "check": 358, "local": 359, "repo": 360, "cat": 361, "calledprocesserror": 362, "fetch": 363, "remote": 364, "repository": 365, "update": 366, "any": 367, "branches": 368, "ensures": 369, "ref": 370, "its": 371, "history": 372, "our": 373, "current_branch": 374, "show": 375, "strip": 376, "base_commit": 377, "merge": 378, "valueerror": 379, "err": 380, "warning": 381, "failed": 382, "compatible": 383, "your": 384, "dev": 385, "_no_device": 386, "empty": 387, "has_cuda": 388, "torch": 389, "_is_neuron": 390, "_is_tpu": 391, "_is_hip": 392, "rocm": 393, "hip": 394, "neuron": 395, "tpu": 396, "_is_cpu": 397, "cpu": 398, "_is_xpu": 399, "xpu": 400, "_build_custom_ops": 401, "get_rocm_version": 402, "rocm_home": 403, "librocm": 404, "core": 405, "see": 406, "blob": 407, "d11f5c20d500f729c393680a01fa902ebf92094b": 408, "rocm_version": 409, "cpp": 410, "l21": 411, "librocm_core_file": 412, "lib": 413, "is_file": 414, "librocm_core": 415, "ctypes": 416, "cdll": 417, "vererrors": 418, "c_uint32": 419, "get_rocm_core_version": 420, "getrocmversion": 421, "restype": 422, "argtypes": 423, "pointer": 424, "major": 425, "minor": 426, "patch": 427, "byref": 428, "get_neuronxcc_version": 429, "sysconfig": 430, "site_dir": 431, "get_paths": 432, "purelib": 433, "version_file": 434, "neuronxcc": 435, "executed": 436, "successfully": 437, "fp": 438, "content": 439, "read": 440, "regular": 441, "expression": 442, "search": 443, "__version__": 444, "group": 445, "could": 446, "output": 447, "adapted": 448, "nvidia": 449, "apex": 450, "8b7a1ff183741dd8f9b87e7bafd04cfde99cea28": 451, "nvcc_output": 452, "universal_newlines": 453, "release_idx": 454, "index": 455, "release": 456, "nvcc_cuda_version": 457, "parse": 458, "get_gaudi_sw_version": 459, "returns": 460, "driver": 461, "enable": 462, "console": 463, "printing": 464, "hl": 465, "smi": 466, "shell": 467, "text": 468, "capture_output": 469, "env": 470, "enable_console": 471, "returncode": 472, "stdout": 473, "get_vllm_version": 474, "get_version": 475, "write_to": 476, "_version": 477, "sep": 478, "versions": 479, "might": 480, "contain": 481, "cuda_version": 482, "main_cuda_version": 483, "cuda_version_str": 484, "source": 485, "tarball": 486, "required": 487, "pypi": 488, "sdist": 489, "argv": 490, "cu": 491, "neuron_version": 492, "neuron_version_str": 493, "unknown": 494, "runtime": 495, "get_requirements": 496, "package": 497, "requirements": 498, "requirements_dir": 499, "_read_requirements": 500, "resolved_requirements": 501, "line": 502, "startswith": 503, "common": 504, "cuda_major": 505, "cuda_minor": 506, "modified_requirements": 507, "req": 508, "flash": 509, "attn": 510, "12": 511, "built": 512, "other": 513, "unsupported": 514, "platform": 515, "please": 516, "find_cuda_init": 517, "fn": 518, "callable": 519, "object": 520, "helper": 521, "function": 522, "initialization": 523, "errors": 524, "initializes": 525, "prints": 526, "stack": 527, "trace": 528, "how": 529, "happens": 530, "_lazy_init": 531, "wrapper": 532, "nonlocal": 533, "traceback": 534, "extract_stack": 535, "initialized": 536, "format_list": 537, "sampling_params": 538, "samplingtype": 539, "intenum": 540, "greedy": 541, "random": 542, "random_seed": 543, "from_optional": 544, "optional": 545, "union": 546, "basemodel": 547, "regex": 548, "choice": 549, "grammar": 550, "json_object": 551, "backend": 552, "whitespace_pattern": 553, "structural_tag": 554, "guideddecodingparams": 555, "arg": 556, "schemas": 557, "pydantic": 558, "models": 559, "isinstance": 560, "model_json_schema": 561, "__post_init__": 562, "validate": 563, "some": 564, "fields": 565, "mutually": 566, "exclusive": 567, "guide_count": 568, "sum": 569, "you": 570, "one": 571, "kind": 572, "guided": 573, "decoding": 574, "multiple": 575, "specified": 576, "__dict__": 577, "requestoutputkind": 578, "enum": 579, "entire": 580, "far": 581, "every": 582, "requestoutput": 583, "cumulative": 584, "deltas": 585, "each": 586, "delta": 587, "do": 588, "intermediate": 589, "final_only": 590, "best_of": 591, "presence_penalty": 592, "float": 593, "frequency_penalty": 594, "repetition_penalty": 595, "temperature": 596, "top_p": 597, "top_k": 598, "min_p": 599, "seed": 600, "stop": 601, "stop_token_ids": 602, "bad_words": 603, "include_stop_str_in_output": 604, "ignore_eos": 605, "max_tokens": 606, "16": 607, "min_tokens": 608, "logprobs": 609, "prompt_logprobs": 610, "detokenize": 611, "skip_special_tokens": 612, "spaces_between_special_tokens": 613, "logits_processors": 614, "logitsprocessor": 615, "truncate_prompt_tokens": 616, "annotated": 617, "msgspec": 618, "meta": 619, "ge": 620, "output_kind": 621, "guided_decoding": 622, "logit_bias": 623, "allowed_token_ids": 624, "extra_args": 625, "samplingparams": 626, "convert": 627, "token_id": 628, "integer": 629, "clamp": 630, "bias": 631, "100": 632, "per": 633, "openai": 634, "token": 635, "min": 636, "items": 637, "frequency": 638, "_penalty": 639, "deal": 640, "_real_n": 641, "original": 642, "result": 643, "results": 644, "must": 645, "greater": 646, "than": 647, "equal": 648, "got": 649, "_max_temp": 650, "less": 651, "cause": 652, "numerical": 653, "nan": 654, "inf": 655, "tensors": 656, "have": 657, "maxed": 658, "out": 659, "characters": 660, "hold": 661, "evaluation": 662, "until": 663, "sequence": 664, "finished": 665, "output_text_buffer_length": 666, "_verify_args": 667, "_sampling_eps": 668, "zero": 669, "means": 670, "sampling": 671, "_verify_greedy_sampling": 672, "eos_token_id": 673, "added": 674, "engine": 675, "_all_stop_token_ids": 676, "least": 677, "non": 678, "negative": 679, "quietly": 680, "accept": 681, "disabled": 682, "prefer": 683, "disable": 684, "typeerror": 685, "__name__": 686, "st_id": 687, "integers": 688, "stop_str": 689, "strings": 690, "deto": 691, "kenize": 692, "update_from_generation_config": 693, "generation_config": 694, "model_eos_token_id": 695, "values": 696, "add": 697, "eos": 698, "id": 699, "support": 700, "processing": 701, "generation": 702, "eos_ids": 703, "don": 704, "include": 705, "primary": 706, "since": 707, "handled": 708, "separately": 709, "stopping": 710, "purposes": 711, "discard": 712, "update_from_tokenizer": 713, "tokenizer": 714, "anytokenizer": 715, "_bad_words_token_ids": 716, "bad_word": 717, "prohibit": 718, "words": 719, "both": 720, "beginning": 721, "middle": 722, "related": 723, "add_prefix_space": 724, "parameter": 725, "prompt": 726, "lstrip": 727, "prompt_token_ids": 728, "encode": 729, "add_special_tokens": 730, "space": 731, "produces": 732, "new": 733, "word": 734, "invalid_token_ids": 735, "bad_words_token_ids": 736, "max_token_id": 737, "model": 738, "vocabulary": 739, "size": 740, "following": 741, "tokens": 742, "were": 743, "bad": 744, "satisfying": 745, "sampling_type": 746, "all_stop_token_ids": 747, "internal": 748, "backward": 749, "compatibility": 750, "guaranteed": 751, "clone": 752, "deep": 753, "maybe": 754, "objects": 755, "arbitrary": 756, "nontrivial": 757, "amount": 758, "expensive": 759, "however": 760, "copied": 761, "processor": 762, "needs": 763, "parallel": 764, "sequences": 765, "issues": 766, "3087": 767, "logit_processor_refs": 768, "lp": 769, "hasattr": 770, "deepcopy": 771, "memo": 772, "__repr__": 773, "beamsearchparams": 774, "struct": 775, "omit_defaults": 776, "ignore": 777, "call": 778, "cached_property": 779, "beam": 780, "parameters": 781, "beam_width": 782, "length_penalty": 783, "pooling_params": 784, "all_parameters": 785, "dimensions": 786, "normalize": 787, "activation": 788, "softmax": 789, "step_tag_id": 790, "returned_token_ids": 791, "valid_parameters": 792, "embed": 793, "classify": 794, "score": 795, "poolingparams": 796, "instance": 797, "verify": 798, "task": 799, "poolingtask": 800, "model_config": 801, "modelconfig": 802, "msg": 803, "overwrite": 804, "validation": 805, "done": 806, "against": 807, "config": 808, "method": 809, "_merge_default_parameters": 810, "_set_default_parameters": 811, "_verify_valid_parameters": 812, "pooler_config": 813, "getattr": 814, "setattr": 815, "is_matryoshka": 816, "served_model_name": 817, "matryoshka": 818, "representation": 819, "changing": 820, "lead": 821, "poor": 822, "mds": 823, "matryoshka_dimensions": 824, "supports": 825, "pooling": 826, "invalid_parameters": 827, "requires_token_ids": 828, "extra_kwargs": 829, "has": 830, "get_default_cache_root": 831, "xdg_cache_home": 832, "expanduser": 833, "cache": 834, "get_default_config_root": 835, "xdg_config_home": 836, "maybe_convert_int": 837, "maybe_convert_bool": 838, "get_vllm_port": 839, "port": 840, "vllm_port": 841, "otherwise": 842, "raises": 843, "uri": 844, "suggest": 845, "k8s": 846, "service": 847, "discovery": 848, "issue": 849, "urlparse": 850, "parsed": 851, "scheme": 852, "appears": 853, "caused": 854, "kubernetes": 855, "docs": 856, "ai": 857, "en": 858, "stable": 859, "serving": 860, "env_vars": 861, "html": 862, "valid": 863, "__getattr__": 864, "lazy": 865, "variables": 866, "environment_variables": 867, "attribute": 868, "__dir__": 869, "keys": 870, "is_set": 871, "explicitly": 872, "set_vllm_use_v1": 873, "use_v1": 874, "vllm_use_v1": 875, "user": 876, "compute_hash": 877, "whenever": 878, "key": 879, "factors": 880, "affects": 881, "computation": 882, "graph": 883, "example": 884, "different": 885, "vllm_pp_layer_partition": 886, "generate": 887, "graphs": 888, "vars": 889, "affect": 890, "kernels": 891, "attention": 892, "backends": 893, "also": 894, "todo": 895, "deftruth": 896, "factorize": 897, "environment_variables_to_hash": 898, "vllm_mla_disable": 899, "vllm_use_triton_flash_attn": 900, "vllm_use_triton_awq": 901, "vllm_dp_rank": 902, "vllm_dp_size": 903, "vllm_use_standalone_compile": 904, "vllm_fused_moe_chunk_size": 905, "vllm_flashinfer_moe_backend": 906, "vllm_v1_use_prefill_decode_attention": 907, "vllm_use_aiter_unified_attention": 908, "vllm_attention_backend": 909, "vllm_use_flashinfer_sampler": 910, "vllm_flashinfer_force_tensor_cores": 911, "vllm_disabled_kernels": 912, "vllm_use_deep_gemm": 913, "vllm_use_trtllm_fp4_gemm": 914, "vllm_use_flashinfer_moe_fp8": 915, "vllm_use_flashinfer_moe_fp4": 916, "vllm_use_flashinfer_moe_mxfp4_mxfp8": 917, "vllm_use_flashinfer_moe_mxfp4_bf16": 918, "vllm_use_cudnn_prefill": 919, "vllm_use_trtllm_attention": 920, "vllm_rocm_use_aiter": 921, "vllm_rocm_use_aiter_paged_attn": 922, "vllm_rocm_use_aiter_linear": 923, "vllm_rocm_use_aiter_moe": 924, "vllm_rocm_use_aiter_rmsnorm": 925, "vllm_rocm_use_aiter_mla": 926, "vllm_rocm_use_aiter_mha": 927, "vllm_rocm_use_skinny_gemm": 928, "vllm_rocm_fp8_padding": 929, "vllm_rocm_moe_padding": 930, "vllm_rocm_custom_paged_attn": 931, "vllm_rocm_quick_reduce_quantization": 932, "vllm_rocm_quick_reduce_cast_bf16_to_fp16": 933, "vllm_rocm_quick_reduce_max_size_bytes_mb": 934, "goes": 935, "sync": 936, "bug": 937, "hash_str": 938, "hashlib": 939, "md5": 940, "usedforsecurity": 941, "hexdigest": 942, "_ipex_ops": 943, "_reshape_activation_tensor": 944, "tensor": 945, "tuple": 946, "num": 947, "reshape": 948, "x1": 949, "x2": 950, "chunk": 951, "chunks": 952, "dim": 953, "silu_and_mul": 954, "ipex": 955, "llm": 956, "functional": 957, "gelu_and_mul": 958, "gelu_tanh_and_mul": 959, "gelu_fast": 960, "nn": 961, "gelu": 962, "gelu_new": 963, "gelu_quick": 964, "paged_attention_v1": 965, "query": 966, "key_cache": 967, "value_cache": 968, "num_kv_heads": 969, "scale": 970, "block_tables": 971, "context_lens": 972, "block_size": 973, "max_context_len": 974, "alibi_slopes": 975, "kv_cache_dtype": 976, "k_scale": 977, "v_scale": 978, "tp_rank": 979, "blocksparse_local_blocks": 980, "blocksparse_vert_stride": 981, "blocksparse_block_size": 982, "64": 983, "blocksparse_head_sliding_step": 984, "auto": 985, "num_heads": 986, "num_queries_per_tokens": 987, "pagedattention": 988, "single_query_kv_attention": 989, "contiguous": 990, "view_as": 991, "paged_attention_v2": 992, "exp_sum": 993, "max_logits": 994, "tmp_out": 995, "rotary_embedding": 996, "positions": 997, "batch_size": 998, "seq_len": 999, "head_size": 1000, "cos_sin_cache": 1001, "cos_sin_dim": 1002, "rot_dim": 1003, "is_neox": 1004, "rotary_embedding_batched": 1005, "batched_rotary_embedding": 1006, "cos_sin_cache_offsets": 1007, "rms_norm": 1008, "input": 1009, "weight": 1010, "epsilon": 1011, "fused_add_rms_norm": 1012, "residual": 1013, "tmp": 1014, "add_rms_norm": 1015, "copy_": 1016, "varlen_attention": 1017, "seqlen_q": 1018, "seqlen_k": 1019, "max_seqlen_q": 1020, "max_seqlen_k": 1021, "pdropout": 1022, "softmax_scale": 1023, "zero_tensors": 1024, "is_causal": 1025, "return_softmax": 1026, "gen_": 1027, "generator": 1028, "window_size_left": 1029, "window_size_right": 1030, "logits_soft_cap": 1031, "endswith": 1032, "reshape_and_cache": 1033, "slot_mapping": 1034, "reshape_and_cache_flash": 1035, "k_scale_float": 1036, "v_scale_float": 1037, "fp8": 1038, "kv": 1039, "flash_attn_varlen_func": 1040, "cu_seqlens_q": 1041, "seqused_k": 1042, "kernel": 1043, "causal": 1044, "block_table": 1045, "window_size": 1046, "softcap": 1047, "cu_seqlens_k": 1048, "currently": 1049, "keep": 1050, "scheduler_metadata": 1051, "fa_version": 1052, "q_descale": 1053, "k_descale": 1054, "v_descale": 1055, "num_splits": 1056, "s_aux": 1057, "cumsum": 1058, "device": 1059, "dtype": 1060, "int32": 1061, "real_window_size": 1062, "get_scheduler_metadata": 1063, "num_heads_q": 1064, "num_heads_kv": 1065, "headdim": 1066, "cache_seqlens": 1067, "qkv_dtype": 1068, "bfloat16": 1069, "headdim_v": 1070, "cu_seqlens_k_new": 1071, "cache_leftpad": 1072, "page_size": 1073, "max_seqlen_k_new": 1074, "infinite": 1075, "window": 1076, "has_softcap": 1077, "tuned": 1078, "speed": 1079, "pack_gqa": 1080, "sm_margin": 1081, "sms": 1082, "communication": 1083, "warning_once": 1084, "implemented": 1085, "ipex_ops": 1086, "returning": 1087, "copy_blocks": 1088, "key_caches": 1089, "value_caches": 1090, "block_mapping": 1091, "swap_blocks": 1092, "beam_search": 1093, "beamsearchsequence": 1094, "keeps": 1095, "track": 1096, "log": 1097, "probability": 1098, "field": 1099, "filled": 1100, "about": 1101, "returned": 1102, "includes": 1103, "logprob": 1104, "lora_request": 1105, "lorarequest": 1106, "cum_logprob": 1107, "finish_reason": 1108, "stop_reason": 1109, "multi_modal_data": 1110, "multimodaldatadict": 1111, "mm_processor_kwargs": 1112, "beamsearchoutput": 1113, "best": 1114, "length": 1115, "width": 1116, "beamsearchinstance": 1117, "prompt_tokens": 1118, "kwargs": 1119, "beams": 1120, "completed": 1121, "get_beam_search_score": 1122, "cumulative_logprob": 1123, "calculate": 1124, "penalty": 1125, "huggingface": 1126, "transformers": 1127, "ccb92be23def445f2afdea94c31286f84b89eb5b": 1128, "l938": 1129, "create_sort_beams_key_function": 1130, "sort_beams_key": 1131, "_prev_minor_version_was": 1132, "version_str": 1133, "whether": 1134, "given": 1135, "matches": 1136, "previous": 1137, "supplied": 1138, "hidden": 1139, "metrics": 1140, "anything": 1141, "tree": 1142, "__version_tuple__": 1143, "won": 1144, "right": 1145, "thing": 1146, "_prev_minor_version": 1147, "purpose": 1148, "work": 1149, "fine": 1150, "scalar_type": 1151, "nanrepr": 1152, "nans": 1153, "ieee_754": 1154, "exp": 1155, "1s": 1156, "mantissa": 1157, "0s": 1158, "extd_range_max_min": 1159, "_floating_point_max_int": 1160, "52": 1161, "exponent": 1162, "represent": 1163, "double": 1164, "__str__": 1165, "max_mantissa": 1166, "nan_repr": 1167, "max_exponent": 1168, "adjust": 1169, "now": 1170, "assume": 1171, "where": 1172, "bits": 1173, "precedent": 1174, "biases": 1175, "float8_e4m3b11fnuz": 1176, "jax": 1177, "ml": 1178, "ml_dtypes": 1179, "premature": 1180, "over": 1181, "complication": 1182, "just": 1183, "assuming": 1184, "exponent_bias": 1185, "exponent_bias_double": 1186, "max_exponent_double": 1187, "shift": 1188, "ieee": 1189, "bitwise": 1190, "them": 1191, "together": 1192, "_floating_point_max": 1193, "double_raw": 1194, "unpack": 1195, "pack": 1196, "_raw_max": 1197, "is_floating_point": 1198, "size_bits": 1199, "is_signed": 1200, "_raw_min": 1201, "floating": 1202, "point": 1203, "types": 1204, "signed": 1205, "sign_bit_double": 1206, "63": 1207, "max_raw": 1208, "min_raw": 1209, "int64_t": 1210, "scalartype": 1211, "passed": 1212, "pytorch": 1213, "custom": 1214, "ops": 1215, "layout": 1216, "kept": 1217, "from_id": 1218, "val": 1219, "offset": 1220, "or_and_advance": 1221, "member": 1222, "bit_width": 1223, "bit_mask": 1224, "32": 1225, "_finite_values_only": 1226, "too": 1227, "big": 1228, "fit": 1229, "int64": 1230, "_scalar_types_id_map": 1231, "representable": 1232, "scalar": 1233, "accounting": 1234, "sign": 1235, "bit": 1236, "consistency": 1237, "org": 1238, "generated": 1239, "is_integer": 1240, "has_bias": 1241, "has_infs": 1242, "infinity": 1243, "has_nans": 1244, "is_ieee_754": 1245, "follows": 1246, "754": 1247, "conventions": 1248, "naming": 1249, "generally": 1250, "leading": 1251, "_e": 1252, "exponent_bits": 1253, "mantissa_bits": 1254, "flags": 1255, "finite": 1256, "infinities": 1257, "encoding": 1258, "ret": 1259, "uint": 1260, "__len__": 1261, "int_": 1262, "cls": 1263, "noqa": 1264, "b018": 1265, "cached": 1266, "unsigned": 1267, "float_ieee754": 1268, "float_": 1269, "finite_values_only": 1270, "follow": 1271, "constructor": 1272, "scalar_type_id": 1273, "doesn": 1274, "scalar_types": 1275, "int4": 1276, "uint4": 1277, "int8": 1278, "uint8": 1279, "float8_e4m3fn": 1280, "float8_e5m2": 1281, "float8_e8m0fnu": 1282, "float16_e8m7": 1283, "float16_e5m10": 1284, "fp6": 1285, "usyd": 1286, "fsalab": 1287, "fp6_llm": 1288, "float6_e3m2f": 1289, "fp4": 1290, "www": 1291, "opencompute": 1292, "documents": 1293, "ocp": 1294, "microscaling": 1295, "formats": 1296, "mx": 1297, "v1": 1298, "final": 1299, "pdf": 1300, "float4_e2m1f": 1301, "gptq": 1302, "uint2b2": 1303, "uint3b4": 1304, "uint4b8": 1305, "uint8b128": 1306, "128": 1307, "colloquial": 1308, "names": 1309, "float16": 1310, "_custom_ops": 1311, "seq_lens": 1312, "max_seq_len": 1313, "paged_attention_rocm": 1314, "query_start_loc": 1315, "fp8_out_scale": 1316, "_rocm_c": 1317, "paged_attention": 1318, "mla_decode_kvcache_cpu": 1319, "kv_cache": 1320, "_c_cpu": 1321, "mla_decode_kvcache": 1322, "merge_attn_states": 1323, "prefix_output": 1324, "prefix_lse": 1325, "suffix_output": 1326, "suffix_lse": 1327, "output_lse": 1328, "convert_vertical_slash_indexes": 1329, "q_seqlens": 1330, "batch": 1331, "kv_seqlens": 1332, "vertical_indexes": 1333, "n_heads": 1334, "nnz_v": 1335, "slash_indexes": 1336, "nnz_s": 1337, "context_size": 1338, "block_size_m": 1339, "block_size_n": 1340, "nnz_slash": 1341, "nnz_vertical": 1342, "num_rows": 1343, "block_count": 1344, "zeros": 1345, "block_offset": 1346, "column_count": 1347, "column_index": 1348, "convert_vertical_slash_indexes_mergehead": 1349, "head": 1350, "indices": 1351, "vertical_indices_count": 1352, "slash_indices_count": 1353, "updated": 1354, "input_contiguous": 1355, "apply_repetition_penalties_torch": 1356, "logits": 1357, "prompt_mask": 1358, "output_mask": 1359, "repetition_penalties": 1360, "unsqueeze": 1361, "repeat": 1362, "apply": 1363, "op": 1364, "penalties": 1365, "positive": 1366, "divide": 1367, "multiply": 1368, "scaling": 1369, "apply_repetition_penalties_cuda": 1370, "apply_repetition_penalties_": 1371, "apply_repetition_penalties": 1372, "repetition": 1373, "place": 1374, "args": 1375, "shape": 1376, "num_seqs": 1377, "vocab_size": 1378, "boolean": 1379, "indicating": 1380, "appear": 1381, "is_cuda": 1382, "is_contiguous": 1383, "rms_norm_dynamic_per_token_quant": 1384, "quant_dtype": 1385, "scale_ub": 1386, "empty_like": 1387, "scales": 1388, "numel": 1389, "float32": 1390, "awq_dequantize": 1391, "qweight": 1392, "split_k_iters": 1393, "thx": 1394, "thy": 1395, "model_executor": 1396, "layers": 1397, "quantization": 1398, "awq_triton": 1399, "awq_dequantize_triton": 1400, "awq_gemm": 1401, "qzeros": 1402, "awq_gemm_triton": 1403, "gptq_gemm": 1404, "b_q_weight": 1405, "b_gptq_qzeros": 1406, "b_gptq_scales": 1407, "b_g_idx": 1408, "use_exllama": 1409, "gptq_shuffle": 1410, "q_weight": 1411, "q_perm": 1412, "marlin_gemm": 1413, "b_scales": 1414, "workspace": 1415, "size_m": 1416, "size_n": 1417, "size_k": 1418, "gptq_marlin_24_gemm": 1419, "b_meta": 1420, "b_q_type": 1421, "cutlass_scaled_mm_supports_fp4": 1422, "cuda_device_capability": 1423, "cutlass_blockwise_scaled_grouped_mm": 1424, "scales_a": 1425, "scales_b": 1426, "problem_sizes": 1427, "expert_offsets": 1428, "cutlass_scaled_fp4_mm": 1429, "block_scale_a": 1430, "block_scale_b": 1431, "alpha": 1432, "out_dtype": 1433, "ndim": 1434, "cutlass_scaled_mm_supports_fp8": 1435, "cutlass_scaled_mm_supports_block_fp8": 1436, "cutlass_scaled_mm": 1437, "scale_a": 1438, "scale_b": 1439, "implements": 1440, "fused": 1441, "mm": 1442, "numpy": 1443, "style": 1444, "broadcasting": 1445, "order": 1446, "blockwise": 1447, "like": 1448, "found": 1449, "deepseek": 1450, "v3": 1451, "extended": 1452, "broadcast": 1453, "rules": 1454, "extend": 1455, "rule": 1456, "extent": 1457, "dimension": 1458, "corresponding": 1459, "element": 1460, "along": 1461, "src_shape": 1462, "target_shape": 1463, "times": 1464, "consecutively": 1465, "would": 1466, "expand": 1467, "case": 1468, "massage": 1469, "2d": 1470, "view": 1471, "cutlass_compatible_b": 1472, "current_platform": 1473, "is_rocm": 1474, "compressed_tensors": 1475, "triton_scaled_mm": 1476, "cutlass_scaled_mm_azp": 1477, "azp_adj": 1478, "azp": 1479, "param": 1480, "always": 1481, "channel": 1482, "cutlass_sparse_scaled_mm_supported": 1483, "cutlass_group_gemm_supported": 1484, "cutlass_sparse_compress": 1485, "compresses": 1486, "sparse": 1487, "matrix": 1488, "cutlass": 1489, "operations": 1490, "takes": 1491, "dense": 1492, "two": 1493, "elements": 1494, "metadata": 1495, "compressed": 1496, "containing": 1497, "a_nzs": 1498, "a_meta": 1499, "compression": 1500, "operation": 1501, "fails": 1502, "notes": 1503, "encodes": 1504, "sparsity": 1505, "elemspermetaelem": 1506, "8b": 1507, "2b_per_nz": 1508, "cutlass_scaled_sparse_mm": 1509, "bt_nzs": 1510, "bt_meta": 1511, "performs": 1512, "scaled": 1513, "multiplication": 1514, "steps": 1515, "randn": 1516, "prune": 1517, "prune_to_2_4": 1518, "compress": 1519, "transposed": 1520, "perform": 1521, "applying": 1522, "get_cutlass_moe_mm_data": 1523, "topk_ids": 1524, "problem_sizes1": 1525, "problem_sizes2": 1526, "input_permutation": 1527, "output_permutation": 1528, "num_experts": 1529, "blockscale_offsets": 1530, "prepare": 1531, "necessary": 1532, "grouped": 1533, "multiplications": 1534, "based": 1535, "moe": 1536, "expert": 1537, "mapping": 1538, "uses": 1539, "compute": 1540, "mark": 1541, "begins": 1542, "after": 1543, "sorted": 1544, "computed": 1545, "mxnxk": 1546, "sizes": 1547, "mms": 1548, "permutation": 1549, "shuffle": 1550, "before": 1551, "executing": 1552, "argument": 1553, "block": 1554, "rows": 1555, "shuffle_rows": 1556, "input_tensor": 1557, "dst2src_map": 1558, "according": 1559, "store": 1560, "output_tensor": 1561, "permute": 1562, "performing": 1563, "num_tokens_permuted": 1564, "get_cutlass_pplx_moe_mm_data": 1565, "expert_num_tokens": 1566, "num_local_experts": 1567, "padded_m": 1568, "non_zero_expert_idxs": 1569, "consecutive": 1570, "experts": 1571, "counts": 1572, "cutlass_moe_mm": 1573, "out_tensors": 1574, "a_tensors": 1575, "b_tensors": 1576, "a_scales": 1577, "a_strides": 1578, "b_strides": 1579, "c_strides": 1580, "per_act_token": 1581, "per_out_ch": 1582, "single": 1583, "executes": 1584, "quantized": 1585, "ab": 1586, "strides": 1587, "cutlass_fp4_moe_mm": 1588, "alphas": 1589, "sf_offsets": 1590, "blockscaled": 1591, "gemm": 1592, "runs": 1593, "gemms": 1594, "combination": 1595, "problem": 1596, "during": 1597, "nvfp4": 1598, "fusedmoe": 1599, "forward": 1600, "a_ptrs": 1601, "b_ptrs": 1602, "weights": 1603, "a_": 1604, "blockscales": 1605, "e4m3": 1606, "precision": 1607, "sf_size": 1608, "sf_offset": 1609, "cutlass_fp4_group_mm": 1610, "gptq_marlin_repack": 1611, "perm": 1612, "num_bits": 1613, "awq_marlin_repack": 1614, "gptq_marlin_moe_repack": 1615, "awq_marlin_moe_repack": 1616, "gptq_marlin_gemm": 1617, "b_bias": 1618, "global_scale": 1619, "b_zeros": 1620, "g_idx": 1621, "is_k_full": 1622, "use_atomic_add": 1623, "use_fp32_reduce": 1624, "is_zp_float": 1625, "machete_supported_schedules": 1626, "a_type": 1627, "b_type": 1628, "group_scales_type": 1629, "group_zeros_type": 1630, "channel_scales_type": 1631, "token_scales_type": 1632, "out_type": 1633, "machete_mm": 1634, "b_q": 1635, "machete_prepack_b": 1636, "b_group_scales": 1637, "b_group_zeros": 1638, "b_group_size": 1639, "b_channel_scales": 1640, "a_token_scales": 1641, "schedule": 1642, "permute_cols": 1643, "scaled_fp4_quant": 1644, "input_global_scale": 1645, "quantize": 1646, "quantizes": 1647, "last": 1648, "dynamically": 1649, "factor": 1650, "shared": 1651, "stored": 1652, "swizzled": 1653, "thread": 1654, "execution": 1655, "tcgen05": 1656, "mma": 1657, "4x": 1658, "packed": 1659, "float8_e4m3": 1660, "sizzled": 1661, "other_dims": 1662, "fp16": 1663, "bf16": 1664, "rounded": 1665, "due": 1666, "requirement": 1667, "minimum": 1668, "tile": 1669, "128x4": 1670, "pad": 1671, "multiples": 1672, "round_up": 1673, "rounded_m": 1674, "scale_n": 1675, "rounded_n": 1676, "output_scale": 1677, "scaled_fp4_experts_quant": 1678, "topk": 1679, "inputs": 1680, "offsets": 1681, "blockscale": 1682, "outputs": 1683, "output_scales": 1684, "control": 1685, "maximum": 1686, "prevent": 1687, "running": 1688, "memory": 1689, "increased": 1690, "larger": 1691, "max_tokens_per_expert": 1692, "vllm_max_tokens_per_expert_fp4_moe": 1693, "m_numtopk": 1694, "cutlass_moe_fp4": 1695, "observed": 1696, "scales_k": 1697, "padded_k": 1698, "rch": 1699, "scaled_fp8_quant": 1700, "num_token_padding": 1701, "use_per_token_if_dynamic": 1702, "static": 1703, "dynamic": 1704, "provide": 1705, "omit": 1706, "determined": 1707, "padding": 1708, "downstream": 1709, "benefit": 1710, "upper": 1711, "bound": 1712, "per_tensor": 1713, "per_token": 1714, "code": 1715, "assumes": 1716, "batch_dim": 1717, "num_tokens": 1718, "flattened": 1719, "mi300": 1720, "float_e3m3fnuz": 1721, "fp8_dtype": 1722, "pe": 1723, "dynamic_per_token_scaled_fp8_quant": 1724, "dynamic_scaled_fp8_quant": 1725, "static_scaled_fp8_quant": 1726, "allspark_repack_weight": 1727, "zero_point": 1728, "has_zp": 1729, "rearrange": 1730, "asymmetric": 1731, "n32k16": 1732, "ampere": 1733, "w8a16": 1734, "provided": 1735, "symmetric": 1736, "rearranged": 1737, "optionally": 1738, "n_32align": 1739, "qweight_reorder": 1740, "scale_reorder": 1741, "zero_point_reorder": 1742, "rearrange_kn_weight_as_n32k16_order": 1743, "allspark_w8a16_gemm": 1744, "b_qweight": 1745, "b_qzeros": 1746, "group_size": 1747, "sm_count": 1748, "sm_version": 1749, "cublas_m_threshold": 1750, "n32k16_reorder": 1751, "scaled_int8_quant": 1752, "invoke": 1753, "ignored": 1754, "static_scaled_int8_quant": 1755, "input_scales": 1756, "input_azp": 1757, "dynamic_scaled_int8_quant": 1758, "marlin_qqq_gemm": 1759, "s_tok": 1760, "s_ch": 1761, "s_group": 1762, "ggml_dequantize": 1763, "quant_type": 1764, "ggml_mul_mat_vec_a8": 1765, "row": 1766, "ggml_mul_mat_a8": 1767, "ggml_moe_a8": 1768, "sorted_token_ids": 1769, "expert_ids": 1770, "num_tokens_post_padded": 1771, "ggml_moe_a8_vec": 1772, "symint": 1773, "ggml_moe_get_block_size": 1774, "selective_scan_fwd": 1775, "d_": 1776, "z_": 1777, "delta_bias_": 1778, "delta_softplus": 1779, "cache_indices": 1780, "has_initial_state": 1781, "ssm_states": 1782, "pad_slot_id": 1783, "llmm1": 1784, "rows_per_block": 1785, "wvsplitk": 1786, "cu_count": 1787, "wvsplitkq": 1788, "moe_sum": 1789, "moe_align_block_size": 1790, "experts_ids": 1791, "num_tokens_post_pad": 1792, "moe_wna16_gemm": 1793, "topk_weights": 1794, "block_size_k": 1795, "notimplementederror": 1796, "optimized": 1797, "platforms": 1798, "topk_softmax": 1799, "token_expert_indices": 1800, "gating_output": 1801, "moe_wna16_marlin_gemm": 1802, "num_tokens_past_padded": 1803, "moe_block_size": 1804, "mul_topk_weights": 1805, "is_ep": 1806, "_c_cache_ops": 1807, "concat_and_cache_mla": 1808, "kv_c": 1809, "k_pe": 1810, "copy_blocks_mla": 1811, "kv_caches": 1812, "convert_fp8": 1813, "kv_dtype": 1814, "gather_cache": 1815, "src_cache": 1816, "cu_seq_lens": 1817, "seq_starts": 1818, "get_device_attribute": 1819, "_c_cuda_utils": 1820, "get_max_shared_memory_per_block_device_attribute": 1821, "ruff": 1822, "e501": 1823, "init_custom_ar": 1824, "ipc_tensors": 1825, "rank_data": 1826, "rank": 1827, "fully_connected": 1828, "_c_custom_ar": 1829, "all_reduce": 1830, "fa": 1831, "inp": 1832, "reg_buffer": 1833, "reg_buffer_sz_bytes": 1834, "dispose": 1835, "meta_size": 1836, "register_buffer": 1837, "get_graph_buffer_ipc_meta": 1838, "register_graph_buffers": 1839, "handles": 1840, "allocate_shared_buffer_and_handle": 1841, "open_mem_handle": 1842, "mem_handle": 1843, "free_shared_buffer": 1844, "ptr": 1845, "init_custom_qr": 1846, "world_size": 1847, "qr_max_size": 1848, "qr_destroy": 1849, "qr_all_reduce": 1850, "quant_level": 1851, "cast_bf2half": 1852, "qr_get_handle": 1853, "qr_open_handles": 1854, "get_flash_mla_metadata": 1855, "num_heads_per_head_k": 1856, "num_heads_k": 1857, "arguments": 1858, "equals": 1859, "seq_len_q": 1860, "tile_scheduler_metadata": 1861, "num_sm_parts": 1862, "tileschedulermetadatasize": 1863, "flash_mla_with_kvcache": 1864, "k_cache": 1865, "head_dim_v": 1866, "head_dim": 1867, "num_blocks": 1868, "page_block_size": 1869, "max_num_blocks_per_seq": 1870, "get_mla_metadata": 1871, "qk": 1872, "sqrt": 1873, "mask": 1874, "softmax_lse": 1875, "flash_mla_fwd_kvcache": 1876, "cutlass_mla_decode": 1877, "q_nope": 1878, "q_pe": 1879, "kv_c_and_k_pe_cache": 1880, "page_table": 1881, "sm100_cutlass_mla_decode": 1882, "num_kv_splits": 1883, "sm100_cutlass_mla_get_workspace_size": 1884, "num_batches": 1885, "_print_debug_once": 1886, "hashable": 1887, "stacklevel": 1888, "caller": 1889, "_print_info_once": 1890, "_print_warning_once": 1891, "_vllmlogger": 1892, "information": 1893, "methods": 1894, "directly": 1895, "logging": 1896, "conflicting": 1897, "intel_extension_for_pytorch": 1898, "utils": 1899, "_logger": 1900, "debug_once": 1901, "message": 1902, "silently": 1903, "dropped": 1904, "info_once": 1905, "_configure_vllm_root_logger": 1906, "logging_config": 1907, "vllm_configure_logging": 1908, "vllm_logging_config_path": 1909, "evaluated": 1910, "implies": 1911, "unset": 1912, "default_logging_config": 1913, "load": 1914, "custom_config": 1915, "invalid": 1916, "expected": 1917, "formatter": 1918, "formatters": 1919, "provides": 1920, "backwards": 1921, "10134": 1922, "newlineformatter": 1923, "logging_utils": 1924, "dictconfig": 1925, "init_logger": 1926, "loggers": 1927, "retrieved": 1928, "way": 1929, "been": 1930, "getlogger": 1931, "method_name": 1932, "_methods_to_patch": 1933, "methodtype": 1934, "cast": 1935, "_trace_calls": 1936, "log_path": 1937, "frame": 1938, "event": 1939, "f_code": 1940, "co_filename": 1941, "lineno": 1942, "f_lineno": 1943, "func_name": 1944, "co_name": 1945, "functions": 1946, "last_frame": 1947, "f_back": 1948, "last_filename": 1949, "last_lineno": 1950, "last_func_name": 1951, "initial": 1952, "ts": 1953, "datetime": 1954, "strftime": 1955, "write": 1956, "nameerror": 1957, "deleted": 1958, "shutdown": 1959, "partial": 1960, "enable_trace_function_call": 1961, "log_file_path": 1962, "tracing": 1963, "under": 1964, "useful": 1965, "debugging": 1966, "hangs": 1967, "crashes": 1968, "calling": 1969, "enabled": 1970, "affected": 1971, "vllm_trace_function": 1972, "record": 1973, "slow": 1974, "down": 1975, "suggested": 1976, "hang": 1977, "saved": 1978, "__file__": 1979, "settrace": 1980, "connections": 1981, "reuse_client": 1982, "_sync_client": 1983, "requests": 1984, "session": 1985, "_async_client": 1986, "aiohttp": 1987, "clientsession": 1988, "get_sync_client": 1989, "async": 1990, "get_async_client": 1991, "trust_env": 1992, "_validate_http_url": 1993, "parsed_url": 1994, "http": 1995, "_headers": 1996, "extras": 1997, "mutablemapping": 1998, "agent": 1999, "vllm_version": 2000, "get_response": 2001, "stream": 2002, "timeout": 2003, "extra_headers": 2004, "client": 2005, "headers": 2006, "get_async_response": 2007, "await": 2008, "get_bytes": 2009, "bytes": 2010, "raise_for_status": 2011, "async_get_bytes": 2012, "get_text": 2013, "async_get_text": 2014, "get_json": 2015, "async_get_json": 2016, "download_file": 2017, "save_path": 2018, "chunk_size": 2019, "iter_content": 2020, "async_download_file": 2021, "iter_chunked": 2022, "forward_context": 2023, "batchdescriptor": 2024, "namedtuple": 2025, "descriptor": 2026, "cudagraph": 2027, "dispatching": 2028, "minimal": 2029, "possible": 2030, "properly": 2031, "uniquely": 2032, "describe": 2033, "padded": 2034, "uniform_decode": 2035, "uniform": 2036, "dispatch": 2037, "supporting": 2038, "batches": 2039, "property": 2040, "non_uniform": 2041, "_compute_chunked_local_num_tokens": 2042, "num_tokens_across_dp_cpu": 2043, "max_num_tokens": 2044, "chunk_idx": 2045, "dp_size": 2046, "local_size": 2047, "dp_tokens": 2048, "lockstep": 2049, "even": 2050, "num_tokens_across_dp": 2051, "dp_rank": 2052, "gather": 2053, "across": 2054, "dp": 2055, "ranks": 2056, "num_tokens_tensor": 2057, "distributed": 2058, "parallel_state": 2059, "get_dp_group": 2060, "dist": 2061, "cpu_group": 2062, "parallel_config": 2063, "parallelconfig": 2064, "attn_metadata": 2065, "dpmetadata": 2066, "data_parallel_size": 2067, "data_parallel_rank": 2068, "num_prefill_tokens": 2069, "v0": 2070, "batchsize": 2071, "num_decode_tokens": 2072, "max_tokens_across_dp_cpu": 2073, "cu_tokens_across_dp_cpu": 2074, "chunked_sizes": 2075, "max_chunk_size_per_rank": 2076, "manager": 2077, "temporarily": 2078, "specific": 2079, "chunked": 2080, "processes": 2081, "designated": 2082, "portion": 2083, "others": 2084, "uneven": 2085, "break": 2086, "up": 2087, "total": 2088, "most": 2089, "sets": 2090, "local_sizes": 2091, "process": 2092, "derive": 2093, "determine": 2094, "wise": 2095, "inside": 2096, "allowed": 2097, "cu_sizes": 2098, "item": 2099, "yield": 2100, "get_chunk_sizes_across_dp_rank": 2101, "forwardcontext": 2102, "vllm_config": 2103, "compilation_config": 2104, "static_forward_context": 2105, "no_compile_layers": 2106, "attentionmetadata": 2107, "map": 2108, "layer_name": 2109, "layer": 2110, "making": 2111, "virtual_engines": 2112, "share": 2113, "virtual_engine": 2114, "dp_metadata": 2115, "full": 2116, "piecewise": 2117, "cudagraph_runtime_mode": 2118, "cudagraphmode": 2119, "batch_descriptor": 2120, "mode": 2121, "get_forward_context": 2122, "_forward_context": 2123, "set_forward_context": 2124, "vllmconfig": 2125, "stores": 2126, "etc": 2127, "inject": 2128, "logic": 2129, "global": 2130, "forward_start_time": 2131, "need_to_track_batchsize": 2132, "track_batchsize": 2133, "time": 2134, "perf_counter": 2135, "prev_context": 2136, "last_logging_time": 2137, "batchsize_logging_interval": 2138, "synchronous": 2139, "scheduling": 2140, "adding": 2141, "next": 2142, "synchronize": 2143, "measurement": 2144, "milliseconds": 2145, "batchsize_forward_time": 2146, "1000": 2147, "forward_stats": 2148, "bs": 2149, "profiling": 2150, "medium": 2151, "quantile": 2152, "round": 2153, "sort": 2154, "reverse": 2155, "stats": 2156, "median_time": 2157, "ms": 2158, "completionoutput": 2159, "completion": 2160, "token_ids": 2161, "ids": 2162, "probabilities": 2163, "top": 2164, "position": 2165, "requested": 2166, "reason": 2167, "why": 2168, "including": 2169, "encountering": 2170, "lora": 2171, "genericsequence": 2172, "samplelogprobs": 2173, "poolingoutput": 2174, "extracted": 2175, "states": 2176, "__eq__": 2177, "__class__": 2178, "request_id": 2179, "promptlogprobs": 2180, "requestmetrics": 2181, "encoder_prompt": 2182, "encoder_prompt_token_ids": 2183, "num_cached_tokens": 2184, "multi_modal_placeholders": 2185, "multimodalplaceholderdict": 2186, "kv_transfer_params": 2187, "still": 2188, "older": 2189, "without": 2190, "breaking": 2191, "ignoring": 2192, "extra": 2193, "next_output": 2194, "aggregate": 2195, "next_completion": 2196, "enumerate": 2197, "mutablesequence": 2198, "from_seq_group": 2199, "seq_group": 2200, "sequencegroup": 2201, "use_cache": 2202, "seq_id_to_seq_group": 2203, "sequencegroupbase": 2204, "is_finished": 2205, "assembled_seq_group": 2206, "maybe_assemble_group": 2207, "finish_seq": 2208, "clear": 2209, "seq": 2210, "to_be_finished": 2211, "sub_request_id": 2212, "seq_id_to_index": 2213, "del": 2214, "completionrequest": 2215, "init": 2216, "needed": 2217, "cached_request_output": 2218, "top_n_seqs": 2219, "get_seqs": 2220, "because": 2221, "sampled": 2222, "include_logprobs": 2223, "text_buffer_length": 2224, "include_prompt": 2225, "output_text": 2226, "get_output_text_to_return": 2227, "output_token_ids": 2228, "get_output_token_ids_to_return": 2229, "num_output_tokens": 2230, "get_num_cached_tokens": 2231, "output_logprobs": 2232, "slice": 2233, "applicable": 2234, "finishes": 2235, "get_output_len": 2236, "cached_outputs": 2237, "get_cumulative_logprob": 2238, "sequencestatus": 2239, "get_finished_reason": 2240, "finished_time": 2241, "fin": 2242, "ished": 2243, "set_finished_time": 2244, "init_kwargs": 2245, "request_output": 2246, "poolingrequestoutput": 2247, "generic": 2248, "_o": 2249, "unique": 2250, "identifier": 2251, "flag": 2252, "staticmethod": 2253, "pooled_data": 2254, "requestoutputfactory": 2255, "embeddingoutput": 2256, "embedding": 2257, "vector": 2258, "floats": 2259, "depends": 2260, "from_base": 2261, "pooling_output": 2262, "tolist": 2263, "hidden_size": 2264, "embeddingrequestoutput": 2265, "classificationoutput": 2266, "classification": 2267, "probs": 2268, "classes": 2269, "num_classes": 2270, "classificationrequestoutput": 2271, "scoringoutput": 2272, "scoring": 2273, "similarity": 2274, "squeeze": 2275, "scoringrequestoutput": 2276, "collect_env": 2277, "stderr": 2278, "popen": 2279, "pipe": 2280, "raw_output": 2281, "raw_err": 2282, "communicate": 2283, "rc": 2284, "get_platform": 2285, "win32": 2286, "enc": 2287, "oem": 2288, "locale": 2289, "getpreferredencoding": 2290, "topo": 2291, "whitespace": 2292, "meaningful": 2293, "rstrip": 2294, "filenotfounderror": 2295, "cmd_str": 2296, "127": 2297, "run_and_read_all": 2298, "run_lambda": 2299, "reads": 2300, "run_and_parse_first_match": 2301, "run_and_return_first_line": 2302, "get_conda_packages": 2303, "patterns": 2304, "default_conda_patterns": 2305, "conda": 2306, "conda_exe": 2307, "splitlines": 2308, "get_gcc_version": 2309, "gcc": 2310, "get_clang_version": 2311, "clang": 2312, "get_cmake_version": 2313, "get_nvidia_driver_version": 2314, "darwin": 2315, "cmd": 2316, "kextstat": 2317, "grep": 2318, "get_nvidia_smi": 2319, "get_gpu_info": 2320, "torch_available": 2321, "is_available": 2322, "prop": 2323, "get_device_properties": 2324, "gcnarchname": 2325, "gcnarch": 2326, "nogcnarchnameonoldpytorch": 2327, "get_device_name": 2328, "uuid_regex": 2329, "uuid": 2330, "anonymize": 2331, "gpus": 2332, "sub": 2333, "get_running_cuda_version": 2334, "get_cudnn_version": 2335, "libcudnn": 2336, "hard": 2337, "tell": 2338, "being": 2339, "system_root": 2340, "systemroot": 2341, "windows": 2342, "cuda_path": 2343, "where_cmd": 2344, "system32": 2345, "cudnn_cmd": 2346, "cudnn": 2347, "dll": 2348, "drivers": 2349, "usr": 2350, "installation": 2351, "guide": 2352, "mac": 2353, "deeplearning": 2354, "sdk": 2355, "installmac": 2356, "cudnn_library": 2357, "library": 2358, "installed": 2359, "elsewhere": 2360, "ls": 2361, "ldconfig": 2362, "rev": 2363, "cut": 2364, "f1": 2365, "permission": 2366, "realpath": 2367, "files_set": 2368, "eliminate": 2369, "symbolic": 2370, "links": 2371, "alphabetize": 2372, "deterministic": 2373, "probably": 2374, "linux": 2375, "program_files_root": 2376, "programfiles": 2377, "program": 2378, "legacy_path": 2379, "corporation": 2380, "nvsmi": 2381, "new_path": 2382, "smis": 2383, "candidate_smi": 2384, "hipcc": 2385, "get_neuron_sdk_version": 2386, "script": 2387, "changes": 2388, "git_sha": 2389, "date": 2390, "summarize_vllm_build_flags": 2391, "constant": 2392, "archs": 2393, "torch_cuda_arch_list": 2394, "neuron_cores": 2395, "get_gpu_topo": 2396, "showtopo": 2397, "get_cpu_info": 2398, "lscpu": 2399, "wmic": 2400, "manufacturer": 2401, "family": 2402, "architecture": 2403, "processortype": 2404, "deviceid": 2405, "currentclockspeed": 2406, "maxclockspeed": 2407, "l2cachesize": 2408, "l2cachespeed": 2409, "revision": 2410, "sysctl": 2411, "machdep": 2412, "brand_string": 2413, "cpu_info": 2414, "cygwin": 2415, "get_mac_version": 2416, "sw_vers": 2417, "productversion": 2418, "get_windows_version": 2419, "wmic_cmd": 2420, "wbem": 2421, "findstr_cmd": 2422, "findstr": 2423, "caption": 2424, "get_lsb_version": 2425, "lsb_release": 2426, "description": 2427, "check_release_file": 2428, "pretty_name": 2429, "get_os": 2430, "machine": 2431, "macos": 2432, "ubuntu": 2433, "debian": 2434, "desc": 2435, "reading": 2436, "get_python_platform": 2437, "get_libc_version": 2438, "libc_ver": 2439, "get_pip_packages": 2440, "pip": 2441, "packages": 2442, "default_pip_patterns": 2443, "run_with_pip": 2444, "pip_spec": 2445, "find_spec": 2446, "pip_available": 2447, "importerror": 2448, "mpip": 2449, "freeze": 2450, "uv": 2451, "collect": 2452, "pip_version": 2453, "pip3": 2454, "get_cachingallocator_config": 2455, "ca_config": 2456, "pytorch_cuda_alloc_conf": 2457, "get_cuda_module_loading_config": 2458, "cuda_module_loading": 2459, "is_xnnpack_available": 2460, "xnnpack": 2461, "attr": 2462, "get_env_vars": 2463, "secret_terms": 2464, "secret": 2465, "access": 2466, "password": 2467, "report_prefix": 2468, "nccl": 2469, "cublas": 2470, "omp_": 2471, "mkl_": 2472, "term": 2473, "lower": 2474, "get_env_info": 2475, "pip_list_output": 2476, "debug_mode_str": 2477, "cuda_available_str": 2478, "hip_compiled_version": 2479, "hip_runtime_version": 2480, "miopen_runtime_version": 2481, "get_version_or_na": 2482, "_lst": 2483, "rsplit": 2484, "_show_config": 2485, "miopen": 2486, "sys_version": 2487, "conda_packages": 2488, "neuron_sdk_version": 2489, "vllm_build_flags": 2490, "gpu_topo": 2491, "systemenv": 2492, "torch_version": 2493, "is_debug_build": 2494, "python_version": 2495, "maxsize": 2496, "bit_length": 2497, "python_platform": 2498, "is_cuda_available": 2499, "cuda_compiled_version": 2500, "cuda_runtime_version": 2501, "get_cud": 2502, "a_module_loading_config": 2503, "nvidia_gpu_models": 2504, "nvidia_driver_version": 2505, "cudnn_version": 2506, "pip_packages": 2507, "libc_version": 2508, "gcc_version": 2509, "clang_version": 2510, "cmake_version": 2511, "caching_allocator_config": 2512, "replace_nones": 2513, "dct": 2514, "replacement": 2515, "replace_bools": 2516, "yes": 2517, "prepend": 2518, "tag": 2519, "lines": 2520, "updated_lines": 2521, "replace_if_empty": 2522, "relevant": 2523, "maybe_start_on_next_line": 2524, "multiline": 2525, "get_pretty_env_info": 2526, "pretty_str": 2527, "collecting": 2528, "_crash_handler": 2529, "minidump_dir": 2530, "default_minidump_dir": 2531, "dumps": 2532, "dump": 2533, "listdir": 2534, "getctime": 2535, "ctime": 2536, "creation_time": 2537, "fromtimestamp": 2538, "detected": 2539, "minidump": 2540, "created": 2541, "report": 2542, "array_full": 2543, "array": 2544, "equivalent": 2545, "vllm_token_id_array_type": 2546, "infos": 2547, "attributes": 2548, "chosen": 2549, "vocab": 2550, "decoded_token": 2551, "decoded": 2552, "waiting": 2553, "swapped": 2554, "considered": 2555, "finished_stopped": 2556, "finished_length_capped": 2557, "finished_aborted": 2558, "finished_ignored": 2559, "abort": 2560, "whose": 2561, "lengths": 2562, "longer": 2563, "cap": 2564, "therefore": 2565, "sequencestage": 